; ModuleID = '/home/snoora/qemu/build/libcommon.a.p/hw_char_pl011.c.o'
source_filename = "../hw/char/pl011.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.TypeInfo = type { ptr, ptr, i64, i64, ptr, ptr, ptr, i8, i64, ptr, ptr, ptr, ptr }
%struct.MemoryRegionOps = type { ptr, ptr, ptr, ptr, i32, %struct.anon.4, %struct.anon.5 }
%struct.anon.4 = type { i32, i32, i8, ptr }
%struct.anon.5 = type { i32, i32, i8 }
%struct.VMStateDescription = type { ptr, i8, i8, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.Property = type { ptr, ptr, i64, i8, i64, i8, %union.anon.9, i32, ptr, i32, ptr }
%union.anon.9 = type { i64 }
%struct.VMStateField = type { ptr, ptr, i64, i64, i64, i32, i64, i64, ptr, i32, ptr, i32, i32, ptr }
%struct.VMStateInfo = type { ptr, ptr, ptr }
%struct.PropertyInfo = type { ptr, ptr, ptr, i8, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.PL011State = type { %struct.SysBusDevice, %struct.MemoryRegion, i32, i32, i32, i32, i32, i32, i32, [16 x i32], i32, i32, i32, i32, i32, i32, i32, %struct.CharBackend, [6 x ptr], ptr, i8, ptr, [8 x i8] }
%struct.SysBusDevice = type { %struct.DeviceState, i32, [32 x %struct.anon.3], i32, [32 x i32] }

!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !51, line: 20, baseType: !46, size: 32, elements: !52)
!51 = !DIFile(filename: "include/chardev/char.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "511c7fe47d4c53f1b2261c424644c265")
!52 = !{!53, !54, !55, !56, !57}
!53 = !DIEnumerator(name: "CHR_EVENT_BREAK", value: 0)
!54 = !DIEnumerator(name: "CHR_EVENT_OPENED", value: 1)
!55 = !DIEnumerator(name: "CHR_EVENT_MUX_IN", value: 2)
!56 = !DIEnumerator(name: "CHR_EVENT_MUX_OUT", value: 3)
!57 = !DIEnumerator(name: "CHR_EVENT_CLOSED", value: 4)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "device_endian", file: !59, line: 45, baseType: !46, size: 32, elements: !60)
!59 = !DIFile(filename: "include/exec/cpu-common.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "dd363f974d6967ea1215596bce64439b")
!60 = !{!61, !62, !63}
!61 = !DIEnumerator(name: "DEVICE_NATIVE_ENDIAN", value: 0)
!62 = !DIEnumerator(name: "DEVICE_BIG_ENDIAN", value: 1)
!63 = !DIEnumerator(name: "DEVICE_LITTLE_ENDIAN", value: 2)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 42, baseType: !46, size: 32, elements: !66)
!65 = !DIFile(filename: "include/qemu/module.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "6305787c50fb72a9b185dddd38011933")
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75}
!67 = !DIEnumerator(name: "MODULE_INIT_MIGRATION", value: 0)
!68 = !DIEnumerator(name: "MODULE_INIT_BLOCK", value: 1)
!69 = !DIEnumerator(name: "MODULE_INIT_OPTS", value: 2)
!70 = !DIEnumerator(name: "MODULE_INIT_QOM", value: 3)
!71 = !DIEnumerator(name: "MODULE_INIT_TRACE", value: 4)
!72 = !DIEnumerator(name: "MODULE_INIT_XEN_BACKEND", value: 5)
!73 = !DIEnumerator(name: "MODULE_INIT_LIBQOS", value: 6)
!74 = !DIEnumerator(name: "MODULE_INIT_FUZZ_TARGET", value: 7)
!75 = !DIEnumerator(name: "MODULE_INIT_MAX", value: 8)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !77, line: 157, baseType: !46, size: 32, elements: !78)
!77 = !DIFile(filename: "include/migration/vmstate.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "65df9f6deb4ce9138d58627c1ae02bd0")
!78 = !{!79, !80, !81, !82, !83, !84, !85}
!79 = !DIEnumerator(name: "MIG_PRI_DEFAULT", value: 0)
!80 = !DIEnumerator(name: "MIG_PRI_IOMMU", value: 1)
!81 = !DIEnumerator(name: "MIG_PRI_PCI_BUS", value: 2)
!82 = !DIEnumerator(name: "MIG_PRI_VIRTIO_MEM", value: 3)
!83 = !DIEnumerator(name: "MIG_PRI_GICV3_ITS", value: 4)
!84 = !DIEnumerator(name: "MIG_PRI_GICV3", value: 5)
!85 = !DIEnumerator(name: "MIG_PRI_MAX", value: 6)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "VMStateFlags", file: !77, line: 51, baseType: !46, size: 32, elements: !87)
!87 = !{!88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104}
!88 = !DIEnumerator(name: "VMS_SINGLE", value: 1)
!89 = !DIEnumerator(name: "VMS_POINTER", value: 2)
!90 = !DIEnumerator(name: "VMS_ARRAY", value: 4)
!91 = !DIEnumerator(name: "VMS_STRUCT", value: 8)
!92 = !DIEnumerator(name: "VMS_VARRAY_INT32", value: 16)
!93 = !DIEnumerator(name: "VMS_BUFFER", value: 32)
!94 = !DIEnumerator(name: "VMS_ARRAY_OF_POINTER", value: 64)
!95 = !DIEnumerator(name: "VMS_VARRAY_UINT16", value: 128)
!96 = !DIEnumerator(name: "VMS_VBUFFER", value: 256)
!97 = !DIEnumerator(name: "VMS_MULTIPLY", value: 512)
!98 = !DIEnumerator(name: "VMS_VARRAY_UINT8", value: 1024)
!99 = !DIEnumerator(name: "VMS_VARRAY_UINT32", value: 2048)
!100 = !DIEnumerator(name: "VMS_MUST_EXIST", value: 4096)
!101 = !DIEnumerator(name: "VMS_ALLOC", value: 8192)
!102 = !DIEnumerator(name: "VMS_MULTIPLY_ELEMENTS", value: 16384)
!103 = !DIEnumerator(name: "VMS_VSTRUCT", value: 32768)
!104 = !DIEnumerator(name: "VMS_END", value: 65536)
!105 = !{!106, !350, !148, !500, !135, !691, !693, !118, !182}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "DeviceState", file: !108, line: 77, baseType: !109)
!108 = !DIFile(filename: "include/hw/qdev-core.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "67264af7ed760669a154394b865d52dd")
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DeviceState", file: !108, line: 220, size: 1280, elements: !110)
!110 = !{!111, !166, !168, !169, !171, !172, !177, !181, !183, !184, !251, !283, !335, !340, !341, !342, !343, !344, !345}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "parent_obj", scope: !109, file: !108, line: 222, baseType: !112, size: 320)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !113, line: 77, baseType: !114)
!113 = !DIFile(filename: "include/qemu/typedefs.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "7d670dc4483fed36c57e997370d4c9a1")
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !115, line: 153, size: 320, elements: !116)
!115 = !DIFile(filename: "include/qom/object.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "9e6a829e5f72c582a3bea10c17cbf078")
!116 = !{!117, !154, !159, !160, !165}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !114, file: !115, line: 156, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectClass", file: !113, line: 78, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectClass", file: !115, line: 127, size: 768, elements: !121)
!121 = !{!122, !126, !137, !142, !143, !149}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !120, file: !115, line: 130, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", file: !115, line: 21, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "TypeImpl", file: !115, line: 20, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "interfaces", scope: !120, file: !115, line: 131, baseType: !127, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !129, line: 39, baseType: !130)
!129 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "", checksumkind: CSK_MD5, checksum: "c2b16cbedbdd77e3f819637c21501624")
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !129, line: 41, size: 128, elements: !131)
!131 = !{!132, !136}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !130, file: !129, line: 43, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !134, line: 109, baseType: !135)
!134 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "bb471ab4f4c8d1bff5846ccdfd1b3ac4")
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !130, file: !129, line: 44, baseType: !127, size: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "object_cast_cache", scope: !120, file: !115, line: 133, baseType: !138, size: 256, offset: 128)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 256, elements: !140)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!140 = !{!141}
!141 = !DISubrange(count: 4)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "class_cast_cache", scope: !120, file: !115, line: 134, baseType: !138, size: 256, offset: 384)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "unparent", scope: !120, file: !115, line: 136, baseType: !144, size: 64, offset: 640)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectUnparent", file: !115, line: 109, baseType: !146)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !148}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !120, file: !115, line: 138, baseType: !150, size: 64, offset: 704)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !152, line: 40, baseType: !153)
!152 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "", checksumkind: CSK_MD5, checksum: "ff178276f16d53966cd41952349b047f")
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !152, line: 40, flags: DIFlagFwdDecl)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !114, file: !115, line: 157, baseType: !155, size: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectFree", file: !115, line: 117, baseType: !157)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !135}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !114, file: !115, line: 158, baseType: !150, size: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !114, file: !115, line: 159, baseType: !161, size: 32, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !162, line: 26, baseType: !163)
!162 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "256fcabbefa27ca8cf5e6d37525e6e16")
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !164, line: 42, baseType: !46)
!164 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e1865d9fe29fe1b5ced550b7ba458f9e")
!165 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !114, file: !115, line: 160, baseType: !148, size: 64, offset: 256)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !109, file: !108, line: 228, baseType: !167, size: 64, offset: 320)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "canonical_path", scope: !109, file: !108, line: 232, baseType: !167, size: 64, offset: 384)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "realized", scope: !109, file: !108, line: 236, baseType: !170, size: 8, offset: 448)
!170 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "pending_deleted_event", scope: !109, file: !108, line: 240, baseType: !170, size: 8, offset: 456)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "pending_deleted_expires_ms", scope: !109, file: !108, line: 244, baseType: !173, size: 64, offset: 512)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !174, line: 27, baseType: !175)
!174 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "649b383a60bfa3eb90e85840b2b0be20")
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !164, line: 44, baseType: !176)
!176 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !109, file: !108, line: 248, baseType: !178, size: 64, offset: 576)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "QDict", file: !113, line: 91, baseType: !180)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "QDict", file: !113, line: 91, flags: DIFlagFwdDecl)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "hotplugged", scope: !109, file: !108, line: 252, baseType: !182, size: 32, offset: 640)
!182 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "allow_unplug_during_migration", scope: !109, file: !108, line: 256, baseType: !170, size: 8, offset: 672)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "parent_bus", scope: !109, file: !108, line: 260, baseType: !185, size: 64, offset: 704)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "BusState", file: !113, line: 36, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BusState", file: !108, line: 378, size: 960, elements: !188)
!188 = !{!189, !190, !191, !192, !197, !198, !199, !200, !201, !235, !243}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !187, file: !108, line: 380, baseType: !112, size: 320)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !187, file: !108, line: 382, baseType: !106, size: 64, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !187, file: !108, line: 383, baseType: !167, size: 64, offset: 384)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "hotplug_handler", scope: !187, file: !108, line: 384, baseType: !193, size: 64, offset: 448)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "HotplugHandler", file: !195, line: 25, baseType: !196)
!195 = !DIFile(filename: "include/hw/hotplug.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "15267d9ba97c18564fc7d41a146ac8e8")
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "HotplugHandler", file: !195, line: 25, flags: DIFlagFwdDecl)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "max_index", scope: !187, file: !108, line: 385, baseType: !182, size: 32, offset: 512)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "realized", scope: !187, file: !108, line: 386, baseType: !170, size: 8, offset: 544)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !187, file: !108, line: 387, baseType: !170, size: 8, offset: 552)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "num_children", scope: !187, file: !108, line: 388, baseType: !182, size: 32, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !187, file: !108, line: 394, baseType: !202, size: 128, offset: 640)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "BusChildHead", file: !108, line: 364, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !108, line: 364, size: 128, elements: !204)
!204 = !{!205, !234}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !203, file: !108, line: 364, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BusChild", file: !108, line: 355, size: 384, elements: !208)
!208 = !{!209, !220, !221, !222}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !207, file: !108, line: 356, baseType: !210, size: 128)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcu_head", file: !211, line: 138, size: 128, elements: !212)
!211 = !DIFile(filename: "include/qemu/rcu.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "1fa5966fe8848bb59b99486d796e94fb")
!212 = !{!213, !215}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !210, file: !211, line: 139, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !210, file: !211, line: 140, baseType: !216, size: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCUCBFunc", file: !211, line: 136, baseType: !218)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !214}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !207, file: !108, line: 357, baseType: !106, size: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !207, file: !108, line: 358, baseType: !182, size: 32, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !207, file: !108, line: 359, baseType: !223, size: 128, offset: 256)
!223 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !207, file: !108, line: 359, size: 128, elements: !224)
!224 = !{!225, !226}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !223, file: !108, line: 359, baseType: !206, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_circ", scope: !223, file: !108, line: 359, baseType: !227, size: 128)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "QTailQLink", file: !228, line: 388, baseType: !229)
!228 = !DIFile(filename: "include/qemu/queue.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "037402447fe7017dc8313a983f6fbe7b")
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QTailQLink", file: !228, line: 385, size: 128, elements: !230)
!230 = !{!231, !232}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tql_next", scope: !229, file: !228, line: 386, baseType: !135, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tql_prev", scope: !229, file: !228, line: 387, baseType: !233, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_circ", scope: !203, file: !108, line: 364, baseType: !227, size: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !187, file: !108, line: 398, baseType: !236, size: 128, offset: 768)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "BusStateEntry", file: !108, line: 365, baseType: !237)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !108, line: 365, size: 128, elements: !238)
!238 = !{!239, !241}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !237, file: !108, line: 365, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !237, file: !108, line: 365, baseType: !242, size: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !187, file: !108, line: 402, baseType: !244, size: 64, offset: 896)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResettableState", file: !245, line: 25, baseType: !246)
!245 = !DIFile(filename: "include/hw/resettable.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "f1271920a2d7d7b6d7542c3e61d6e416")
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ResettableState", file: !245, line: 141, size: 64, elements: !247)
!247 = !{!248, !249, !250}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !246, file: !245, line: 142, baseType: !46, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "hold_phase_pending", scope: !246, file: !245, line: 143, baseType: !170, size: 8, offset: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "exit_phase_in_progress", scope: !246, file: !245, line: 144, baseType: !170, size: 8, offset: 40)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "gpios", scope: !109, file: !108, line: 264, baseType: !252, size: 64, offset: 768)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "NamedGPIOListHead", file: !108, line: 210, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !108, line: 210, size: 64, elements: !254)
!254 = !{!255}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "lh_first", scope: !253, file: !108, line: 210, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NamedGPIOList", file: !108, line: 186, size: 320, elements: !258)
!258 = !{!259, !260, !275, !276, !277}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !257, file: !108, line: 187, baseType: !167, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !257, file: !108, line: 188, baseType: !261, size: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "qemu_irq", file: !113, line: 128, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IRQState", file: !265, line: 11, size: 512, elements: !266)
!265 = !DIFile(filename: "include/hw/irq.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "c3d3cf679636ee2dd93a459edfc5173a")
!266 = !{!267, !268, !273, !274}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "parent_obj", scope: !264, file: !265, line: 12, baseType: !112, size: 320)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !264, file: !265, line: 14, baseType: !269, size: 64, offset: 320)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "qemu_irq_handler", file: !113, line: 133, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !135, !182, !182}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !264, file: !265, line: 15, baseType: !135, size: 64, offset: 384)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !264, file: !265, line: 16, baseType: !182, size: 32, offset: 448)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "num_in", scope: !257, file: !108, line: 189, baseType: !182, size: 32, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "num_out", scope: !257, file: !108, line: 190, baseType: !182, size: 32, offset: 160)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !257, file: !108, line: 191, baseType: !278, size: 128, offset: 192)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !257, file: !108, line: 191, size: 128, elements: !279)
!279 = !{!280, !281}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !278, file: !108, line: 191, baseType: !256, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !278, file: !108, line: 191, baseType: !282, size: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "clocks", scope: !109, file: !108, line: 268, baseType: !284, size: 64, offset: 832)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "NamedClockListHead", file: !108, line: 211, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !108, line: 211, size: 64, elements: !286)
!286 = !{!287}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "lh_first", scope: !285, file: !108, line: 211, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NamedClockList", file: !108, line: 197, size: 320, elements: !290)
!290 = !{!291, !292, !327, !328, !329}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !289, file: !108, line: 198, baseType: !167, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "clock", scope: !289, file: !108, line: 199, baseType: !293, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "Clock", file: !108, line: 194, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Clock", file: !45, line: 71, size: 960, elements: !296)
!296 = !{!297, !298, !302, !303, !309, !310, !311, !312, !313, !316, !321}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "parent_obj", scope: !295, file: !45, line: 73, baseType: !112, size: 320)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !295, file: !45, line: 78, baseType: !299, size: 64, offset: 320)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !162, line: 27, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !164, line: 45, baseType: !301)
!301 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "canonical_path", scope: !295, file: !45, line: 79, baseType: !167, size: 64, offset: 384)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !295, file: !45, line: 80, baseType: !304, size: 64, offset: 448)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClockCallback", file: !45, line: 36, baseType: !306)
!306 = !DISubroutineType(types: !307)
!307 = !{null, !135, !308}
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClockEvent", file: !45, line: 34, baseType: !44)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "callback_opaque", scope: !295, file: !45, line: 81, baseType: !135, size: 64, offset: 512)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "callback_events", scope: !295, file: !45, line: 82, baseType: !46, size: 32, offset: 576)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "multiplier", scope: !295, file: !45, line: 85, baseType: !161, size: 32, offset: 608)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "divider", scope: !295, file: !45, line: 86, baseType: !161, size: 32, offset: 640)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !295, file: !45, line: 89, baseType: !314, size: 64, offset: 704)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "Clock", file: !45, line: 23, baseType: !295)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !295, file: !45, line: 90, baseType: !317, size: 64, offset: 768)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !295, file: !45, line: 90, size: 64, elements: !318)
!318 = !{!319}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "lh_first", scope: !317, file: !45, line: 90, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !295, file: !45, line: 91, baseType: !322, size: 128, offset: 832)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !295, file: !45, line: 91, size: 128, elements: !323)
!323 = !{!324, !325}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !322, file: !45, line: 91, baseType: !320, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !322, file: !45, line: 91, baseType: !326, size: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !289, file: !108, line: 200, baseType: !170, size: 8, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !289, file: !108, line: 201, baseType: !170, size: 8, offset: 136)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !289, file: !108, line: 202, baseType: !330, size: 128, offset: 192)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !289, file: !108, line: 202, size: 128, elements: !331)
!331 = !{!332, !333}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !330, file: !108, line: 202, baseType: !288, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !330, file: !108, line: 202, baseType: !334, size: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "child_bus", scope: !109, file: !108, line: 272, baseType: !336, size: 64, offset: 896)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "BusStateHead", file: !108, line: 212, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !108, line: 212, size: 64, elements: !338)
!338 = !{!339}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "lh_first", scope: !337, file: !108, line: 212, baseType: !240, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "num_child_bus", scope: !109, file: !108, line: 276, baseType: !182, size: 32, offset: 960)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "instance_id_alias", scope: !109, file: !108, line: 280, baseType: !182, size: 32, offset: 992)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "alias_required_for_version", scope: !109, file: !108, line: 285, baseType: !182, size: 32, offset: 1024)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !109, file: !108, line: 289, baseType: !244, size: 64, offset: 1056)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "unplug_blockers", scope: !109, file: !108, line: 293, baseType: !127, size: 64, offset: 1152)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "mem_reentrancy_guard", scope: !109, file: !108, line: 299, baseType: !346, size: 8, offset: 1216)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemReentrancyGuard", file: !108, line: 207, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !108, line: 205, size: 8, elements: !348)
!348 = !{!349}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "engaged_in_io", scope: !347, file: !108, line: 206, baseType: !170, size: 8)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysBusDevice", file: !29, line: 19, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SysBusDevice", file: !29, line: 54, size: 6528, elements: !353)
!353 = !{!354, !355, !356, !497, !498}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "parent_obj", scope: !352, file: !29, line: 56, baseType: !107, size: 1280)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "num_mmio", scope: !352, file: !29, line: 59, baseType: !182, size: 32, offset: 1280)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "mmio", scope: !352, file: !29, line: 63, baseType: !357, size: 4096, offset: 1344)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !358, size: 4096, elements: !495)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !352, file: !29, line: 60, size: 128, elements: !359)
!359 = !{!360, !363}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !358, file: !29, line: 61, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwaddr", file: !362, line: 11, baseType: !299)
!362 = !DIFile(filename: "include/exec/hwaddr.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "fa6f76ef63acb9da0cc99a3662166d11")
!363 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !358, file: !29, line: 62, baseType: !364, size: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemoryRegion", file: !113, line: 67, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MemoryRegion", file: !367, line: 755, size: 2176, elements: !368)
!367 = !DIFile(filename: "include/exec/memory.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "ac0603821d1f9b60fe091bb4fb80e29d")
!368 = !{!369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !382, !383, !387, !388, !389, !441, !442, !443, !444, !450, !451, !455, !456, !457, !458, !459, !460, !461, !462, !463, !466, !472, !477, !484, !485, !486, !490, !494}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "parent_obj", scope: !366, file: !367, line: 756, baseType: !112, size: 320)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "romd_mode", scope: !366, file: !367, line: 761, baseType: !170, size: 8, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ram", scope: !366, file: !367, line: 762, baseType: !170, size: 8, offset: 328)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "subpage", scope: !366, file: !367, line: 763, baseType: !170, size: 8, offset: 336)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !366, file: !367, line: 764, baseType: !170, size: 8, offset: 344)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "nonvolatile", scope: !366, file: !367, line: 765, baseType: !170, size: 8, offset: 352)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "rom_device", scope: !366, file: !367, line: 766, baseType: !170, size: 8, offset: 360)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "flush_coalesced_mmio", scope: !366, file: !367, line: 767, baseType: !170, size: 8, offset: 368)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "unmergeable", scope: !366, file: !367, line: 768, baseType: !170, size: 8, offset: 376)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_log_mask", scope: !366, file: !367, line: 769, baseType: !379, size: 8, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !162, line: 24, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !164, line: 38, baseType: !381)
!381 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "is_iommu", scope: !366, file: !367, line: 770, baseType: !170, size: 8, offset: 392)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ram_block", scope: !366, file: !367, line: 771, baseType: !384, size: 64, offset: 448)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAMBlock", file: !113, line: 108, baseType: !386)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "RAMBlock", file: !113, line: 108, flags: DIFlagFwdDecl)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !366, file: !367, line: 772, baseType: !148, size: 64, offset: 512)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !366, file: !367, line: 774, baseType: !106, size: 64, offset: 576)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !366, file: !367, line: 776, baseType: !390, size: 64, offset: 640)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemoryRegionOps", file: !367, line: 80, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MemoryRegionOps", file: !367, line: 264, size: 640, elements: !394)
!394 = !{!395, !399, !403, !420, !424, !425, !435}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !393, file: !367, line: 267, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!299, !135, !361, !46}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !393, file: !367, line: 272, baseType: !400, size: 64, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{null, !135, !361, !299, !46}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "read_with_attrs", scope: !393, file: !367, line: 277, baseType: !404, size: 64, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!407, !135, !361, !409, !46, !410}
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemTxResult", file: !408, line: 78, baseType: !161)
!408 = !DIFile(filename: "include/exec/memattrs.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "9b6ae885d22d69d08ca00517d6823a7a")
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemTxAttrs", file: !408, line: 60, baseType: !411)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MemTxAttrs", file: !408, line: 25, size: 32, elements: !412)
!412 = !{!413, !414, !415, !416, !417, !418, !419}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "unspecified", scope: !411, file: !408, line: 31, baseType: !46, size: 1, flags: DIFlagBitField, extraData: i64 0)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "secure", scope: !411, file: !408, line: 36, baseType: !46, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !411, file: !408, line: 42, baseType: !46, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !411, file: !408, line: 44, baseType: !46, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !411, file: !408, line: 52, baseType: !46, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "requester_id", scope: !411, file: !408, line: 54, baseType: !46, size: 16, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !411, file: !408, line: 59, baseType: !46, size: 8, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "write_with_attrs", scope: !393, file: !367, line: 282, baseType: !421, size: 64, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!407, !135, !361, !299, !46, !410}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "endianness", scope: !393, file: !367, line: 288, baseType: !58, size: 32, offset: 256)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !393, file: !367, line: 308, baseType: !426, size: 192, offset: 320)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !393, file: !367, line: 290, size: 192, elements: !427)
!427 = !{!428, !429, !430, !431}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "min_access_size", scope: !426, file: !367, line: 294, baseType: !46, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "max_access_size", scope: !426, file: !367, line: 295, baseType: !46, size: 32, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "unaligned", scope: !426, file: !367, line: 299, baseType: !170, size: 8, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "accepts", scope: !426, file: !367, line: 305, baseType: !432, size: 64, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!170, !135, !361, !46, !170, !410}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !393, file: !367, line: 323, baseType: !436, size: 96, offset: 512)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !393, file: !367, line: 310, size: 96, elements: !437)
!437 = !{!438, !439, !440}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "min_access_size", scope: !436, file: !367, line: 314, baseType: !46, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "max_access_size", scope: !436, file: !367, line: 318, baseType: !46, size: 32, offset: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "unaligned", scope: !436, file: !367, line: 322, baseType: !170, size: 8, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !366, file: !367, line: 777, baseType: !135, size: 64, offset: 704)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "container", scope: !366, file: !367, line: 778, baseType: !364, size: 64, offset: 768)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "mapped_via_alias", scope: !366, file: !367, line: 779, baseType: !182, size: 32, offset: 832)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !366, file: !367, line: 780, baseType: !445, size: 128, offset: 896)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "Int128", file: !446, line: 12, baseType: !447)
!446 = !DIFile(filename: "include/qemu/int128.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "5836b066b8c746f64a01476985ac72dd")
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int128_t", file: !448, baseType: !449)
!448 = !DIFile(filename: "../hw/char/pl011.c", directory: "/home/snoora/qemu/build")
!449 = !DIBasicType(name: "__int128", size: 128, encoding: DW_ATE_signed)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !366, file: !367, line: 781, baseType: !361, size: 64, offset: 1024)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !366, file: !367, line: 782, baseType: !452, size: 64, offset: 1088)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{null, !364}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !366, file: !367, line: 783, baseType: !299, size: 64, offset: 1152)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "terminates", scope: !366, file: !367, line: 784, baseType: !170, size: 8, offset: 1216)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ram_device", scope: !366, file: !367, line: 785, baseType: !170, size: 8, offset: 1224)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !366, file: !367, line: 786, baseType: !170, size: 8, offset: 1232)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "warning_printed", scope: !366, file: !367, line: 787, baseType: !170, size: 8, offset: 1240)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "vga_logging_count", scope: !366, file: !367, line: 788, baseType: !379, size: 8, offset: 1248)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !366, file: !367, line: 789, baseType: !364, size: 64, offset: 1280)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "alias_offset", scope: !366, file: !367, line: 790, baseType: !361, size: 64, offset: 1344)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !366, file: !367, line: 791, baseType: !464, size: 32, offset: 1408)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !174, line: 26, baseType: !465)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !164, line: 41, baseType: !182)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "subregions", scope: !366, file: !367, line: 792, baseType: !467, size: 128, offset: 1472)
!467 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !366, file: !367, line: 792, size: 128, elements: !468)
!468 = !{!469, !471}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !467, file: !367, line: 792, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_circ", scope: !467, file: !367, line: 792, baseType: !227, size: 128)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "subregions_link", scope: !366, file: !367, line: 793, baseType: !473, size: 128, offset: 1600)
!473 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !366, file: !367, line: 793, size: 128, elements: !474)
!474 = !{!475, !476}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !473, file: !367, line: 793, baseType: !470, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_circ", scope: !473, file: !367, line: 793, baseType: !227, size: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "coalesced", scope: !366, file: !367, line: 794, baseType: !478, size: 128, offset: 1728)
!478 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !366, file: !367, line: 794, size: 128, elements: !479)
!479 = !{!480, !483}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !478, file: !367, line: 794, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "CoalescedMemoryRange", file: !367, line: 748, flags: DIFlagFwdDecl)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_circ", scope: !478, file: !367, line: 794, baseType: !227, size: 128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !366, file: !367, line: 795, baseType: !139, size: 64, offset: 1856)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ioeventfd_nb", scope: !366, file: !367, line: 796, baseType: !46, size: 32, offset: 1920)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ioeventfds", scope: !366, file: !367, line: 797, baseType: !487, size: 64, offset: 1984)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemoryRegionIoeventfd", file: !367, line: 749, baseType: !489)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemoryRegionIoeventfd", file: !367, line: 749, flags: DIFlagFwdDecl)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "rdm", scope: !366, file: !367, line: 798, baseType: !491, size: 64, offset: 2048)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "RamDiscardManager", file: !367, line: 48, baseType: !493)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "RamDiscardManager", file: !367, line: 48, flags: DIFlagFwdDecl)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "disable_reentrancy_guard", scope: !366, file: !367, line: 801, baseType: !170, size: 8, offset: 2112)
!495 = !{!496}
!496 = !DISubrange(count: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "num_pio", scope: !352, file: !29, line: 64, baseType: !182, size: 32, offset: 5440)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "pio", scope: !352, file: !29, line: 65, baseType: !499, size: 1024, offset: 5472)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 1024, elements: !495)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "PL011State", file: !502, line: 23, baseType: !503)
!502 = !DIFile(filename: "include/hw/char/pl011.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "767b16b0ab40234df158d265ad90194a")
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PL011State", file: !502, line: 31, size: 10752, elements: !504)
!504 = !{!505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !518, !519, !520, !521, !522, !523, !524, !525, !684, !686, !687, !688}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "parent_obj", scope: !503, file: !502, line: 32, baseType: !351, size: 6528)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "iomem", scope: !503, file: !502, line: 34, baseType: !365, size: 2176, offset: 6528)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !503, file: !502, line: 35, baseType: !161, size: 32, offset: 8704)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "lcr", scope: !503, file: !502, line: 36, baseType: !161, size: 32, offset: 8736)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "rsr", scope: !503, file: !502, line: 37, baseType: !161, size: 32, offset: 8768)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "cr", scope: !503, file: !502, line: 38, baseType: !161, size: 32, offset: 8800)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "dmacr", scope: !503, file: !502, line: 39, baseType: !161, size: 32, offset: 8832)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "int_enabled", scope: !503, file: !502, line: 40, baseType: !161, size: 32, offset: 8864)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "int_level", scope: !503, file: !502, line: 41, baseType: !161, size: 32, offset: 8896)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "read_fifo", scope: !503, file: !502, line: 42, baseType: !515, size: 512, offset: 8928)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 512, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 16)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "ilpr", scope: !503, file: !502, line: 43, baseType: !161, size: 32, offset: 9440)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ibrd", scope: !503, file: !502, line: 44, baseType: !161, size: 32, offset: 9472)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "fbrd", scope: !503, file: !502, line: 45, baseType: !161, size: 32, offset: 9504)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ifl", scope: !503, file: !502, line: 46, baseType: !161, size: 32, offset: 9536)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !503, file: !502, line: 47, baseType: !182, size: 32, offset: 9568)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "read_count", scope: !503, file: !502, line: 48, baseType: !182, size: 32, offset: 9600)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "read_trigger", scope: !503, file: !502, line: 49, baseType: !182, size: 32, offset: 9632)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "chr", scope: !503, file: !502, line: 50, baseType: !526, size: 448, offset: 9664)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "CharBackend", file: !51, line: 18, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CharBackend", file: !528, line: 16, size: 448, elements: !529)
!528 = !DIFile(filename: "include/chardev/char-fe.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "9dddb80b5b168fe6ec2b8d247376d6d6")
!529 = !{!530, !659, !665, !671, !678, !681, !682, !683}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "chr", scope: !527, file: !528, line: 17, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "Chardev", file: !51, line: 231, baseType: !533)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Chardev", file: !51, line: 59, size: 1216, elements: !534)
!534 = !{!535, !536, !572, !574, !575, !576, !577, !578, !579, !654, !655}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "parent_obj", scope: !533, file: !51, line: 60, baseType: !112, size: 320)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "chr_write_lock", scope: !533, file: !51, line: 62, baseType: !537, size: 384, offset: 320)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "QemuMutex", file: !113, line: 96, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QemuMutex", file: !539, line: 7, size: 384, elements: !540)
!539 = !DIFile(filename: "include/qemu/thread-posix.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "eb5e3430f50059c014e844d2f733c882")
!540 = !{!541, !571}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !538, file: !539, line: 8, baseType: !542, size: 320)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !543, line: 72, baseType: !544)
!543 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "8a5acdbeec491eca11cf81cb1ef77ea7")
!544 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !543, line: 67, size: 320, elements: !545)
!545 = !{!546, !566, !570}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !544, file: !543, line: 69, baseType: !547, size: 320)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !548, line: 22, size: 320, elements: !549)
!548 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "6b075eca9ab0e2d761b2afc4ecfab776")
!549 = !{!550, !551, !552, !553, !554, !555, !557, !558}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !547, file: !548, line: 24, baseType: !182, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !547, file: !548, line: 25, baseType: !46, size: 32, offset: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !547, file: !548, line: 26, baseType: !182, size: 32, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !547, file: !548, line: 28, baseType: !46, size: 32, offset: 96)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !547, file: !548, line: 32, baseType: !182, size: 32, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !547, file: !548, line: 34, baseType: !556, size: 16, offset: 160)
!556 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !547, file: !548, line: 35, baseType: !556, size: 16, offset: 176)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !547, file: !548, line: 36, baseType: !559, size: 128, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !560, line: 55, baseType: !561)
!560 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "b9a7199822bce372686baacd32a9f4f3")
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !560, line: 51, size: 128, elements: !562)
!562 = !{!563, !565}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !561, file: !560, line: 53, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !561, file: !560, line: 54, baseType: !564, size: 64, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !544, file: !543, line: 70, baseType: !567, size: 320)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 320, elements: !568)
!568 = !{!569}
!569 = !DISubrange(count: 40)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !544, file: !543, line: 71, baseType: !176, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !538, file: !539, line: 13, baseType: !170, size: 8, offset: 320)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "be", scope: !533, file: !51, line: 63, baseType: !573, size: 64, offset: 704)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !533, file: !51, line: 64, baseType: !167, size: 64, offset: 768)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !533, file: !51, line: 65, baseType: !167, size: 64, offset: 832)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "logfd", scope: !533, file: !51, line: 66, baseType: !182, size: 32, offset: 896)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "be_open", scope: !533, file: !51, line: 67, baseType: !182, size: 32, offset: 928)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "handover_yank_instance", scope: !533, file: !51, line: 69, baseType: !170, size: 8, offset: 960)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "gsource", scope: !533, file: !51, line: 70, baseType: !580, size: 64, offset: 1024)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !582, line: 86, baseType: !583)
!582 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "", checksumkind: CSK_MD5, checksum: "ad7e9a6795d752bf397c813cc98310f6")
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !582, line: 261, size: 768, elements: !584)
!584 = !{!585, !586, !608, !637, !639, !643, !644, !645, !646, !647, !648, !649, !650}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !583, file: !582, line: 264, baseType: !133, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !583, file: !582, line: 265, baseType: !587, size: 64, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !582, line: 99, baseType: !589)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !582, line: 286, size: 192, elements: !590)
!590 = !{!591, !595, !596}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !589, file: !582, line: 288, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{null, !133}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !589, file: !582, line: 289, baseType: !592, size: 64, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !589, file: !582, line: 290, baseType: !597, size: 64, offset: 128)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !133, !580, !600, !607}
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !582, line: 195, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!605, !133}
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !134, line: 56, baseType: !606)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !134, line: 55, baseType: !182)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !583, file: !582, line: 267, baseType: !609, size: 64, offset: 128)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !582, line: 155, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !582, line: 304, size: 384, elements: !613)
!613 = !{!614, !619, !623, !627, !631, !632}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !612, file: !582, line: 306, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!605, !580, !618}
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !612, file: !582, line: 308, baseType: !620, size: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!605, !580}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !612, file: !582, line: 309, baseType: !624, size: 64, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{!605, !580, !601, !133}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !612, file: !582, line: 312, baseType: !628, size: 64, offset: 192)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{null, !580}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !612, file: !582, line: 316, baseType: !601, size: 64, offset: 256)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !612, file: !582, line: 317, baseType: !633, size: 64, offset: 320)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !582, line: 302, baseType: !634)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{null}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !583, file: !582, line: 268, baseType: !638, size: 32, offset: 192)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !134, line: 61, baseType: !46)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !583, file: !582, line: 270, baseType: !640, size: 64, offset: 256)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !582, line: 70, baseType: !642)
!642 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !582, line: 70, flags: DIFlagFwdDecl)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !583, file: !582, line: 272, baseType: !606, size: 32, offset: 320)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !583, file: !582, line: 273, baseType: !638, size: 32, offset: 352)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !583, file: !582, line: 274, baseType: !638, size: 32, offset: 384)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !583, file: !582, line: 276, baseType: !127, size: 64, offset: 448)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !583, file: !582, line: 278, baseType: !580, size: 64, offset: 512)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !583, file: !582, line: 279, baseType: !580, size: 64, offset: 576)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !583, file: !582, line: 281, baseType: !167, size: 64, offset: 640)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !583, file: !582, line: 283, baseType: !651, size: 64, offset: 704)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !582, line: 87, baseType: !653)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !582, line: 87, flags: DIFlagFwdDecl)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "gcontext", scope: !533, file: !51, line: 71, baseType: !640, size: 64, offset: 1088)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !533, file: !51, line: 72, baseType: !656, size: 64, offset: 1152)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 64, elements: !657)
!657 = !{!658}
!658 = !DISubrange(count: 1)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "chr_event", scope: !527, file: !528, line: 18, baseType: !660, size: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "IOEventHandler", file: !528, line: 7, baseType: !662)
!662 = !DISubroutineType(types: !663)
!663 = !{null, !135, !664}
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "QEMUChrEvent", file: !51, line: 35, baseType: !50)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "chr_can_read", scope: !527, file: !528, line: 19, baseType: !666, size: 64, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "IOCanReadHandler", file: !668, line: 197, baseType: !669)
!668 = !DIFile(filename: "include/qemu/main-loop.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "6bb0fb053e7fae5cab70e61b72f7650e")
!669 = !DISubroutineType(types: !670)
!670 = !{!182, !135}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "chr_read", scope: !527, file: !528, line: 20, baseType: !672, size: 64, offset: 192)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "IOReadHandler", file: !668, line: 182, baseType: !674)
!674 = !DISubroutineType(types: !675)
!675 = !{null, !135, !676, !182}
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !379)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "chr_be_change", scope: !527, file: !528, line: 21, baseType: !679, size: 64, offset: 256)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "BackendChangeHandler", file: !528, line: 8, baseType: !669)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !527, file: !528, line: 22, baseType: !135, size: 64, offset: 320)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !527, file: !528, line: 23, baseType: !46, size: 32, offset: 384)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "fe_is_open", scope: !527, file: !528, line: 24, baseType: !170, size: 8, offset: 416)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !503, file: !502, line: 51, baseType: !685, size: 384, offset: 10112)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 384, elements: !6)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "clk", scope: !503, file: !502, line: 52, baseType: !293, size: 64, offset: 10496)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "migrate_clk", scope: !503, file: !502, line: 53, baseType: !170, size: 8, offset: 10560)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !503, file: !502, line: 54, baseType: !689, size: 64, offset: 10624)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !381)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !692, line: 46, baseType: !301)
!692 = !DIFile(filename: "linuxbrew/.linuxbrew/Cellar/llvm@16/16.0.6_1/lib/clang/16/include/stddef.h", directory: "/home", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "DeviceClass", file: !108, line: 77, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DeviceClass", file: !108, line: 114, size: 1472, elements: !696)
!696 = !{!697, !698, !699, !700, !701, !802, !803, !804, !809, !814, !816, !821, !893}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "parent_class", scope: !695, file: !108, line: 116, baseType: !119, size: 768)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "categories", scope: !695, file: !108, line: 123, baseType: !656, size: 64, offset: 768)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "fw_name", scope: !695, file: !108, line: 127, baseType: !139, size: 64, offset: 832)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !695, file: !108, line: 131, baseType: !139, size: 64, offset: 896)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "props_", scope: !695, file: !108, line: 139, baseType: !702, size: 64, offset: 960)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !704)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "Property", file: !113, line: 88, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Property", file: !706, line: 15, size: 704, elements: !707)
!706 = !DIFile(filename: "include/hw/qdev-properties.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "10ae8de04a0435513a66a554d29e54ac")
!707 = !{!708, !709, !788, !790, !791, !792, !793, !798, !799, !800, !801}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !705, file: !706, line: 16, baseType: !139, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !705, file: !706, line: 17, baseType: !710, size: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !712)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyInfo", file: !113, line: 89, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyInfo", file: !706, line: 32, size: 640, elements: !714)
!714 = !{!715, !716, !717, !731, !732, !737, !781, !785, !786, !787}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !713, file: !706, line: 33, baseType: !139, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !713, file: !706, line: 34, baseType: !139, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "enum_table", scope: !713, file: !706, line: 35, baseType: !718, size: 64, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !720)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "QEnumLookup", file: !721, line: 23, baseType: !722)
!721 = !DIFile(filename: "include/qapi/util.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "75e869cdc12f3071edfdd31fe0065a9e")
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QEnumLookup", file: !721, line: 19, size: 192, elements: !723)
!723 = !{!724, !727, !729}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !722, file: !721, line: 20, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "special_features", scope: !722, file: !721, line: 21, baseType: !728, size: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !689)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !722, file: !721, line: 22, baseType: !730, size: 32, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "realized_set_allowed", scope: !713, file: !706, line: 36, baseType: !170, size: 8, offset: 192)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !713, file: !706, line: 37, baseType: !733, size: 64, offset: 256)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!182, !148, !736, !167, !691}
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "set_default_value", scope: !713, file: !706, line: 38, baseType: !738, size: 64, offset: 320)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{null, !741, !702}
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectProperty", file: !115, line: 30, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectProperty", file: !115, line: 88, size: 640, elements: !744)
!744 = !{!745, !746, !747, !748, !760, !761, !766, !771, !776, !777}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !743, file: !115, line: 90, baseType: !167, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !743, file: !115, line: 91, baseType: !167, size: 64, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !743, file: !115, line: 92, baseType: !167, size: 64, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !743, file: !115, line: 93, baseType: !749, size: 64, offset: 192)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectPropertyAccessor", file: !115, line: 42, baseType: !751)
!751 = !DISubroutineType(types: !752)
!752 = !{null, !148, !753, !139, !135, !756}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "Visitor", file: !113, line: 118, baseType: !755)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "Visitor", file: !113, line: 118, flags: DIFlagFwdDecl)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "Error", file: !113, line: 50, baseType: !759)
!759 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", file: !113, line: 50, flags: DIFlagFwdDecl)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !743, file: !115, line: 94, baseType: !749, size: 64, offset: 256)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "resolve", scope: !743, file: !115, line: 95, baseType: !762, size: 64, offset: 320)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectPropertyResolve", file: !115, line: 63, baseType: !764)
!764 = !DISubroutineType(types: !765)
!765 = !{!148, !148, !135, !139}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !743, file: !115, line: 96, baseType: !767, size: 64, offset: 384)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectPropertyRelease", file: !115, line: 75, baseType: !769)
!769 = !DISubroutineType(types: !770)
!770 = !{null, !148, !139, !135}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !743, file: !115, line: 97, baseType: !772, size: 64, offset: 448)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectPropertyInit", file: !115, line: 86, baseType: !774)
!774 = !DISubroutineType(types: !775)
!775 = !{null, !148, !741}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !743, file: !115, line: 98, baseType: !135, size: 64, offset: 512)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "defval", scope: !743, file: !115, line: 99, baseType: !778, size: 64, offset: 576)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "QObject", file: !113, line: 106, baseType: !780)
!780 = !DICompositeType(tag: DW_TAG_structure_type, name: "QObject", file: !113, line: 106, flags: DIFlagFwdDecl)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !713, file: !706, line: 39, baseType: !782, size: 64, offset: 384)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{!741, !118, !139, !702}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !713, file: !706, line: 41, baseType: !749, size: 64, offset: 448)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !713, file: !706, line: 42, baseType: !749, size: 64, offset: 512)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !713, file: !706, line: 43, baseType: !767, size: 64, offset: 576)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !705, file: !706, line: 18, baseType: !789, size: 64, offset: 128)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !692, line: 35, baseType: !176)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "bitnr", scope: !705, file: !706, line: 19, baseType: !379, size: 8, offset: 192)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "bitmask", scope: !705, file: !706, line: 20, baseType: !299, size: 64, offset: 256)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "set_default", scope: !705, file: !706, line: 21, baseType: !170, size: 8, offset: 320)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "defval", scope: !705, file: !706, line: 25, baseType: !794, size: 64, offset: 384)
!794 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !705, file: !706, line: 22, size: 64, elements: !795)
!795 = !{!796, !797}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !794, file: !706, line: 23, baseType: !173, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !794, file: !706, line: 24, baseType: !299, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "arrayoffset", scope: !705, file: !706, line: 26, baseType: !182, size: 32, offset: 448)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "arrayinfo", scope: !705, file: !706, line: 27, baseType: !710, size: 64, offset: 512)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "arrayfieldsize", scope: !705, file: !706, line: 28, baseType: !182, size: 32, offset: 576)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "link_type", scope: !705, file: !706, line: 29, baseType: !139, size: 64, offset: 640)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "user_creatable", scope: !695, file: !108, line: 154, baseType: !170, size: 8, offset: 1024)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "hotpluggable", scope: !695, file: !108, line: 155, baseType: !170, size: 8, offset: 1032)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "legacy_reset", scope: !695, file: !108, line: 166, baseType: !805, size: 64, offset: 1088)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "DeviceReset", file: !108, line: 95, baseType: !806)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{null, !106}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "realize", scope: !695, file: !108, line: 167, baseType: !810, size: 64, offset: 1152)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "DeviceRealize", file: !108, line: 93, baseType: !811)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DISubroutineType(types: !813)
!813 = !{null, !106, !756}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "unrealize", scope: !695, file: !108, line: 168, baseType: !815, size: 64, offset: 1216)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "DeviceUnrealize", file: !108, line: 94, baseType: !806)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "sync_config", scope: !695, file: !108, line: 169, baseType: !817, size: 64, offset: 1280)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "DeviceSyncConfig", file: !108, line: 98, baseType: !818)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!182, !106, !756}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "vmsd", scope: !695, file: !108, line: 175, baseType: !822, size: 64, offset: 1344)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !824)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "VMStateDescription", file: !113, line: 120, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VMStateDescription", file: !77, line: 184, size: 704, elements: !826)
!826 = !{!827, !828, !829, !830, !831, !832, !834, !836, !840, !841, !842, !846, !847, !890}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !825, file: !77, line: 185, baseType: !139, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "unmigratable", scope: !825, file: !77, line: 186, baseType: !170, size: 8, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "early_setup", scope: !825, file: !77, line: 200, baseType: !170, size: 8, offset: 72)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "version_id", scope: !825, file: !77, line: 201, baseType: !182, size: 32, offset: 96)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_version_id", scope: !825, file: !77, line: 202, baseType: !182, size: 32, offset: 128)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !825, file: !77, line: 203, baseType: !833, size: 32, offset: 160)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "MigrationPriority", file: !77, line: 165, baseType: !76)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "pre_load", scope: !825, file: !77, line: 204, baseType: !835, size: 64, offset: 192)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "post_load", scope: !825, file: !77, line: 205, baseType: !837, size: 64, offset: 256)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{!182, !135, !182}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "pre_save", scope: !825, file: !77, line: 206, baseType: !835, size: 64, offset: 320)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "post_save", scope: !825, file: !77, line: 207, baseType: !835, size: 64, offset: 384)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "needed", scope: !825, file: !77, line: 208, baseType: !843, size: 64, offset: 448)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DISubroutineType(types: !845)
!845 = !{!170, !135}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "dev_unplug_pending", scope: !825, file: !77, line: 209, baseType: !843, size: 64, offset: 512)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !825, file: !77, line: 211, baseType: !848, size: 64, offset: 576)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !850)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "VMStateField", file: !77, line: 33, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VMStateField", file: !77, line: 167, size: 832, elements: !852)
!852 = !{!853, !854, !855, !856, !857, !858, !859, !860, !861, !882, !883, !884, !885, !886}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !851, file: !77, line: 168, baseType: !139, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "err_hint", scope: !851, file: !77, line: 169, baseType: !139, size: 64, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !851, file: !77, line: 170, baseType: !691, size: 64, offset: 128)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !851, file: !77, line: 171, baseType: !691, size: 64, offset: 192)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !851, file: !77, line: 172, baseType: !691, size: 64, offset: 256)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !851, file: !77, line: 173, baseType: !182, size: 32, offset: 320)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "num_offset", scope: !851, file: !77, line: 174, baseType: !691, size: 64, offset: 384)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "size_offset", scope: !851, file: !77, line: 175, baseType: !691, size: 64, offset: 448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !851, file: !77, line: 176, baseType: !862, size: 64, offset: 512)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !864)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "VMStateInfo", file: !77, line: 32, baseType: !865)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VMStateInfo", file: !77, line: 42, size: 192, elements: !866)
!866 = !{!867, !868, !875}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !865, file: !77, line: 43, baseType: !139, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !865, file: !77, line: 44, baseType: !869, size: 64, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{!182, !872, !135, !691, !848}
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "QEMUFile", file: !113, line: 95, baseType: !874)
!874 = !DICompositeType(tag: DW_TAG_structure_type, name: "QEMUFile", file: !113, line: 95, flags: DIFlagFwdDecl)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "put", scope: !865, file: !77, line: 46, baseType: !876, size: 64, offset: 128)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{!182, !872, !135, !691, !848, !879}
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSONWriter", file: !113, line: 61, baseType: !881)
!881 = !DICompositeType(tag: DW_TAG_structure_type, name: "JSONWriter", file: !113, line: 61, flags: DIFlagFwdDecl)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !851, file: !77, line: 177, baseType: !86, size: 32, offset: 576)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "vmsd", scope: !851, file: !77, line: 178, baseType: !822, size: 64, offset: 640)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "version_id", scope: !851, file: !77, line: 179, baseType: !182, size: 32, offset: 704)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "struct_version_id", scope: !851, file: !77, line: 180, baseType: !182, size: 32, offset: 736)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "field_exists", scope: !851, file: !77, line: 181, baseType: !887, size: 64, offset: 768)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{!170, !135, !182}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "subsections", scope: !825, file: !77, line: 212, baseType: !891, size: 64, offset: 640)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !822)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "bus_type", scope: !695, file: !108, line: 181, baseType: !139, size: 64, offset: 1408)
!894 = !{!0, !8, !13, !15, !20, !25, !27, !33, !38, !40, !895, !898, !903, !905, !907, !909, !914, !916, !922, !927, !930, !935, !940, !945, !950, !955, !960, !965, !969, !971, !973, !975, !977, !982, !984, !989, !994, !996, !998, !1000, !1002, !1004, !1009, !1014, !1016, !1018, !1020, !1022, !1024, !1027, !1029, !1057, !1059, !1064, !1069, !1074, !1079, !1084, !1086, !1088, !1090, !1092, !1094, !1096, !1098, !1100, !1102, !1104, !1106, !1108, !1110, !1112, !1123, !1125, !1127, !1132, !1134, !1139, !1144, !1149, !1152, !1157}
!895 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression())
!896 = distinct !DIGlobalVariable(scope: null, file: !2, line: 627, type: !897, isLocal: true, isDefinition: true)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !140)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(scope: null, file: !502, line: 23, type: !900, isLocal: true, isDefinition: true)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !901)
!901 = !{!902}
!902 = !DISubrange(count: 42)
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(scope: null, file: !502, line: 23, type: !3, isLocal: true, isDefinition: true)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(name: "pl011_ops", scope: !42, file: !2, line: 526, type: !391, isLocal: true, isDefinition: true)
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(scope: null, file: !108, line: 77, type: !17, isLocal: true, isDefinition: true)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(scope: null, file: !108, line: 77, type: !911, isLocal: true, isDefinition: true)
!911 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !912)
!912 = !{!913}
!913 = !DISubrange(count: 41)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(scope: null, file: !108, line: 77, type: !17, isLocal: true, isDefinition: true)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(scope: null, file: !918, line: 63, type: !919, isLocal: true, isDefinition: true)
!918 = !DIFile(filename: "../hw/char/trace-events", directory: "/home/snoora/qemu/build")
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 680, elements: !920)
!920 = !{!921}
!921 = !DISubrange(count: 85)
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(scope: null, file: !918, line: 63, type: !924, isLocal: true, isDefinition: true)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 576, elements: !925)
!925 = !{!926}
!926 = !DISubrange(count: 72)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(name: "pl011_id_arm", scope: !42, file: !2, line: 98, type: !929, isLocal: true, isDefinition: true)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !690, size: 64, elements: !11)
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(scope: null, file: !108, line: 77, type: !932, isLocal: true, isDefinition: true)
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !933)
!933 = !{!934}
!934 = !DISubrange(count: 13)
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(scope: null, file: !918, line: 61, type: !937, isLocal: true, isDefinition: true)
!937 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 528, elements: !938)
!938 = !{!939}
!939 = !DISubrange(count: 66)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(scope: null, file: !918, line: 61, type: !942, isLocal: true, isDefinition: true)
!942 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 424, elements: !943)
!943 = !{!944}
!944 = !DISubrange(count: 53)
!945 = !DIGlobalVariableExpression(var: !946, expr: !DIExpression())
!946 = distinct !DIGlobalVariable(scope: null, file: !918, line: 62, type: !947, isLocal: true, isDefinition: true)
!947 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !948)
!948 = !{!949}
!949 = !DISubrange(count: 60)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(scope: null, file: !918, line: 62, type: !952, isLocal: true, isDefinition: true)
!952 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !953)
!953 = !{!954}
!954 = !DISubrange(count: 47)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(scope: null, file: !918, line: 56, type: !957, isLocal: true, isDefinition: true)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !958)
!958 = !{!959}
!959 = !DISubrange(count: 43)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(scope: null, file: !918, line: 56, type: !962, isLocal: true, isDefinition: true)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !963)
!963 = !{!964}
!964 = !DISubrange(count: 30)
!965 = !DIGlobalVariableExpression(var: !966, expr: !DIExpression())
!966 = distinct !DIGlobalVariable(name: "irqmask", scope: !42, file: !2, line: 122, type: !967, isLocal: true, isDefinition: true)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !968, size: 192, elements: !6)
!968 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !161)
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(scope: null, file: !2, line: 585, type: !17, isLocal: true, isDefinition: true)
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(scope: null, file: !2, line: 586, type: !3, isLocal: true, isDefinition: true)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(scope: null, file: !2, line: 587, type: !897, isLocal: true, isDefinition: true)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(scope: null, file: !2, line: 588, type: !897, isLocal: true, isDefinition: true)
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(scope: null, file: !2, line: 589, type: !979, isLocal: true, isDefinition: true)
!979 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !980)
!980 = !{!981}
!981 = !DISubrange(count: 3)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(scope: null, file: !2, line: 590, type: !3, isLocal: true, isDefinition: true)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(scope: null, file: !2, line: 591, type: !986, isLocal: true, isDefinition: true)
!986 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !987)
!987 = !{!988}
!988 = !DISubrange(count: 12)
!989 = !DIGlobalVariableExpression(var: !990, expr: !DIExpression())
!990 = distinct !DIGlobalVariable(scope: null, file: !2, line: 592, type: !991, isLocal: true, isDefinition: true)
!991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !992)
!992 = !{!993}
!993 = !DISubrange(count: 10)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(scope: null, file: !2, line: 593, type: !991, isLocal: true, isDefinition: true)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(scope: null, file: !2, line: 594, type: !22, isLocal: true, isDefinition: true)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(scope: null, file: !2, line: 595, type: !22, isLocal: true, isDefinition: true)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(scope: null, file: !2, line: 596, type: !22, isLocal: true, isDefinition: true)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(scope: null, file: !2, line: 597, type: !897, isLocal: true, isDefinition: true)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(scope: null, file: !2, line: 598, type: !1006, isLocal: true, isDefinition: true)
!1006 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !1007)
!1007 = !{!1008}
!1008 = !DISubrange(count: 9)
!1009 = !DIGlobalVariableExpression(var: !1010, expr: !DIExpression())
!1010 = distinct !DIGlobalVariable(scope: null, file: !2, line: 599, type: !1011, isLocal: true, isDefinition: true)
!1011 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !1012)
!1012 = !{!1013}
!1013 = !DISubrange(count: 11)
!1014 = !DIGlobalVariableExpression(var: !1015, expr: !DIExpression())
!1015 = distinct !DIGlobalVariable(scope: null, file: !2, line: 600, type: !932, isLocal: true, isDefinition: true)
!1016 = !DIGlobalVariableExpression(var: !1017, expr: !DIExpression())
!1017 = distinct !DIGlobalVariable(name: "vmstate_pl011", scope: !42, file: !2, line: 579, type: !823, isLocal: true, isDefinition: true)
!1018 = !DIGlobalVariableExpression(var: !1019, expr: !DIExpression())
!1019 = distinct !DIGlobalVariable(scope: null, file: !2, line: 542, type: !986, isLocal: true, isDefinition: true)
!1020 = !DIGlobalVariableExpression(var: !1021, expr: !DIExpression())
!1021 = distinct !DIGlobalVariable(name: "vmstate_pl011_clock", scope: !42, file: !2, line: 541, type: !823, isLocal: true, isDefinition: true)
!1022 = !DIGlobalVariableExpression(var: !1023, expr: !DIExpression())
!1023 = distinct !DIGlobalVariable(scope: null, file: !2, line: 611, type: !986, isLocal: true, isDefinition: true)
!1024 = !DIGlobalVariableExpression(var: !1025, expr: !DIExpression())
!1025 = distinct !DIGlobalVariable(name: "pl011_properties", scope: !42, file: !2, line: 609, type: !1026, isLocal: true, isDefinition: true)
!1026 = !DICompositeType(tag: DW_TAG_array_type, baseType: !704, size: 2112, elements: !980)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(scope: null, file: !2, line: 687, type: !30, isLocal: true, isDefinition: true)
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
!1030 = distinct !DIGlobalVariable(name: "pl011_luminary_info", scope: !42, file: !2, line: 686, type: !1031, isLocal: true, isDefinition: true)
!1031 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1032)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "TypeInfo", file: !115, line: 23, baseType: !1033)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TypeInfo", file: !115, line: 474, size: 832, elements: !1034)
!1034 = !{!1035, !1036, !1037, !1038, !1039, !1041, !1042, !1043, !1044, !1045, !1049, !1050, !1051}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1033, file: !115, line: 476, baseType: !139, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1033, file: !115, line: 477, baseType: !139, size: 64, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "instance_size", scope: !1033, file: !115, line: 479, baseType: !691, size: 64, offset: 128)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "instance_align", scope: !1033, file: !115, line: 480, baseType: !691, size: 64, offset: 192)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "instance_init", scope: !1033, file: !115, line: 481, baseType: !1040, size: 64, offset: 256)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "instance_post_init", scope: !1033, file: !115, line: 482, baseType: !1040, size: 64, offset: 320)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "instance_finalize", scope: !1033, file: !115, line: 483, baseType: !1040, size: 64, offset: 384)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "abstract", scope: !1033, file: !115, line: 485, baseType: !170, size: 8, offset: 448)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "class_size", scope: !1033, file: !115, line: 486, baseType: !691, size: 64, offset: 512)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "class_init", scope: !1033, file: !115, line: 488, baseType: !1046, size: 64, offset: 576)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{null, !118, !135}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "class_base_init", scope: !1033, file: !115, line: 489, baseType: !1046, size: 64, offset: 640)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "class_data", scope: !1033, file: !115, line: 490, baseType: !135, size: 64, offset: 704)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "interfaces", scope: !1033, file: !115, line: 492, baseType: !1052, size: 64, offset: 768)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterfaceInfo", file: !115, line: 26, baseType: !1054)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "InterfaceInfo", file: !115, line: 565, size: 64, elements: !1055)
!1055 = !{!1056}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1054, file: !115, line: 566, baseType: !139, size: 64)
!1057 = !DIGlobalVariableExpression(var: !1058, expr: !DIExpression())
