; ModuleID = '/home/snoora/qemu/build/libcommon.a.p/hw_char_serial.c.o'
source_filename = "../hw/char/serial.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.VMStateField = type { ptr, ptr, i64, i64, i64, i32, i64, i64, ptr, i32, ptr, i32, i32, ptr }
%struct.VMStateDescription = type { ptr, i8, i8, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.MemoryRegionOps = type { ptr, ptr, ptr, ptr, i32, %struct.anon, %struct.anon.0 }
%struct.anon = type { i32, i32, i8, ptr }
%struct.anon.0 = type { i32, i32, i8 }
%struct.TypeInfo = type { ptr, ptr, i64, i64, ptr, ptr, ptr, i8, i64, ptr, ptr, ptr, ptr }
%struct.Property = type { ptr, ptr, i64, i8, i64, i8, %union.anon.6, i32, ptr, i32, ptr }
%union.anon.6 = type { i64 }
%struct.VMStateInfo = type { ptr, ptr, ptr }
%struct.PropertyInfo = type { ptr, ptr, ptr, i8, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.SerialState = type { %struct.DeviceState, i16, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, ptr, %struct.CharBackend, i32, i32, i32, i32, i8, i64, %struct.Fifo8, %struct.Fifo8, i8, ptr, i32, i64, i32, ptr, [8 x i8], %struct.MemoryRegion }
%struct.DeviceState = type { %struct.Object, ptr, ptr, i8, i8, i64, ptr, i32, i8, ptr, %struct.NamedGPIOListHead, %struct.NamedClockListHead, %struct.BusStateHead, i32, i32, i32, %struct.ResettableState, ptr, %struct.MemReentrancyGuard }

!86 = !DIEnumerator(name: "MODULE_INIT_LIBQOS", value: 6)
!87 = !DIEnumerator(name: "MODULE_INIT_FUZZ_TARGET", value: 7)
!88 = !DIEnumerator(name: "MODULE_INIT_MAX", value: 8)
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !90, line: 20, baseType: !43, size: 32, elements: !91)
!90 = !DIFile(filename: "include/chardev/char.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "511c7fe47d4c53f1b2261c424644c265")
!91 = !{!92, !93, !94, !95, !96}
!92 = !DIEnumerator(name: "CHR_EVENT_BREAK", value: 0)
!93 = !DIEnumerator(name: "CHR_EVENT_OPENED", value: 1)
!94 = !DIEnumerator(name: "CHR_EVENT_MUX_IN", value: 2)
!95 = !DIEnumerator(name: "CHR_EVENT_MUX_OUT", value: 3)
!96 = !DIEnumerator(name: "CHR_EVENT_CLOSED", value: 4)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 33, baseType: !43, size: 32, elements: !99)
!98 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "", checksumkind: CSK_MD5, checksum: "ad7e9a6795d752bf397c813cc98310f6")
!99 = !{!100, !101, !102, !103, !104, !105}
!100 = !DIEnumerator(name: "G_IO_IN", value: 1)
!101 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!102 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!103 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!104 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!105 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!106 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !107, line: 47, baseType: !43, size: 32, elements: !108)
!107 = !DIFile(filename: "include/qemu/timer.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "7b09b66c570d1db78b08e65b6ccc455b")
!108 = !{!109, !110, !111, !112, !113}
!109 = !DIEnumerator(name: "QEMU_CLOCK_REALTIME", value: 0)
!110 = !DIEnumerator(name: "QEMU_CLOCK_VIRTUAL", value: 1)
!111 = !DIEnumerator(name: "QEMU_CLOCK_HOST", value: 2)
!112 = !DIEnumerator(name: "QEMU_CLOCK_VIRTUAL_RT", value: 3)
!113 = !DIEnumerator(name: "QEMU_CLOCK_MAX", value: 4)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "WakeupReason", file: !115, line: 76, baseType: !43, size: 32, elements: !116)
!115 = !DIFile(filename: "include/sysemu/runstate.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "76c559b49f664f1d6324bdacdc475ee1")
!116 = !{!117, !118, !119, !120}
!117 = !DIEnumerator(name: "QEMU_WAKEUP_REASON_NONE", value: 0)
!118 = !DIEnumerator(name: "QEMU_WAKEUP_REASON_RTC", value: 1)
!119 = !DIEnumerator(name: "QEMU_WAKEUP_REASON_PMTIMER", value: 2)
!120 = !DIEnumerator(name: "QEMU_WAKEUP_REASON_OTHER", value: 3)
!121 = !{!122, !123, !124, !127, !348, !694, !144, !553, !171, !543, !897}
!122 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !125, line: 46, baseType: !126)
!125 = !DIFile(filename: "linuxbrew/.linuxbrew/Cellar/llvm@16/16.0.6_1/lib/clang/16/include/stddef.h", directory: "/home", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!126 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "SerialState", file: !129, line: 86, baseType: !130)
!129 = !DIFile(filename: "include/hw/char/serial.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "cc8eb235321c1549d96621ad0b7f624c")
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SerialState", file: !129, line: 36, size: 5248, elements: !131)
!131 = !{!132, !343, !347, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !522, !523, !524, !525, !526, !527, !530, !540, !541, !542, !559, !560, !561, !562, !563}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !130, file: !129, line: 37, baseType: !133, size: 1280)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "DeviceState", file: !134, line: 77, baseType: !135)
!134 = !DIFile(filename: "include/hw/qdev-core.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "67264af7ed760669a154394b865d52dd")
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DeviceState", file: !134, line: 220, size: 1280, elements: !136)
!136 = !{!137, !189, !191, !192, !194, !195, !200, !204, !206, !207, !275, !307, !328, !333, !334, !335, !336, !337, !338}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "parent_obj", scope: !135, file: !134, line: 222, baseType: !138, size: 320)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !139, line: 77, baseType: !140)
!139 = !DIFile(filename: "include/qemu/typedefs.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "7d670dc4483fed36c57e997370d4c9a1")
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !141, line: 153, size: 320, elements: !142)
!141 = !DIFile(filename: "include/qom/object.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "9e6a829e5f72c582a3bea10c17cbf078")
!142 = !{!143, !177, !182, !183, !188}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !140, file: !141, line: 156, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectClass", file: !139, line: 78, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectClass", file: !141, line: 127, size: 768, elements: !147)
!147 = !{!148, !152, !162, !165, !166, !172}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !146, file: !141, line: 130, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", file: !141, line: 21, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "TypeImpl", file: !141, line: 20, flags: DIFlagFwdDecl)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "interfaces", scope: !146, file: !141, line: 131, baseType: !153, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !155, line: 39, baseType: !156)
!155 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "", checksumkind: CSK_MD5, checksum: "c2b16cbedbdd77e3f819637c21501624")
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !155, line: 41, size: 128, elements: !157)
!157 = !{!158, !161}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !156, file: !155, line: 43, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !160, line: 109, baseType: !123)
!160 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "bb471ab4f4c8d1bff5846ccdfd1b3ac4")
!161 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !156, file: !155, line: 44, baseType: !153, size: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "object_cast_cache", scope: !146, file: !141, line: 133, baseType: !163, size: 256, offset: 128)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 256, elements: !16)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "class_cast_cache", scope: !146, file: !141, line: 134, baseType: !163, size: 256, offset: 384)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "unparent", scope: !146, file: !141, line: 136, baseType: !167, size: 64, offset: 640)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectUnparent", file: !141, line: 109, baseType: !169)
!169 = !DISubroutineType(types: !170)
!170 = !{null, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !146, file: !141, line: 138, baseType: !173, size: 64, offset: 704)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !175, line: 40, baseType: !176)
!175 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "", checksumkind: CSK_MD5, checksum: "ff178276f16d53966cd41952349b047f")
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !175, line: 40, flags: DIFlagFwdDecl)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !140, file: !141, line: 157, baseType: !178, size: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectFree", file: !141, line: 117, baseType: !180)
!180 = !DISubroutineType(types: !181)
!181 = !{null, !123}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !140, file: !141, line: 158, baseType: !173, size: 64, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !140, file: !141, line: 159, baseType: !184, size: 32, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !185, line: 26, baseType: !186)
!185 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "256fcabbefa27ca8cf5e6d37525e6e16")
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !187, line: 42, baseType: !43)
!187 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e1865d9fe29fe1b5ced550b7ba458f9e")
!188 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !140, file: !141, line: 160, baseType: !171, size: 64, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !135, file: !134, line: 228, baseType: !190, size: 64, offset: 320)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "canonical_path", scope: !135, file: !134, line: 232, baseType: !190, size: 64, offset: 384)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "realized", scope: !135, file: !134, line: 236, baseType: !193, size: 8, offset: 448)
!193 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "pending_deleted_event", scope: !135, file: !134, line: 240, baseType: !193, size: 8, offset: 456)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "pending_deleted_expires_ms", scope: !135, file: !134, line: 244, baseType: !196, size: 64, offset: 512)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !197, line: 27, baseType: !198)
!197 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "649b383a60bfa3eb90e85840b2b0be20")
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !187, line: 44, baseType: !199)
!199 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !135, file: !134, line: 248, baseType: !201, size: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "QDict", file: !139, line: 91, baseType: !203)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "QDict", file: !139, line: 91, flags: DIFlagFwdDecl)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "hotplugged", scope: !135, file: !134, line: 252, baseType: !205, size: 32, offset: 640)
!205 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "allow_unplug_during_migration", scope: !135, file: !134, line: 256, baseType: !193, size: 8, offset: 672)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "parent_bus", scope: !135, file: !134, line: 260, baseType: !208, size: 64, offset: 704)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "BusState", file: !139, line: 36, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BusState", file: !134, line: 378, size: 960, elements: !211)
!211 = !{!212, !213, !215, !216, !221, !222, !223, !224, !225, !259, !267}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !210, file: !134, line: 380, baseType: !138, size: 320)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !210, file: !134, line: 382, baseType: !214, size: 64, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !210, file: !134, line: 383, baseType: !190, size: 64, offset: 384)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "hotplug_handler", scope: !210, file: !134, line: 384, baseType: !217, size: 64, offset: 448)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "HotplugHandler", file: !219, line: 25, baseType: !220)
!219 = !DIFile(filename: "include/hw/hotplug.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "15267d9ba97c18564fc7d41a146ac8e8")
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "HotplugHandler", file: !219, line: 25, flags: DIFlagFwdDecl)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "max_index", scope: !210, file: !134, line: 385, baseType: !205, size: 32, offset: 512)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "realized", scope: !210, file: !134, line: 386, baseType: !193, size: 8, offset: 544)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !210, file: !134, line: 387, baseType: !193, size: 8, offset: 552)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "num_children", scope: !210, file: !134, line: 388, baseType: !205, size: 32, offset: 576)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !210, file: !134, line: 394, baseType: !226, size: 128, offset: 640)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "BusChildHead", file: !134, line: 364, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !134, line: 364, size: 128, elements: !228)
!228 = !{!229, !258}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !227, file: !134, line: 364, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BusChild", file: !134, line: 355, size: 384, elements: !232)
!232 = !{!233, !244, !245, !246}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !231, file: !134, line: 356, baseType: !234, size: 128)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcu_head", file: !235, line: 138, size: 128, elements: !236)
!235 = !DIFile(filename: "include/qemu/rcu.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "1fa5966fe8848bb59b99486d796e94fb")
!236 = !{!237, !239}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !234, file: !235, line: 139, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !234, file: !235, line: 140, baseType: !240, size: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCUCBFunc", file: !235, line: 136, baseType: !242)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !238}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !231, file: !134, line: 357, baseType: !214, size: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !231, file: !134, line: 358, baseType: !205, size: 32, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !231, file: !134, line: 359, baseType: !247, size: 128, offset: 256)
!247 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !231, file: !134, line: 359, size: 128, elements: !248)
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !247, file: !134, line: 359, baseType: !230, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_circ", scope: !247, file: !134, line: 359, baseType: !251, size: 128)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "QTailQLink", file: !252, line: 388, baseType: !253)
!252 = !DIFile(filename: "include/qemu/queue.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "037402447fe7017dc8313a983f6fbe7b")
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QTailQLink", file: !252, line: 385, size: 128, elements: !254)
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "tql_next", scope: !253, file: !252, line: 386, baseType: !123, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tql_prev", scope: !253, file: !252, line: 387, baseType: !257, size: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_circ", scope: !227, file: !134, line: 364, baseType: !251, size: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !210, file: !134, line: 398, baseType: !260, size: 128, offset: 768)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "BusStateEntry", file: !134, line: 365, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !134, line: 365, size: 128, elements: !262)
!262 = !{!263, !265}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !261, file: !134, line: 365, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !261, file: !134, line: 365, baseType: !266, size: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !210, file: !134, line: 402, baseType: !268, size: 64, offset: 896)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResettableState", file: !269, line: 25, baseType: !270)
!269 = !DIFile(filename: "include/hw/resettable.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "f1271920a2d7d7b6d7542c3e61d6e416")
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ResettableState", file: !269, line: 141, size: 64, elements: !271)
!271 = !{!272, !273, !274}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !270, file: !269, line: 142, baseType: !43, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "hold_phase_pending", scope: !270, file: !269, line: 143, baseType: !193, size: 8, offset: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "exit_phase_in_progress", scope: !270, file: !269, line: 144, baseType: !193, size: 8, offset: 40)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "gpios", scope: !135, file: !134, line: 264, baseType: !276, size: 64, offset: 768)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "NamedGPIOListHead", file: !134, line: 210, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !134, line: 210, size: 64, elements: !278)
!278 = !{!279}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "lh_first", scope: !277, file: !134, line: 210, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NamedGPIOList", file: !134, line: 186, size: 320, elements: !282)
!282 = !{!283, !284, !299, !300, !301}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !281, file: !134, line: 187, baseType: !190, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !281, file: !134, line: 188, baseType: !285, size: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "qemu_irq", file: !139, line: 128, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IRQState", file: !289, line: 11, size: 512, elements: !290)
!289 = !DIFile(filename: "include/hw/irq.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "c3d3cf679636ee2dd93a459edfc5173a")
!290 = !{!291, !292, !297, !298}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "parent_obj", scope: !288, file: !289, line: 12, baseType: !138, size: 320)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !288, file: !289, line: 14, baseType: !293, size: 64, offset: 320)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "qemu_irq_handler", file: !139, line: 133, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !123, !205, !205}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !288, file: !289, line: 15, baseType: !123, size: 64, offset: 384)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !288, file: !289, line: 16, baseType: !205, size: 32, offset: 448)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "num_in", scope: !281, file: !134, line: 189, baseType: !205, size: 32, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "num_out", scope: !281, file: !134, line: 190, baseType: !205, size: 32, offset: 160)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !281, file: !134, line: 191, baseType: !302, size: 128, offset: 192)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !281, file: !134, line: 191, size: 128, elements: !303)
!303 = !{!304, !305}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !302, file: !134, line: 191, baseType: !280, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !302, file: !134, line: 191, baseType: !306, size: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "clocks", scope: !135, file: !134, line: 268, baseType: !308, size: 64, offset: 832)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "NamedClockListHead", file: !134, line: 211, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !134, line: 211, size: 64, elements: !310)
!310 = !{!311}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "lh_first", scope: !309, file: !134, line: 211, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NamedClockList", file: !134, line: 197, size: 320, elements: !314)
!314 = !{!315, !316, !320, !321, !322}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !313, file: !134, line: 198, baseType: !190, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "clock", scope: !313, file: !134, line: 199, baseType: !317, size: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "Clock", file: !134, line: 194, baseType: !319)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "Clock", file: !139, line: 38, flags: DIFlagFwdDecl)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !313, file: !134, line: 200, baseType: !193, size: 8, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !313, file: !134, line: 201, baseType: !193, size: 8, offset: 136)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !313, file: !134, line: 202, baseType: !323, size: 128, offset: 192)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !313, file: !134, line: 202, size: 128, elements: !324)
!324 = !{!325, !326}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !323, file: !134, line: 202, baseType: !312, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !323, file: !134, line: 202, baseType: !327, size: 64, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "child_bus", scope: !135, file: !134, line: 272, baseType: !329, size: 64, offset: 896)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "BusStateHead", file: !134, line: 212, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !134, line: 212, size: 64, elements: !331)
!331 = !{!332}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "lh_first", scope: !330, file: !134, line: 212, baseType: !264, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "num_child_bus", scope: !135, file: !134, line: 276, baseType: !205, size: 32, offset: 960)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "instance_id_alias", scope: !135, file: !134, line: 280, baseType: !205, size: 32, offset: 992)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "alias_required_for_version", scope: !135, file: !134, line: 285, baseType: !205, size: 32, offset: 1024)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !135, file: !134, line: 289, baseType: !268, size: 64, offset: 1056)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "unplug_blockers", scope: !135, file: !134, line: 293, baseType: !153, size: 64, offset: 1152)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "mem_reentrancy_guard", scope: !135, file: !134, line: 299, baseType: !339, size: 8, offset: 1216)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemReentrancyGuard", file: !134, line: 207, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !134, line: 205, size: 8, elements: !341)
!341 = !{!342}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "engaged_in_io", scope: !340, file: !134, line: 206, baseType: !193, size: 8)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "divider", scope: !130, file: !129, line: 39, baseType: !344, size: 16, offset: 1280)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !185, line: 25, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !187, line: 40, baseType: !346)
!346 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "rbr", scope: !130, file: !129, line: 40, baseType: !348, size: 8, offset: 1296)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !185, line: 24, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !187, line: 38, baseType: !350)
!350 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "thr", scope: !130, file: !129, line: 41, baseType: !348, size: 8, offset: 1304)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tsr", scope: !130, file: !129, line: 42, baseType: !348, size: 8, offset: 1312)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ier", scope: !130, file: !129, line: 43, baseType: !348, size: 8, offset: 1320)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "iir", scope: !130, file: !129, line: 44, baseType: !348, size: 8, offset: 1328)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "lcr", scope: !130, file: !129, line: 45, baseType: !348, size: 8, offset: 1336)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "mcr", scope: !130, file: !129, line: 46, baseType: !348, size: 8, offset: 1344)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "lsr", scope: !130, file: !129, line: 47, baseType: !348, size: 8, offset: 1352)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "msr", scope: !130, file: !129, line: 48, baseType: !348, size: 8, offset: 1360)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "scr", scope: !130, file: !129, line: 49, baseType: !348, size: 8, offset: 1368)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "fcr", scope: !130, file: !129, line: 50, baseType: !348, size: 8, offset: 1376)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "fcr_vmstate", scope: !130, file: !129, line: 51, baseType: !348, size: 8, offset: 1384)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "thr_ipending", scope: !130, file: !129, line: 55, baseType: !205, size: 32, offset: 1408)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !130, file: !129, line: 56, baseType: !286, size: 64, offset: 1472)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "chr", scope: !130, file: !129, line: 57, baseType: !365, size: 448, offset: 1536)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "CharBackend", file: !90, line: 18, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CharBackend", file: !367, line: 16, size: 448, elements: !368)
!367 = !DIFile(filename: "include/chardev/char-fe.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "9dddb80b5b168fe6ec2b8d247376d6d6")
!368 = !{!369, !497, !503, !509, !516, !519, !520, !521}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "chr", scope: !366, file: !367, line: 17, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "Chardev", file: !90, line: 231, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Chardev", file: !90, line: 59, size: 1216, elements: !373)
!373 = !{!374, !375, !411, !413, !414, !415, !416, !417, !418, !492, !493}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "parent_obj", scope: !372, file: !90, line: 60, baseType: !138, size: 320)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "chr_write_lock", scope: !372, file: !90, line: 62, baseType: !376, size: 384, offset: 320)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "QemuMutex", file: !139, line: 96, baseType: !377)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QemuMutex", file: !378, line: 7, size: 384, elements: !379)
!378 = !DIFile(filename: "include/qemu/thread-posix.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "eb5e3430f50059c014e844d2f733c882")
!379 = !{!380, !410}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !377, file: !378, line: 8, baseType: !381, size: 320)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !382, line: 72, baseType: !383)
!382 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "8a5acdbeec491eca11cf81cb1ef77ea7")
!383 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !382, line: 67, size: 320, elements: !384)
!384 = !{!385, !405, !409}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !383, file: !382, line: 69, baseType: !386, size: 320)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !387, line: 22, size: 320, elements: !388)
!387 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "6b075eca9ab0e2d761b2afc4ecfab776")
!388 = !{!389, !390, !391, !392, !393, !394, !396, !397}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !386, file: !387, line: 24, baseType: !205, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !386, file: !387, line: 25, baseType: !43, size: 32, offset: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !386, file: !387, line: 26, baseType: !205, size: 32, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !386, file: !387, line: 28, baseType: !43, size: 32, offset: 96)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !386, file: !387, line: 32, baseType: !205, size: 32, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !386, file: !387, line: 34, baseType: !395, size: 16, offset: 160)
!395 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !386, file: !387, line: 35, baseType: !395, size: 16, offset: 176)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !386, file: !387, line: 36, baseType: !398, size: 128, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !399, line: 55, baseType: !400)
!399 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "b9a7199822bce372686baacd32a9f4f3")
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !399, line: 51, size: 128, elements: !401)
!401 = !{!402, !404}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !400, file: !399, line: 53, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !400, file: !399, line: 54, baseType: !403, size: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !383, file: !382, line: 70, baseType: !406, size: 320)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 320, elements: !407)
!407 = !{!408}
!408 = !DISubrange(count: 40)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !383, file: !382, line: 71, baseType: !199, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !377, file: !378, line: 13, baseType: !193, size: 8, offset: 320)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "be", scope: !372, file: !90, line: 63, baseType: !412, size: 64, offset: 704)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !372, file: !90, line: 64, baseType: !190, size: 64, offset: 768)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !372, file: !90, line: 65, baseType: !190, size: 64, offset: 832)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "logfd", scope: !372, file: !90, line: 66, baseType: !205, size: 32, offset: 896)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "be_open", scope: !372, file: !90, line: 67, baseType: !205, size: 32, offset: 928)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "handover_yank_instance", scope: !372, file: !90, line: 69, baseType: !193, size: 8, offset: 960)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "gsource", scope: !372, file: !90, line: 70, baseType: !419, size: 64, offset: 1024)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !98, line: 86, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !98, line: 261, size: 768, elements: !422)
!422 = !{!423, !424, !446, !475, !477, !481, !482, !483, !484, !485, !486, !487, !488}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !421, file: !98, line: 264, baseType: !159, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !421, file: !98, line: 265, baseType: !425, size: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !98, line: 99, baseType: !427)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !98, line: 286, size: 192, elements: !428)
!428 = !{!429, !433, !434}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !427, file: !98, line: 288, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{null, !159}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !427, file: !98, line: 289, baseType: !430, size: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !427, file: !98, line: 290, baseType: !435, size: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{null, !159, !419, !438, !445}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !98, line: 195, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{!443, !159}
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !160, line: 56, baseType: !444)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !160, line: 55, baseType: !205)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !421, file: !98, line: 267, baseType: !447, size: 64, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !98, line: 155, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !98, line: 304, size: 384, elements: !451)
!451 = !{!452, !457, !461, !465, !469, !470}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !450, file: !98, line: 306, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!443, !419, !456}
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !450, file: !98, line: 308, baseType: !458, size: 64, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!443, !419}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !450, file: !98, line: 309, baseType: !462, size: 64, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!443, !419, !439, !159}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !450, file: !98, line: 312, baseType: !466, size: 64, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{null, !419}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !450, file: !98, line: 316, baseType: !439, size: 64, offset: 256)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !450, file: !98, line: 317, baseType: !471, size: 64, offset: 320)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !98, line: 302, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{null}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !421, file: !98, line: 268, baseType: !476, size: 32, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !160, line: 61, baseType: !43)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !421, file: !98, line: 270, baseType: !478, size: 64, offset: 256)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !98, line: 70, baseType: !480)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !98, line: 70, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !421, file: !98, line: 272, baseType: !444, size: 32, offset: 320)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !421, file: !98, line: 273, baseType: !476, size: 32, offset: 352)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !421, file: !98, line: 274, baseType: !476, size: 32, offset: 384)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !421, file: !98, line: 276, baseType: !153, size: 64, offset: 448)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !421, file: !98, line: 278, baseType: !419, size: 64, offset: 512)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !421, file: !98, line: 279, baseType: !419, size: 64, offset: 576)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !421, file: !98, line: 281, baseType: !190, size: 64, offset: 640)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !421, file: !98, line: 283, baseType: !489, size: 64, offset: 704)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !98, line: 87, baseType: !491)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !98, line: 87, flags: DIFlagFwdDecl)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "gcontext", scope: !372, file: !90, line: 71, baseType: !478, size: 64, offset: 1088)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !372, file: !90, line: 72, baseType: !494, size: 64, offset: 1152)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 64, elements: !495)
!495 = !{!496}
!496 = !DISubrange(count: 1)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "chr_event", scope: !366, file: !367, line: 18, baseType: !498, size: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "IOEventHandler", file: !367, line: 7, baseType: !500)
!500 = !DISubroutineType(types: !501)
!501 = !{null, !123, !502}
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "QEMUChrEvent", file: !90, line: 35, baseType: !89)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "chr_can_read", scope: !366, file: !367, line: 19, baseType: !504, size: 64, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "IOCanReadHandler", file: !506, line: 197, baseType: !507)
!506 = !DIFile(filename: "include/qemu/main-loop.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "6bb0fb053e7fae5cab70e61b72f7650e")
!507 = !DISubroutineType(types: !508)
!508 = !{!205, !123}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "chr_read", scope: !366, file: !367, line: 20, baseType: !510, size: 64, offset: 192)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "IOReadHandler", file: !506, line: 182, baseType: !512)
!512 = !DISubroutineType(types: !513)
!513 = !{null, !123, !514, !205}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !348)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "chr_be_change", scope: !366, file: !367, line: 21, baseType: !517, size: 64, offset: 256)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "BackendChangeHandler", file: !367, line: 8, baseType: !507)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !366, file: !367, line: 22, baseType: !123, size: 64, offset: 320)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !366, file: !367, line: 23, baseType: !43, size: 32, offset: 384)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "fe_is_open", scope: !366, file: !367, line: 24, baseType: !193, size: 8, offset: 416)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "last_break_enable", scope: !130, file: !129, line: 58, baseType: !205, size: 32, offset: 1984)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "baudbase", scope: !130, file: !129, line: 59, baseType: !184, size: 32, offset: 2016)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "tsr_retry", scope: !130, file: !129, line: 60, baseType: !184, size: 32, offset: 2048)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "watch_tag", scope: !130, file: !129, line: 61, baseType: !476, size: 32, offset: 2080)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "wakeup", scope: !130, file: !129, line: 62, baseType: !193, size: 8, offset: 2112)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "last_xmit_ts", scope: !130, file: !129, line: 65, baseType: !528, size: 64, offset: 2176)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !185, line: 27, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !187, line: 45, baseType: !126)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "recv_fifo", scope: !130, file: !129, line: 66, baseType: !531, size: 192, offset: 2240)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "Fifo8", file: !532, line: 11, baseType: !533)
!532 = !DIFile(filename: "include/qemu/fifo8.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "c2bff57ae36ca05872f15325d885dab1")
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !532, line: 5, size: 192, elements: !534)
!534 = !{!535, !537, !538, !539}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !533, file: !532, line: 7, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !533, file: !532, line: 8, baseType: !184, size: 32, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !533, file: !532, line: 9, baseType: !184, size: 32, offset: 96)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !533, file: !532, line: 10, baseType: !184, size: 32, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "xmit_fifo", scope: !130, file: !129, line: 67, baseType: !531, size: 192, offset: 2432)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "recv_fifo_itl", scope: !130, file: !129, line: 69, baseType: !348, size: 8, offset: 2624)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_timeout_timer", scope: !130, file: !129, line: 71, baseType: !543, size: 64, offset: 2688)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "QEMUTimer", file: !139, line: 101, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QEMUTimer", file: !107, line: 84, size: 384, elements: !546)
!546 = !{!547, !548, !552, !555, !556, !557, !558}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "expire_time", scope: !545, file: !107, line: 85, baseType: !196, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "timer_list", scope: !545, file: !107, line: 86, baseType: !549, size: 64, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "QEMUTimerList", file: !107, line: 75, baseType: !551)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "QEMUTimerList", file: !107, line: 75, flags: DIFlagFwdDecl)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !545, file: !107, line: 87, baseType: !553, size: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "QEMUTimerCB", file: !107, line: 81, baseType: !180)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !545, file: !107, line: 88, baseType: !123, size: 64, offset: 192)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !545, file: !107, line: 89, baseType: !543, size: 64, offset: 256)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !545, file: !107, line: 90, baseType: !205, size: 32, offset: 320)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !545, file: !107, line: 91, baseType: !205, size: 32, offset: 352)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_ipending", scope: !130, file: !129, line: 72, baseType: !205, size: 32, offset: 2752)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "char_transmit_time", scope: !130, file: !129, line: 74, baseType: !528, size: 64, offset: 2816)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "poll_msl", scope: !130, file: !129, line: 75, baseType: !205, size: 32, offset: 2880)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "modem_status_poll", scope: !130, file: !129, line: 77, baseType: !543, size: 64, offset: 2944)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !130, file: !129, line: 78, baseType: !564, size: 2176, offset: 3072)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemoryRegion", file: !139, line: 67, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MemoryRegion", file: !566, line: 755, size: 2176, elements: !567)
!566 = !DIFile(filename: "include/exec/memory.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "ac0603821d1f9b60fe091bb4fb80e29d")
!567 = !{!568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !583, !584, !585, !639, !640, !642, !643, !649, !650, !654, !655, !656, !657, !658, !659, !660, !661, !662, !665, !671, !676, !683, !684, !685, !689, !693}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "parent_obj", scope: !565, file: !566, line: 756, baseType: !138, size: 320)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "romd_mode", scope: !565, file: !566, line: 761, baseType: !193, size: 8, offset: 320)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ram", scope: !565, file: !566, line: 762, baseType: !193, size: 8, offset: 328)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "subpage", scope: !565, file: !566, line: 763, baseType: !193, size: 8, offset: 336)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !565, file: !566, line: 764, baseType: !193, size: 8, offset: 344)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "nonvolatile", scope: !565, file: !566, line: 765, baseType: !193, size: 8, offset: 352)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "rom_device", scope: !565, file: !566, line: 766, baseType: !193, size: 8, offset: 360)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "flush_coalesced_mmio", scope: !565, file: !566, line: 767, baseType: !193, size: 8, offset: 368)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "unmergeable", scope: !565, file: !566, line: 768, baseType: !193, size: 8, offset: 376)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_log_mask", scope: !565, file: !566, line: 769, baseType: !348, size: 8, offset: 384)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "is_iommu", scope: !565, file: !566, line: 770, baseType: !193, size: 8, offset: 392)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ram_block", scope: !565, file: !566, line: 771, baseType: !580, size: 64, offset: 448)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAMBlock", file: !139, line: 108, baseType: !582)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "RAMBlock", file: !139, line: 108, flags: DIFlagFwdDecl)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !565, file: !566, line: 772, baseType: !171, size: 64, offset: 512)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !565, file: !566, line: 774, baseType: !214, size: 64, offset: 576)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !565, file: !566, line: 776, baseType: !586, size: 64, offset: 640)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !588)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemoryRegionOps", file: !566, line: 80, baseType: !589)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MemoryRegionOps", file: !566, line: 264, size: 640, elements: !590)
!590 = !{!591, !597, !601, !618, !622, !623, !633}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !589, file: !566, line: 267, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!528, !123, !595, !43}
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwaddr", file: !596, line: 11, baseType: !528)
!596 = !DIFile(filename: "include/exec/hwaddr.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "fa6f76ef63acb9da0cc99a3662166d11")
!597 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !589, file: !566, line: 272, baseType: !598, size: 64, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{null, !123, !595, !528, !43}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "read_with_attrs", scope: !589, file: !566, line: 277, baseType: !602, size: 64, offset: 128)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!605, !123, !595, !607, !43, !608}
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemTxResult", file: !606, line: 78, baseType: !184)
!606 = !DIFile(filename: "include/exec/memattrs.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "9b6ae885d22d69d08ca00517d6823a7a")
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemTxAttrs", file: !606, line: 60, baseType: !609)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MemTxAttrs", file: !606, line: 25, size: 32, elements: !610)
!610 = !{!611, !612, !613, !614, !615, !616, !617}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "unspecified", scope: !609, file: !606, line: 31, baseType: !43, size: 1, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "secure", scope: !609, file: !606, line: 36, baseType: !43, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !609, file: !606, line: 42, baseType: !43, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !609, file: !606, line: 44, baseType: !43, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !609, file: !606, line: 52, baseType: !43, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "requester_id", scope: !609, file: !606, line: 54, baseType: !43, size: 16, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !609, file: !606, line: 59, baseType: !43, size: 8, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "write_with_attrs", scope: !589, file: !566, line: 282, baseType: !619, size: 64, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!605, !123, !595, !528, !43, !608}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "endianness", scope: !589, file: !566, line: 288, baseType: !71, size: 32, offset: 256)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !589, file: !566, line: 308, baseType: !624, size: 192, offset: 320)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !589, file: !566, line: 290, size: 192, elements: !625)
!625 = !{!626, !627, !628, !629}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "min_access_size", scope: !624, file: !566, line: 294, baseType: !43, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "max_access_size", scope: !624, file: !566, line: 295, baseType: !43, size: 32, offset: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "unaligned", scope: !624, file: !566, line: 299, baseType: !193, size: 8, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "accepts", scope: !624, file: !566, line: 305, baseType: !630, size: 64, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!193, !123, !595, !43, !193, !608}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !589, file: !566, line: 323, baseType: !634, size: 96, offset: 512)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !589, file: !566, line: 310, size: 96, elements: !635)
!635 = !{!636, !637, !638}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "min_access_size", scope: !634, file: !566, line: 314, baseType: !43, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "max_access_size", scope: !634, file: !566, line: 318, baseType: !43, size: 32, offset: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "unaligned", scope: !634, file: !566, line: 322, baseType: !193, size: 8, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !565, file: !566, line: 777, baseType: !123, size: 64, offset: 704)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "container", scope: !565, file: !566, line: 778, baseType: !641, size: 64, offset: 768)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "mapped_via_alias", scope: !565, file: !566, line: 779, baseType: !205, size: 32, offset: 832)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !565, file: !566, line: 780, baseType: !644, size: 128, offset: 896)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "Int128", file: !645, line: 12, baseType: !646)
!645 = !DIFile(filename: "include/qemu/int128.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "5836b066b8c746f64a01476985ac72dd")
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int128_t", file: !647, baseType: !648)
!647 = !DIFile(filename: "../hw/char/serial.c", directory: "/home/snoora/qemu/build")
!648 = !DIBasicType(name: "__int128", size: 128, encoding: DW_ATE_signed)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !565, file: !566, line: 781, baseType: !595, size: 64, offset: 1024)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !565, file: !566, line: 782, baseType: !651, size: 64, offset: 1088)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{null, !641}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !565, file: !566, line: 783, baseType: !528, size: 64, offset: 1152)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "terminates", scope: !565, file: !566, line: 784, baseType: !193, size: 8, offset: 1216)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ram_device", scope: !565, file: !566, line: 785, baseType: !193, size: 8, offset: 1224)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !565, file: !566, line: 786, baseType: !193, size: 8, offset: 1232)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "warning_printed", scope: !565, file: !566, line: 787, baseType: !193, size: 8, offset: 1240)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "vga_logging_count", scope: !565, file: !566, line: 788, baseType: !348, size: 8, offset: 1248)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !565, file: !566, line: 789, baseType: !641, size: 64, offset: 1280)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "alias_offset", scope: !565, file: !566, line: 790, baseType: !595, size: 64, offset: 1344)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !565, file: !566, line: 791, baseType: !663, size: 32, offset: 1408)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !197, line: 26, baseType: !664)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !187, line: 41, baseType: !205)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "subregions", scope: !565, file: !566, line: 792, baseType: !666, size: 128, offset: 1472)
!666 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !565, file: !566, line: 792, size: 128, elements: !667)
!667 = !{!668, !670}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !666, file: !566, line: 792, baseType: !669, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_circ", scope: !666, file: !566, line: 792, baseType: !251, size: 128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "subregions_link", scope: !565, file: !566, line: 793, baseType: !672, size: 128, offset: 1600)
!672 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !565, file: !566, line: 793, size: 128, elements: !673)
!673 = !{!674, !675}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !672, file: !566, line: 793, baseType: !669, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_circ", scope: !672, file: !566, line: 793, baseType: !251, size: 128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "coalesced", scope: !565, file: !566, line: 794, baseType: !677, size: 128, offset: 1728)
!677 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !565, file: !566, line: 794, size: 128, elements: !678)
!678 = !{!679, !682}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !677, file: !566, line: 794, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DICompositeType(tag: DW_TAG_structure_type, name: "CoalescedMemoryRange", file: !566, line: 748, flags: DIFlagFwdDecl)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_circ", scope: !677, file: !566, line: 794, baseType: !251, size: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !565, file: !566, line: 795, baseType: !164, size: 64, offset: 1856)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ioeventfd_nb", scope: !565, file: !566, line: 796, baseType: !43, size: 32, offset: 1920)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ioeventfds", scope: !565, file: !566, line: 797, baseType: !686, size: 64, offset: 1984)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemoryRegionIoeventfd", file: !566, line: 749, baseType: !688)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemoryRegionIoeventfd", file: !566, line: 749, flags: DIFlagFwdDecl)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "rdm", scope: !565, file: !566, line: 798, baseType: !690, size: 64, offset: 2048)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "RamDiscardManager", file: !566, line: 48, baseType: !692)
!692 = !DICompositeType(tag: DW_TAG_structure_type, name: "RamDiscardManager", file: !566, line: 48, flags: DIFlagFwdDecl)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "disable_reentrancy_guard", scope: !565, file: !566, line: 801, baseType: !193, size: 8, offset: 2112)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "DeviceClass", file: !134, line: 77, baseType: !696)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DeviceClass", file: !134, line: 114, size: 1472, elements: !697)
!697 = !{!698, !699, !700, !701, !702, !805, !806, !807, !812, !817, !819, !824, !896}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "parent_class", scope: !696, file: !134, line: 116, baseType: !145, size: 768)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "categories", scope: !696, file: !134, line: 123, baseType: !494, size: 64, offset: 768)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "fw_name", scope: !696, file: !134, line: 127, baseType: !164, size: 64, offset: 832)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !696, file: !134, line: 131, baseType: !164, size: 64, offset: 896)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "props_", scope: !696, file: !134, line: 139, baseType: !703, size: 64, offset: 960)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !705)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "Property", file: !139, line: 88, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Property", file: !707, line: 15, size: 704, elements: !708)
!707 = !DIFile(filename: "include/hw/qdev-properties.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "10ae8de04a0435513a66a554d29e54ac")
!708 = !{!709, !710, !791, !793, !794, !795, !796, !801, !802, !803, !804}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !706, file: !707, line: 16, baseType: !164, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !706, file: !707, line: 17, baseType: !711, size: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyInfo", file: !139, line: 89, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyInfo", file: !707, line: 32, size: 640, elements: !715)
!715 = !{!716, !717, !718, !734, !735, !740, !784, !788, !789, !790}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !714, file: !707, line: 33, baseType: !164, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !714, file: !707, line: 34, baseType: !164, size: 64, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "enum_table", scope: !714, file: !707, line: 35, baseType: !719, size: 64, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !721)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "QEnumLookup", file: !722, line: 23, baseType: !723)
!722 = !DIFile(filename: "include/qapi/util.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "75e869cdc12f3071edfdd31fe0065a9e")
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QEnumLookup", file: !722, line: 19, size: 192, elements: !724)
!724 = !{!725, !728, !732}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !723, file: !722, line: 20, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "special_features", scope: !723, file: !722, line: 21, baseType: !729, size: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !730)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !350)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !723, file: !722, line: 22, baseType: !733, size: 32, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !205)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "realized_set_allowed", scope: !714, file: !707, line: 36, baseType: !193, size: 8, offset: 192)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !714, file: !707, line: 37, baseType: !736, size: 64, offset: 256)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!205, !171, !739, !190, !124}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "set_default_value", scope: !714, file: !707, line: 38, baseType: !741, size: 64, offset: 320)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{null, !744, !703}
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectProperty", file: !141, line: 30, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectProperty", file: !141, line: 88, size: 640, elements: !747)
!747 = !{!748, !749, !750, !751, !763, !764, !769, !774, !779, !780}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !746, file: !141, line: 90, baseType: !190, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !746, file: !141, line: 91, baseType: !190, size: 64, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !746, file: !141, line: 92, baseType: !190, size: 64, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !746, file: !141, line: 93, baseType: !752, size: 64, offset: 192)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectPropertyAccessor", file: !141, line: 42, baseType: !754)
!754 = !DISubroutineType(types: !755)
!755 = !{null, !171, !756, !164, !123, !759}
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "Visitor", file: !139, line: 118, baseType: !758)
!758 = !DICompositeType(tag: DW_TAG_structure_type, name: "Visitor", file: !139, line: 118, flags: DIFlagFwdDecl)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "Error", file: !139, line: 50, baseType: !762)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", file: !139, line: 50, flags: DIFlagFwdDecl)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !746, file: !141, line: 94, baseType: !752, size: 64, offset: 256)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "resolve", scope: !746, file: !141, line: 95, baseType: !765, size: 64, offset: 320)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectPropertyResolve", file: !141, line: 63, baseType: !767)
!767 = !DISubroutineType(types: !768)
!768 = !{!171, !171, !123, !164}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !746, file: !141, line: 96, baseType: !770, size: 64, offset: 384)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectPropertyRelease", file: !141, line: 75, baseType: !772)
!772 = !DISubroutineType(types: !773)
!773 = !{null, !171, !164, !123}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !746, file: !141, line: 97, baseType: !775, size: 64, offset: 448)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectPropertyInit", file: !141, line: 86, baseType: !777)
!777 = !DISubroutineType(types: !778)
!778 = !{null, !171, !744}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !746, file: !141, line: 98, baseType: !123, size: 64, offset: 512)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "defval", scope: !746, file: !141, line: 99, baseType: !781, size: 64, offset: 576)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "QObject", file: !139, line: 106, baseType: !783)
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "QObject", file: !139, line: 106, flags: DIFlagFwdDecl)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !714, file: !707, line: 39, baseType: !785, size: 64, offset: 384)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{!744, !144, !164, !703}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !714, file: !707, line: 41, baseType: !752, size: 64, offset: 448)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !714, file: !707, line: 42, baseType: !752, size: 64, offset: 512)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !714, file: !707, line: 43, baseType: !770, size: 64, offset: 576)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !706, file: !707, line: 18, baseType: !792, size: 64, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !125, line: 35, baseType: !199)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "bitnr", scope: !706, file: !707, line: 19, baseType: !348, size: 8, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "bitmask", scope: !706, file: !707, line: 20, baseType: !528, size: 64, offset: 256)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "set_default", scope: !706, file: !707, line: 21, baseType: !193, size: 8, offset: 320)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "defval", scope: !706, file: !707, line: 25, baseType: !797, size: 64, offset: 384)
!797 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !706, file: !707, line: 22, size: 64, elements: !798)
!798 = !{!799, !800}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !797, file: !707, line: 23, baseType: !196, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !797, file: !707, line: 24, baseType: !528, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "arrayoffset", scope: !706, file: !707, line: 26, baseType: !205, size: 32, offset: 448)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "arrayinfo", scope: !706, file: !707, line: 27, baseType: !711, size: 64, offset: 512)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "arrayfieldsize", scope: !706, file: !707, line: 28, baseType: !205, size: 32, offset: 576)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "link_type", scope: !706, file: !707, line: 29, baseType: !164, size: 64, offset: 640)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "user_creatable", scope: !696, file: !134, line: 154, baseType: !193, size: 8, offset: 1024)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "hotpluggable", scope: !696, file: !134, line: 155, baseType: !193, size: 8, offset: 1032)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "legacy_reset", scope: !696, file: !134, line: 166, baseType: !808, size: 64, offset: 1088)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "DeviceReset", file: !134, line: 95, baseType: !809)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{null, !214}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "realize", scope: !696, file: !134, line: 167, baseType: !813, size: 64, offset: 1152)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "DeviceRealize", file: !134, line: 93, baseType: !814)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{null, !214, !759}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "unrealize", scope: !696, file: !134, line: 168, baseType: !818, size: 64, offset: 1216)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "DeviceUnrealize", file: !134, line: 94, baseType: !809)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "sync_config", scope: !696, file: !134, line: 169, baseType: !820, size: 64, offset: 1280)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "DeviceSyncConfig", file: !134, line: 98, baseType: !821)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{!205, !214, !759}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "vmsd", scope: !696, file: !134, line: 175, baseType: !825, size: 64, offset: 1344)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !827)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "VMStateDescription", file: !139, line: 120, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VMStateDescription", file: !42, line: 184, size: 704, elements: !829)
!829 = !{!830, !831, !832, !833, !834, !835, !837, !839, !843, !844, !845, !849, !850, !893}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !828, file: !42, line: 185, baseType: !164, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "unmigratable", scope: !828, file: !42, line: 186, baseType: !193, size: 8, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "early_setup", scope: !828, file: !42, line: 200, baseType: !193, size: 8, offset: 72)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "version_id", scope: !828, file: !42, line: 201, baseType: !205, size: 32, offset: 96)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_version_id", scope: !828, file: !42, line: 202, baseType: !205, size: 32, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !828, file: !42, line: 203, baseType: !836, size: 32, offset: 160)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "MigrationPriority", file: !42, line: 165, baseType: !41)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "pre_load", scope: !828, file: !42, line: 204, baseType: !838, size: 64, offset: 192)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "post_load", scope: !828, file: !42, line: 205, baseType: !840, size: 64, offset: 256)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{!205, !123, !205}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "pre_save", scope: !828, file: !42, line: 206, baseType: !838, size: 64, offset: 320)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "post_save", scope: !828, file: !42, line: 207, baseType: !838, size: 64, offset: 384)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "needed", scope: !828, file: !42, line: 208, baseType: !846, size: 64, offset: 448)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!193, !123}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "dev_unplug_pending", scope: !828, file: !42, line: 209, baseType: !846, size: 64, offset: 512)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !828, file: !42, line: 211, baseType: !851, size: 64, offset: 576)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !853)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "VMStateField", file: !42, line: 33, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VMStateField", file: !42, line: 167, size: 832, elements: !855)
!855 = !{!856, !857, !858, !859, !860, !861, !862, !863, !864, !885, !886, !887, !888, !889}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !854, file: !42, line: 168, baseType: !164, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "err_hint", scope: !854, file: !42, line: 169, baseType: !164, size: 64, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !854, file: !42, line: 170, baseType: !124, size: 64, offset: 128)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !854, file: !42, line: 171, baseType: !124, size: 64, offset: 192)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !854, file: !42, line: 172, baseType: !124, size: 64, offset: 256)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !854, file: !42, line: 173, baseType: !205, size: 32, offset: 320)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "num_offset", scope: !854, file: !42, line: 174, baseType: !124, size: 64, offset: 384)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "size_offset", scope: !854, file: !42, line: 175, baseType: !124, size: 64, offset: 448)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !854, file: !42, line: 176, baseType: !865, size: 64, offset: 512)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !867)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "VMStateInfo", file: !42, line: 32, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VMStateInfo", file: !42, line: 42, size: 192, elements: !869)
!869 = !{!870, !871, !878}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !868, file: !42, line: 43, baseType: !164, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !868, file: !42, line: 44, baseType: !872, size: 64, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!205, !875, !123, !124, !851}
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "QEMUFile", file: !139, line: 95, baseType: !877)
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "QEMUFile", file: !139, line: 95, flags: DIFlagFwdDecl)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "put", scope: !868, file: !42, line: 46, baseType: !879, size: 64, offset: 128)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{!205, !875, !123, !124, !851, !882}
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSONWriter", file: !139, line: 61, baseType: !884)
!884 = !DICompositeType(tag: DW_TAG_structure_type, name: "JSONWriter", file: !139, line: 61, flags: DIFlagFwdDecl)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !854, file: !42, line: 177, baseType: !52, size: 32, offset: 576)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "vmsd", scope: !854, file: !42, line: 178, baseType: !825, size: 64, offset: 640)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "version_id", scope: !854, file: !42, line: 179, baseType: !205, size: 32, offset: 704)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "struct_version_id", scope: !854, file: !42, line: 180, baseType: !205, size: 32, offset: 736)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "field_exists", scope: !854, file: !42, line: 181, baseType: !890, size: 64, offset: 768)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{!193, !123, !205}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "subsections", scope: !828, file: !42, line: 212, baseType: !894, size: 64, offset: 640)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !825)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "bus_type", scope: !696, file: !134, line: 181, baseType: !164, size: 64, offset: 1408)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !898, line: 83, baseType: !126)
!898 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "", checksumkind: CSK_MD5, checksum: "b7a410fd7712c52c11eec07b841e9f67")
!899 = !{!0, !8, !13, !18, !20, !22, !24, !26, !28, !30, !32, !900, !902, !904, !909, !911, !916, !918, !923, !928, !933, !938, !943, !948, !953, !955, !960, !966, !971, !973, !37, !978, !983, !988, !990, !992, !994, !999, !1001, !1003, !1005, !1007, !1009, !1011, !1016, !1018, !1023, !1025, !1027, !1029, !1034, !1036, !1038, !1043, !1048, !1054, !1057, !1062, !1064, !1066, !1071, !1076, !1081, !1086, !1091, !1093, !1095, !1123, !1125, !1127, !1129, !1131, !1133, !1135, !1137}
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(name: "vmstate_serial", scope: !39, file: !2, line: 822, type: !826, isLocal: false, isDefinition: true)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(name: "serial_io_ops", scope: !39, file: !2, line: 954, type: !587, isLocal: false, isDefinition: true)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1008, type: !906, isLocal: true, isDefinition: true)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !907)
!907 = !{!908}
!908 = !DISubrange(count: 6)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1009, type: !3, isLocal: true, isDefinition: true)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1010, type: !913, isLocal: true, isDefinition: true)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !914)
!914 = !{!915}
!915 = !DISubrange(count: 5)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1027, type: !906, isLocal: true, isDefinition: true)
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(scope: null, file: !2, line: 661, type: !920, isLocal: true, isDefinition: true)
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !921)
!921 = !{!922}
!922 = !DISubrange(count: 61)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(scope: null, file: !2, line: 670, type: !925, isLocal: true, isDefinition: true)
!925 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !926)
!926 = !{!927}
!927 = !DISubrange(count: 18)
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(scope: null, file: !2, line: 670, type: !930, isLocal: true, isDefinition: true)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !931)
!931 = !{!932}
!932 = !DISubrange(count: 20)
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(scope: null, file: !2, line: 670, type: !935, isLocal: true, isDefinition: true)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !936)
!936 = !{!937}
!937 = !DISubrange(count: 34)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(scope: null, file: !2, line: 676, type: !940, isLocal: true, isDefinition: true)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !941)
!941 = !{!942}
!942 = !DISubrange(count: 64)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(scope: null, file: !2, line: 235, type: !945, isLocal: true, isDefinition: true)
!945 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !946)
!946 = !{!947}
!947 = !DISubrange(count: 26)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(scope: null, file: !2, line: 235, type: !950, isLocal: true, isDefinition: true)
!950 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !951)
!951 = !{!952}
!952 = !DISubrange(count: 32)
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(scope: null, file: !2, line: 237, type: !945, isLocal: true, isDefinition: true)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(scope: null, file: !2, line: 240, type: !957, isLocal: true, isDefinition: true)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !958)
!958 = !{!959}
!959 = !DISubrange(count: 31)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(scope: null, file: !962, line: 10, type: !963, isLocal: true, isDefinition: true)
!962 = !DIFile(filename: "../hw/char/trace-events", directory: "/home/snoora/qemu/build")
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 640, elements: !964)
!964 = !{!965}
!965 = !DISubrange(count: 80)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(scope: null, file: !962, line: 10, type: !968, isLocal: true, isDefinition: true)
!968 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 536, elements: !969)
!969 = !{!970}
!970 = !DISubrange(count: 67)
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(scope: null, file: !2, line: 706, type: !930, isLocal: true, isDefinition: true)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(scope: null, file: !2, line: 711, type: !975, isLocal: true, isDefinition: true)
!975 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !976)
!976 = !{!977}
!977 = !DISubrange(count: 13)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(scope: null, file: !2, line: 723, type: !980, isLocal: true, isDefinition: true)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !981)
!981 = !{!982}
!982 = !DISubrange(count: 11)
!983 = !DIGlobalVariableExpression(var: !984, expr: !DIExpression())
!984 = distinct !DIGlobalVariable(scope: null, file: !2, line: 728, type: !985, isLocal: true, isDefinition: true)
!985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !986)
!986 = !{!987}
!987 = !DISubrange(count: 10)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(scope: null, file: !2, line: 729, type: !15, isLocal: true, isDefinition: true)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(scope: null, file: !2, line: 730, type: !15, isLocal: true, isDefinition: true)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(name: "vmstate_serial_tsr", scope: !39, file: !2, line: 722, type: !826, isLocal: true, isDefinition: true)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(scope: null, file: !2, line: 743, type: !996, isLocal: true, isDefinition: true)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !997)
!997 = !{!998}
!998 = !DISubrange(count: 17)
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(scope: null, file: !2, line: 748, type: !985, isLocal: true, isDefinition: true)
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression())
!1002 = distinct !DIGlobalVariable(name: "vmstate_serial_recv_fifo", scope: !39, file: !2, line: 742, type: !826, isLocal: true, isDefinition: true)
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression())
!1004 = distinct !DIGlobalVariable(scope: null, file: !2, line: 760, type: !996, isLocal: true, isDefinition: true)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(scope: null, file: !2, line: 765, type: !985, isLocal: true, isDefinition: true)
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(name: "vmstate_serial_xmit_fifo", scope: !39, file: !2, line: 759, type: !826, isLocal: true, isDefinition: true)
!1009 = !DIGlobalVariableExpression(var: !1010, expr: !DIExpression())
!1010 = distinct !DIGlobalVariable(scope: null, file: !2, line: 777, type: !945, isLocal: true, isDefinition: true)
!1011 = !DIGlobalVariableExpression(var: !1012, expr: !DIExpression())
!1012 = distinct !DIGlobalVariable(scope: null, file: !2, line: 782, type: !1013, isLocal: true, isDefinition: true)
!1013 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !1014)
!1014 = !{!1015}
!1015 = !DISubrange(count: 19)
!1016 = !DIGlobalVariableExpression(var: !1017, expr: !DIExpression())
!1017 = distinct !DIGlobalVariable(name: "vmstate_serial_fifo_timeout_timer", scope: !39, file: !2, line: 776, type: !826, isLocal: true, isDefinition: true)
!1018 = !DIGlobalVariableExpression(var: !1019, expr: !DIExpression())
!1019 = distinct !DIGlobalVariable(scope: null, file: !2, line: 794, type: !1020, isLocal: true, isDefinition: true)
!1020 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !1021)
!1021 = !{!1022}
!1022 = !DISubrange(count: 24)
!1023 = !DIGlobalVariableExpression(var: !1024, expr: !DIExpression())
!1024 = distinct !DIGlobalVariable(scope: null, file: !2, line: 799, type: !996, isLocal: true, isDefinition: true)
!1025 = !DIGlobalVariableExpression(var: !1026, expr: !DIExpression())
!1026 = distinct !DIGlobalVariable(name: "vmstate_serial_timeout_ipending", scope: !39, file: !2, line: 793, type: !826, isLocal: true, isDefinition: true)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(scope: null, file: !2, line: 811, type: !34, isLocal: true, isDefinition: true)
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
!1030 = distinct !DIGlobalVariable(scope: null, file: !2, line: 816, type: !1031, isLocal: true, isDefinition: true)
!1031 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !1032)
!1032 = !{!1033}
!1033 = !DISubrange(count: 9)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(scope: null, file: !2, line: 817, type: !925, isLocal: true, isDefinition: true)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(name: "vmstate_serial_poll", scope: !39, file: !2, line: 810, type: !826, isLocal: true, isDefinition: true)
!1038 = !DIGlobalVariableExpression(var: !1039, expr: !DIExpression())
!1039 = distinct !DIGlobalVariable(scope: null, file: !2, line: 474, type: !1040, isLocal: true, isDefinition: true)
!1040 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !1041)
!1041 = !{!1042}
!1042 = !DISubrange(count: 22)
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(scope: null, file: !2, line: 474, type: !1045, isLocal: true, isDefinition: true)
!1045 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, elements: !1046)
!1046 = !{!1047}
!1047 = !DISubrange(count: 58)
!1048 = !DIGlobalVariableExpression(var: !1049, expr: !DIExpression())
!1049 = distinct !DIGlobalVariable(scope: null, file: !1050, line: 555, type: !1051, isLocal: true, isDefinition: true)
!1050 = !DIFile(filename: "include/qemu/bitops.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "35792e4a6f0566ee95e222ed936e1d18")
!1051 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !1052)
!1052 = !{!1053}
!1053 = !DISubrange(count: 49)
!1054 = !DIGlobalVariableExpression(var: !1055, expr: !DIExpression())
!1055 = distinct !DIGlobalVariable(scope: null, file: !1050, line: 555, type: !1056, isLocal: true, isDefinition: true)
!1056 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !407)
!1057 = !DIGlobalVariableExpression(var: !1058, expr: !DIExpression())
!1058 = distinct !DIGlobalVariable(scope: null, file: !1050, line: 555, type: !1059, isLocal: true, isDefinition: true)
!1059 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !1060)
!1060 = !{!1061}
!1061 = !DISubrange(count: 39)
!1062 = !DIGlobalVariableExpression(var: !1063, expr: !DIExpression())
!1063 = distinct !DIGlobalVariable(scope: null, file: !1050, line: 517, type: !1051, isLocal: true, isDefinition: true)
!1064 = !DIGlobalVariableExpression(var: !1065, expr: !DIExpression())
!1065 = distinct !DIGlobalVariable(scope: null, file: !1050, line: 517, type: !1059, isLocal: true, isDefinition: true)
!1066 = !DIGlobalVariableExpression(var: !1067, expr: !DIExpression())
!1067 = distinct !DIGlobalVariable(scope: null, file: !962, line: 8, type: !1068, isLocal: true, isDefinition: true)
!1068 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 432, elements: !1069)
!1069 = !{!1070}
!1070 = !DISubrange(count: 54)
!1071 = !DIGlobalVariableExpression(var: !1072, expr: !DIExpression())
!1072 = distinct !DIGlobalVariable(scope: null, file: !962, line: 8, type: !1073, isLocal: true, isDefinition: true)
!1073 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !1074)
!1074 = !{!1075}
!1075 = !DISubrange(count: 41)
!1076 = !DIGlobalVariableExpression(var: !1077, expr: !DIExpression())
!1077 = distinct !DIGlobalVariable(scope: null, file: !2, line: 337, type: !1078, isLocal: true, isDefinition: true)
!1078 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 520, elements: !1079)
!1079 = !{!1080}
!1080 = !DISubrange(count: 65)
!1081 = !DIGlobalVariableExpression(var: !1082, expr: !DIExpression())
!1082 = distinct !DIGlobalVariable(scope: null, file: !962, line: 9, type: !1083, isLocal: true, isDefinition: true)
!1083 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !1084)
!1084 = !{!1085}
!1085 = !DISubrange(count: 56)
!1086 = !DIGlobalVariableExpression(var: !1087, expr: !DIExpression())
!1087 = distinct !DIGlobalVariable(scope: null, file: !962, line: 9, type: !1088, isLocal: true, isDefinition: true)
!1088 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !1089)
!1089 = !{!1090}
!1090 = !DISubrange(count: 43)
!1091 = !DIGlobalVariableExpression(var: !1092, expr: !DIExpression())
!1092 = distinct !DIGlobalVariable(scope: null, file: !1050, line: 649, type: !1051, isLocal: true, isDefinition: true)
!1093 = !DIGlobalVariableExpression(var: !1094, expr: !DIExpression())
!1094 = distinct !DIGlobalVariable(scope: null, file: !2, line: 987, type: !3, isLocal: true, isDefinition: true)
!1095 = !DIGlobalVariableExpression(var: !1096, expr: !DIExpression())
!1096 = distinct !DIGlobalVariable(name: "serial_info", scope: !39, file: !2, line: 985, type: !1097, isLocal: true, isDefinition: true)
