; ModuleID = '/home/snoora/qemu/build/libcommon.a.p/hw_char_avr_usart.c.o'
source_filename = "../hw/char/avr_usart.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.TypeInfo = type { ptr, ptr, i64, i64, ptr, ptr, ptr, i8, i64, ptr, ptr, ptr, ptr }
%struct.MemoryRegionOps = type { ptr, ptr, ptr, ptr, i32, %struct.anon.2, %struct.anon.3 }
%struct.anon.2 = type { i32, i32, i8, ptr }
%struct.anon.3 = type { i32, i32, i8 }
%struct.Property = type { ptr, ptr, i64, i8, i64, i8, %union.anon.7, i32, ptr, i32, ptr }
%union.anon.7 = type { i64 }
%struct.PropertyInfo = type { ptr, ptr, ptr, i8, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.AVRUsartState = type { %struct.SysBusDevice, %struct.MemoryRegion, %struct.CharBackend, i8, i8, i8, i8, i8, i8, i8, i8, i8, ptr, ptr, ptr }
%struct.SysBusDevice = type { %struct.DeviceState, i32, [32 x %struct.anon.1], i32, [32 x i32] }
%struct.DeviceState = type { %struct.Object, ptr, ptr, i8, i8, i64, ptr, i32, i8, ptr, %struct.NamedGPIOListHead, %struct.NamedClockListHead, %struct.BusStateHead, i32, i32, i32, %struct.ResettableState, ptr, %struct.MemReentrancyGuard }
%struct.Object = type { ptr, ptr, ptr, i32, ptr }
%struct.NamedGPIOListHead = type { ptr }
%struct.NamedClockListHead = type { ptr }
%struct.BusStateHead = type { ptr }
%struct.ResettableState = type { i32, i8, i8 }
%struct.MemReentrancyGuard = type { i8 }
%struct.anon.1 = type { i64, ptr }

!17 = !DISubrange(count: 5)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(scope: null, file: !2, line: 350, type: !3, isLocal: true, isDefinition: true)
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "avr_usart_info", scope: !22, file: !2, line: 308, type: !867, isLocal: true, isDefinition: true)
!22 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Homebrew clang version 16.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !23, retainedTypes: !51, globals: !737, splitDebugInlining: false, nameTableKind: None)
!23 = !{!24, !37, !43}
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 42, baseType: !26, size: 32, elements: !27)
!25 = !DIFile(filename: "include/qemu/module.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "6305787c50fb72a9b185dddd38011933")
!26 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36}
!28 = !DIEnumerator(name: "MODULE_INIT_MIGRATION", value: 0)
!29 = !DIEnumerator(name: "MODULE_INIT_BLOCK", value: 1)
!30 = !DIEnumerator(name: "MODULE_INIT_OPTS", value: 2)
!31 = !DIEnumerator(name: "MODULE_INIT_QOM", value: 3)
!32 = !DIEnumerator(name: "MODULE_INIT_TRACE", value: 4)
!33 = !DIEnumerator(name: "MODULE_INIT_XEN_BACKEND", value: 5)
!34 = !DIEnumerator(name: "MODULE_INIT_LIBQOS", value: 6)
!35 = !DIEnumerator(name: "MODULE_INIT_FUZZ_TARGET", value: 7)
!36 = !DIEnumerator(name: "MODULE_INIT_MAX", value: 8)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "device_endian", file: !38, line: 45, baseType: !26, size: 32, elements: !39)
!38 = !DIFile(filename: "include/exec/cpu-common.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "dd363f974d6967ea1215596bce64439b")
!39 = !{!40, !41, !42}
!40 = !DIEnumerator(name: "DEVICE_NATIVE_ENDIAN", value: 0)
!41 = !DIEnumerator(name: "DEVICE_BIG_ENDIAN", value: 1)
!42 = !DIEnumerator(name: "DEVICE_LITTLE_ENDIAN", value: 2)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 20, baseType: !26, size: 32, elements: !45)
!44 = !DIFile(filename: "include/chardev/char.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "511c7fe47d4c53f1b2261c424644c265")
!45 = !{!46, !47, !48, !49, !50}
!46 = !DIEnumerator(name: "CHR_EVENT_BREAK", value: 0)
!47 = !DIEnumerator(name: "CHR_EVENT_OPENED", value: 1)
!48 = !DIEnumerator(name: "CHR_EVENT_MUX_IN", value: 2)
!49 = !DIEnumerator(name: "CHR_EVENT_MUX_OUT", value: 3)
!50 = !DIEnumerator(name: "CHR_EVENT_CLOSED", value: 4)
!51 = !{!52, !104, !596, !147, !597, !95, !599, !74}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRUsartState", file: !54, line: 60, baseType: !55)
!54 = !DIFile(filename: "include/hw/char/avr_usart.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "514b8f528779a0af4c81273e837699e6")
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRUsartState", file: !54, line: 62, size: 9472, elements: !56)
!56 = !{!57, !424, !425, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "parent_obj", scope: !55, file: !54, line: 64, baseType: !58, size: 6528)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysBusDevice", file: !59, line: 19, baseType: !60)
!59 = !DIFile(filename: "include/hw/sysbus.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "67bb6e09f1ded079f625f3cd0bffdc2a")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SysBusDevice", file: !59, line: 54, size: 6528, elements: !61)
!61 = !{!62, !276, !277, !421, !422}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "parent_obj", scope: !60, file: !59, line: 56, baseType: !63, size: 1280)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "DeviceState", file: !64, line: 77, baseType: !65)
!64 = !DIFile(filename: "include/hw/qdev-core.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "67264af7ed760669a154394b865d52dd")
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DeviceState", file: !64, line: 220, size: 1280, elements: !66)
!66 = !{!67, !122, !124, !125, !127, !128, !133, !137, !139, !140, !208, !240, !261, !266, !267, !268, !269, !270, !271}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "parent_obj", scope: !65, file: !64, line: 222, baseType: !68, size: 320)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !69, line: 77, baseType: !70)
!69 = !DIFile(filename: "include/qemu/typedefs.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "7d670dc4483fed36c57e997370d4c9a1")
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !71, line: 153, size: 320, elements: !72)
!71 = !DIFile(filename: "include/qom/object.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "9e6a829e5f72c582a3bea10c17cbf078")
!72 = !{!73, !110, !115, !116, !121}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !70, file: !71, line: 156, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectClass", file: !69, line: 78, baseType: !76)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectClass", file: !71, line: 127, size: 768, elements: !77)
!77 = !{!78, !82, !93, !98, !99, !105}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !76, file: !71, line: 130, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", file: !71, line: 21, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "TypeImpl", file: !71, line: 20, flags: DIFlagFwdDecl)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "interfaces", scope: !76, file: !71, line: 131, baseType: !83, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !85, line: 39, baseType: !86)
!85 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "", checksumkind: CSK_MD5, checksum: "c2b16cbedbdd77e3f819637c21501624")
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !85, line: 41, size: 128, elements: !87)
!87 = !{!88, !92}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !86, file: !85, line: 43, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !90, line: 109, baseType: !91)
!90 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "bb471ab4f4c8d1bff5846ccdfd1b3ac4")
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !86, file: !85, line: 44, baseType: !83, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "object_cast_cache", scope: !76, file: !71, line: 133, baseType: !94, size: 256, offset: 128)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 256, elements: !96)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!96 = !{!97}
!97 = !DISubrange(count: 4)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "class_cast_cache", scope: !76, file: !71, line: 134, baseType: !94, size: 256, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "unparent", scope: !76, file: !71, line: 136, baseType: !100, size: 64, offset: 640)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectUnparent", file: !71, line: 109, baseType: !102)
!102 = !DISubroutineType(types: !103)
!103 = !{null, !104}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !76, file: !71, line: 138, baseType: !106, size: 64, offset: 704)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !108, line: 40, baseType: !109)
!108 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "", checksumkind: CSK_MD5, checksum: "ff178276f16d53966cd41952349b047f")
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !108, line: 40, flags: DIFlagFwdDecl)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !70, file: !71, line: 157, baseType: !111, size: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectFree", file: !71, line: 117, baseType: !113)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !91}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !70, file: !71, line: 158, baseType: !106, size: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !70, file: !71, line: 159, baseType: !117, size: 32, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !118, line: 26, baseType: !119)
!118 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "256fcabbefa27ca8cf5e6d37525e6e16")
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !120, line: 42, baseType: !26)
!120 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e1865d9fe29fe1b5ced550b7ba458f9e")
!121 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !70, file: !71, line: 160, baseType: !104, size: 64, offset: 256)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !65, file: !64, line: 228, baseType: !123, size: 64, offset: 320)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "canonical_path", scope: !65, file: !64, line: 232, baseType: !123, size: 64, offset: 384)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "realized", scope: !65, file: !64, line: 236, baseType: !126, size: 8, offset: 448)
!126 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "pending_deleted_event", scope: !65, file: !64, line: 240, baseType: !126, size: 8, offset: 456)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "pending_deleted_expires_ms", scope: !65, file: !64, line: 244, baseType: !129, size: 64, offset: 512)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !130, line: 27, baseType: !131)
!130 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "649b383a60bfa3eb90e85840b2b0be20")
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !120, line: 44, baseType: !132)
!132 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !65, file: !64, line: 248, baseType: !134, size: 64, offset: 576)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "QDict", file: !69, line: 91, baseType: !136)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "QDict", file: !69, line: 91, flags: DIFlagFwdDecl)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "hotplugged", scope: !65, file: !64, line: 252, baseType: !138, size: 32, offset: 640)
!138 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "allow_unplug_during_migration", scope: !65, file: !64, line: 256, baseType: !126, size: 8, offset: 672)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "parent_bus", scope: !65, file: !64, line: 260, baseType: !141, size: 64, offset: 704)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "BusState", file: !69, line: 36, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BusState", file: !64, line: 378, size: 960, elements: !144)
!144 = !{!145, !146, !148, !149, !154, !155, !156, !157, !158, !192, !200}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !143, file: !64, line: 380, baseType: !68, size: 320)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !143, file: !64, line: 382, baseType: !147, size: 64, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !143, file: !64, line: 383, baseType: !123, size: 64, offset: 384)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "hotplug_handler", scope: !143, file: !64, line: 384, baseType: !150, size: 64, offset: 448)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "HotplugHandler", file: !152, line: 25, baseType: !153)
!152 = !DIFile(filename: "include/hw/hotplug.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "15267d9ba97c18564fc7d41a146ac8e8")
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "HotplugHandler", file: !152, line: 25, flags: DIFlagFwdDecl)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "max_index", scope: !143, file: !64, line: 385, baseType: !138, size: 32, offset: 512)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "realized", scope: !143, file: !64, line: 386, baseType: !126, size: 8, offset: 544)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !143, file: !64, line: 387, baseType: !126, size: 8, offset: 552)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "num_children", scope: !143, file: !64, line: 388, baseType: !138, size: 32, offset: 576)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !143, file: !64, line: 394, baseType: !159, size: 128, offset: 640)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "BusChildHead", file: !64, line: 364, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !64, line: 364, size: 128, elements: !161)
!161 = !{!162, !191}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !160, file: !64, line: 364, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BusChild", file: !64, line: 355, size: 384, elements: !165)
!165 = !{!166, !177, !178, !179}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !164, file: !64, line: 356, baseType: !167, size: 128)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcu_head", file: !168, line: 138, size: 128, elements: !169)
!168 = !DIFile(filename: "include/qemu/rcu.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "1fa5966fe8848bb59b99486d796e94fb")
!169 = !{!170, !172}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !167, file: !168, line: 139, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !167, file: !168, line: 140, baseType: !173, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCUCBFunc", file: !168, line: 136, baseType: !175)
!175 = !DISubroutineType(types: !176)
!176 = !{null, !171}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !164, file: !64, line: 357, baseType: !147, size: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !164, file: !64, line: 358, baseType: !138, size: 32, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !164, file: !64, line: 359, baseType: !180, size: 128, offset: 256)
!180 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !164, file: !64, line: 359, size: 128, elements: !181)
!181 = !{!182, !183}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !180, file: !64, line: 359, baseType: !163, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_circ", scope: !180, file: !64, line: 359, baseType: !184, size: 128)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "QTailQLink", file: !185, line: 388, baseType: !186)
!185 = !DIFile(filename: "include/qemu/queue.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "037402447fe7017dc8313a983f6fbe7b")
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QTailQLink", file: !185, line: 385, size: 128, elements: !187)
!187 = !{!188, !189}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "tql_next", scope: !186, file: !185, line: 386, baseType: !91, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "tql_prev", scope: !186, file: !185, line: 387, baseType: !190, size: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_circ", scope: !160, file: !64, line: 364, baseType: !184, size: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !143, file: !64, line: 398, baseType: !193, size: 128, offset: 768)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "BusStateEntry", file: !64, line: 365, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !64, line: 365, size: 128, elements: !195)
!195 = !{!196, !198}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !194, file: !64, line: 365, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !194, file: !64, line: 365, baseType: !199, size: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !143, file: !64, line: 402, baseType: !201, size: 64, offset: 896)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResettableState", file: !202, line: 25, baseType: !203)
!202 = !DIFile(filename: "include/hw/resettable.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "f1271920a2d7d7b6d7542c3e61d6e416")
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ResettableState", file: !202, line: 141, size: 64, elements: !204)
!204 = !{!205, !206, !207}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !203, file: !202, line: 142, baseType: !26, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "hold_phase_pending", scope: !203, file: !202, line: 143, baseType: !126, size: 8, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "exit_phase_in_progress", scope: !203, file: !202, line: 144, baseType: !126, size: 8, offset: 40)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "gpios", scope: !65, file: !64, line: 264, baseType: !209, size: 64, offset: 768)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "NamedGPIOListHead", file: !64, line: 210, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !64, line: 210, size: 64, elements: !211)
!211 = !{!212}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "lh_first", scope: !210, file: !64, line: 210, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NamedGPIOList", file: !64, line: 186, size: 320, elements: !215)
!215 = !{!216, !217, !232, !233, !234}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !214, file: !64, line: 187, baseType: !123, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !214, file: !64, line: 188, baseType: !218, size: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "qemu_irq", file: !69, line: 128, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IRQState", file: !222, line: 11, size: 512, elements: !223)
!222 = !DIFile(filename: "include/hw/irq.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "c3d3cf679636ee2dd93a459edfc5173a")
!223 = !{!224, !225, !230, !231}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "parent_obj", scope: !221, file: !222, line: 12, baseType: !68, size: 320)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !221, file: !222, line: 14, baseType: !226, size: 64, offset: 320)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "qemu_irq_handler", file: !69, line: 133, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !91, !138, !138}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !221, file: !222, line: 15, baseType: !91, size: 64, offset: 384)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !221, file: !222, line: 16, baseType: !138, size: 32, offset: 448)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "num_in", scope: !214, file: !64, line: 189, baseType: !138, size: 32, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "num_out", scope: !214, file: !64, line: 190, baseType: !138, size: 32, offset: 160)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !214, file: !64, line: 191, baseType: !235, size: 128, offset: 192)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !214, file: !64, line: 191, size: 128, elements: !236)
!236 = !{!237, !238}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !235, file: !64, line: 191, baseType: !213, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !235, file: !64, line: 191, baseType: !239, size: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "clocks", scope: !65, file: !64, line: 268, baseType: !241, size: 64, offset: 832)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "NamedClockListHead", file: !64, line: 211, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !64, line: 211, size: 64, elements: !243)
!243 = !{!244}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "lh_first", scope: !242, file: !64, line: 211, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NamedClockList", file: !64, line: 197, size: 320, elements: !247)
!247 = !{!248, !249, !253, !254, !255}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !246, file: !64, line: 198, baseType: !123, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "clock", scope: !246, file: !64, line: 199, baseType: !250, size: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "Clock", file: !64, line: 194, baseType: !252)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "Clock", file: !69, line: 38, flags: DIFlagFwdDecl)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !246, file: !64, line: 200, baseType: !126, size: 8, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !246, file: !64, line: 201, baseType: !126, size: 8, offset: 136)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !246, file: !64, line: 202, baseType: !256, size: 128, offset: 192)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !246, file: !64, line: 202, size: 128, elements: !257)
!257 = !{!258, !259}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !256, file: !64, line: 202, baseType: !245, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !256, file: !64, line: 202, baseType: !260, size: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "child_bus", scope: !65, file: !64, line: 272, baseType: !262, size: 64, offset: 896)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "BusStateHead", file: !64, line: 212, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !64, line: 212, size: 64, elements: !264)
!264 = !{!265}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "lh_first", scope: !263, file: !64, line: 212, baseType: !197, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "num_child_bus", scope: !65, file: !64, line: 276, baseType: !138, size: 32, offset: 960)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "instance_id_alias", scope: !65, file: !64, line: 280, baseType: !138, size: 32, offset: 992)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "alias_required_for_version", scope: !65, file: !64, line: 285, baseType: !138, size: 32, offset: 1024)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !65, file: !64, line: 289, baseType: !201, size: 64, offset: 1056)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "unplug_blockers", scope: !65, file: !64, line: 293, baseType: !83, size: 64, offset: 1152)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "mem_reentrancy_guard", scope: !65, file: !64, line: 299, baseType: !272, size: 8, offset: 1216)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemReentrancyGuard", file: !64, line: 207, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !64, line: 205, size: 8, elements: !274)
!274 = !{!275}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "engaged_in_io", scope: !273, file: !64, line: 206, baseType: !126, size: 8)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "num_mmio", scope: !60, file: !59, line: 59, baseType: !138, size: 32, offset: 1280)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "mmio", scope: !60, file: !59, line: 63, baseType: !278, size: 4096, offset: 1344)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 4096, elements: !419)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !60, file: !59, line: 60, size: 128, elements: !280)
!280 = !{!281, !287}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !279, file: !59, line: 61, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwaddr", file: !283, line: 11, baseType: !284)
!283 = !DIFile(filename: "include/exec/hwaddr.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "fa6f76ef63acb9da0cc99a3662166d11")
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !118, line: 27, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !120, line: 45, baseType: !286)
!286 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !279, file: !59, line: 62, baseType: !288, size: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemoryRegion", file: !69, line: 67, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MemoryRegion", file: !291, line: 755, size: 2176, elements: !292)
!291 = !DIFile(filename: "include/exec/memory.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "ac0603821d1f9b60fe091bb4fb80e29d")
!292 = !{!293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !306, !307, !311, !312, !313, !365, !366, !367, !368, !374, !375, !379, !380, !381, !382, !383, !384, !385, !386, !387, !390, !396, !401, !408, !409, !410, !414, !418}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "parent_obj", scope: !290, file: !291, line: 756, baseType: !68, size: 320)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "romd_mode", scope: !290, file: !291, line: 761, baseType: !126, size: 8, offset: 320)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ram", scope: !290, file: !291, line: 762, baseType: !126, size: 8, offset: 328)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "subpage", scope: !290, file: !291, line: 763, baseType: !126, size: 8, offset: 336)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !290, file: !291, line: 764, baseType: !126, size: 8, offset: 344)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "nonvolatile", scope: !290, file: !291, line: 765, baseType: !126, size: 8, offset: 352)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "rom_device", scope: !290, file: !291, line: 766, baseType: !126, size: 8, offset: 360)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "flush_coalesced_mmio", scope: !290, file: !291, line: 767, baseType: !126, size: 8, offset: 368)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "unmergeable", scope: !290, file: !291, line: 768, baseType: !126, size: 8, offset: 376)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_log_mask", scope: !290, file: !291, line: 769, baseType: !303, size: 8, offset: 384)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !118, line: 24, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !120, line: 38, baseType: !305)
!305 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "is_iommu", scope: !290, file: !291, line: 770, baseType: !126, size: 8, offset: 392)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ram_block", scope: !290, file: !291, line: 771, baseType: !308, size: 64, offset: 448)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAMBlock", file: !69, line: 108, baseType: !310)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "RAMBlock", file: !69, line: 108, flags: DIFlagFwdDecl)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !290, file: !291, line: 772, baseType: !104, size: 64, offset: 512)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !290, file: !291, line: 774, baseType: !147, size: 64, offset: 576)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !290, file: !291, line: 776, baseType: !314, size: 64, offset: 640)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemoryRegionOps", file: !291, line: 80, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MemoryRegionOps", file: !291, line: 264, size: 640, elements: !318)
!318 = !{!319, !323, !327, !344, !348, !349, !359}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !317, file: !291, line: 267, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!284, !91, !282, !26}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !317, file: !291, line: 272, baseType: !324, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{null, !91, !282, !284, !26}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "read_with_attrs", scope: !317, file: !291, line: 277, baseType: !328, size: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!331, !91, !282, !333, !26, !334}
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemTxResult", file: !332, line: 78, baseType: !117)
!332 = !DIFile(filename: "include/exec/memattrs.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "9b6ae885d22d69d08ca00517d6823a7a")
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemTxAttrs", file: !332, line: 60, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MemTxAttrs", file: !332, line: 25, size: 32, elements: !336)
!336 = !{!337, !338, !339, !340, !341, !342, !343}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "unspecified", scope: !335, file: !332, line: 31, baseType: !26, size: 1, flags: DIFlagBitField, extraData: i64 0)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "secure", scope: !335, file: !332, line: 36, baseType: !26, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !335, file: !332, line: 42, baseType: !26, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !335, file: !332, line: 44, baseType: !26, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !335, file: !332, line: 52, baseType: !26, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "requester_id", scope: !335, file: !332, line: 54, baseType: !26, size: 16, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !335, file: !332, line: 59, baseType: !26, size: 8, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "write_with_attrs", scope: !317, file: !291, line: 282, baseType: !345, size: 64, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!331, !91, !282, !284, !26, !334}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "endianness", scope: !317, file: !291, line: 288, baseType: !37, size: 32, offset: 256)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !317, file: !291, line: 308, baseType: !350, size: 192, offset: 320)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !317, file: !291, line: 290, size: 192, elements: !351)
!351 = !{!352, !353, !354, !355}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "min_access_size", scope: !350, file: !291, line: 294, baseType: !26, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "max_access_size", scope: !350, file: !291, line: 295, baseType: !26, size: 32, offset: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "unaligned", scope: !350, file: !291, line: 299, baseType: !126, size: 8, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "accepts", scope: !350, file: !291, line: 305, baseType: !356, size: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{!126, !91, !282, !26, !126, !334}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !317, file: !291, line: 323, baseType: !360, size: 96, offset: 512)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !317, file: !291, line: 310, size: 96, elements: !361)
!361 = !{!362, !363, !364}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "min_access_size", scope: !360, file: !291, line: 314, baseType: !26, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "max_access_size", scope: !360, file: !291, line: 318, baseType: !26, size: 32, offset: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "unaligned", scope: !360, file: !291, line: 322, baseType: !126, size: 8, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !290, file: !291, line: 777, baseType: !91, size: 64, offset: 704)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "container", scope: !290, file: !291, line: 778, baseType: !288, size: 64, offset: 768)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "mapped_via_alias", scope: !290, file: !291, line: 779, baseType: !138, size: 32, offset: 832)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !290, file: !291, line: 780, baseType: !369, size: 128, offset: 896)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "Int128", file: !370, line: 12, baseType: !371)
!370 = !DIFile(filename: "include/qemu/int128.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "5836b066b8c746f64a01476985ac72dd")
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int128_t", file: !372, baseType: !373)
!372 = !DIFile(filename: "../hw/char/avr_usart.c", directory: "/home/snoora/qemu/build")
!373 = !DIBasicType(name: "__int128", size: 128, encoding: DW_ATE_signed)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !290, file: !291, line: 781, baseType: !282, size: 64, offset: 1024)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !290, file: !291, line: 782, baseType: !376, size: 64, offset: 1088)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{null, !288}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !290, file: !291, line: 783, baseType: !284, size: 64, offset: 1152)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "terminates", scope: !290, file: !291, line: 784, baseType: !126, size: 8, offset: 1216)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ram_device", scope: !290, file: !291, line: 785, baseType: !126, size: 8, offset: 1224)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !290, file: !291, line: 786, baseType: !126, size: 8, offset: 1232)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "warning_printed", scope: !290, file: !291, line: 787, baseType: !126, size: 8, offset: 1240)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "vga_logging_count", scope: !290, file: !291, line: 788, baseType: !303, size: 8, offset: 1248)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !290, file: !291, line: 789, baseType: !288, size: 64, offset: 1280)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "alias_offset", scope: !290, file: !291, line: 790, baseType: !282, size: 64, offset: 1344)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !290, file: !291, line: 791, baseType: !388, size: 32, offset: 1408)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !130, line: 26, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !120, line: 41, baseType: !138)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "subregions", scope: !290, file: !291, line: 792, baseType: !391, size: 128, offset: 1472)
!391 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !290, file: !291, line: 792, size: 128, elements: !392)
!392 = !{!393, !395}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !391, file: !291, line: 792, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_circ", scope: !391, file: !291, line: 792, baseType: !184, size: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "subregions_link", scope: !290, file: !291, line: 793, baseType: !397, size: 128, offset: 1600)
!397 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !290, file: !291, line: 793, size: 128, elements: !398)
!398 = !{!399, !400}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !397, file: !291, line: 793, baseType: !394, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_circ", scope: !397, file: !291, line: 793, baseType: !184, size: 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "coalesced", scope: !290, file: !291, line: 794, baseType: !402, size: 128, offset: 1728)
!402 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !290, file: !291, line: 794, size: 128, elements: !403)
!403 = !{!404, !407}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !402, file: !291, line: 794, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "CoalescedMemoryRange", file: !291, line: 748, flags: DIFlagFwdDecl)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_circ", scope: !402, file: !291, line: 794, baseType: !184, size: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !290, file: !291, line: 795, baseType: !95, size: 64, offset: 1856)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ioeventfd_nb", scope: !290, file: !291, line: 796, baseType: !26, size: 32, offset: 1920)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ioeventfds", scope: !290, file: !291, line: 797, baseType: !411, size: 64, offset: 1984)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemoryRegionIoeventfd", file: !291, line: 749, baseType: !413)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemoryRegionIoeventfd", file: !291, line: 749, flags: DIFlagFwdDecl)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "rdm", scope: !290, file: !291, line: 798, baseType: !415, size: 64, offset: 2048)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "RamDiscardManager", file: !291, line: 48, baseType: !417)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "RamDiscardManager", file: !291, line: 48, flags: DIFlagFwdDecl)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "disable_reentrancy_guard", scope: !290, file: !291, line: 801, baseType: !126, size: 8, offset: 2112)
!419 = !{!420}
!420 = !DISubrange(count: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "num_pio", scope: !60, file: !59, line: 64, baseType: !138, size: 32, offset: 5440)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "pio", scope: !60, file: !59, line: 65, baseType: !423, size: 1024, offset: 5472)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 1024, elements: !419)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "mmio", scope: !55, file: !54, line: 67, baseType: !289, size: 2176, offset: 6528)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "chr", scope: !55, file: !54, line: 69, baseType: !426, size: 448, offset: 8704)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "CharBackend", file: !44, line: 18, baseType: !427)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CharBackend", file: !428, line: 16, size: 448, elements: !429)
!428 = !DIFile(filename: "include/chardev/char-fe.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "9dddb80b5b168fe6ec2b8d247376d6d6")
!429 = !{!430, !559, !565, !571, !578, !581, !582, !583}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "chr", scope: !427, file: !428, line: 17, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "Chardev", file: !44, line: 231, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Chardev", file: !44, line: 59, size: 1216, elements: !434)
!434 = !{!435, !436, !472, !474, !475, !476, !477, !478, !479, !554, !555}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "parent_obj", scope: !433, file: !44, line: 60, baseType: !68, size: 320)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "chr_write_lock", scope: !433, file: !44, line: 62, baseType: !437, size: 384, offset: 320)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "QemuMutex", file: !69, line: 96, baseType: !438)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QemuMutex", file: !439, line: 7, size: 384, elements: !440)
!439 = !DIFile(filename: "include/qemu/thread-posix.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "eb5e3430f50059c014e844d2f733c882")
!440 = !{!441, !471}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !438, file: !439, line: 8, baseType: !442, size: 320)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !443, line: 72, baseType: !444)
!443 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "8a5acdbeec491eca11cf81cb1ef77ea7")
!444 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !443, line: 67, size: 320, elements: !445)
!445 = !{!446, !466, !470}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !444, file: !443, line: 69, baseType: !447, size: 320)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !448, line: 22, size: 320, elements: !449)
!448 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "6b075eca9ab0e2d761b2afc4ecfab776")
!449 = !{!450, !451, !452, !453, !454, !455, !457, !458}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !447, file: !448, line: 24, baseType: !138, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !447, file: !448, line: 25, baseType: !26, size: 32, offset: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !447, file: !448, line: 26, baseType: !138, size: 32, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !447, file: !448, line: 28, baseType: !26, size: 32, offset: 96)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !447, file: !448, line: 32, baseType: !138, size: 32, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !447, file: !448, line: 34, baseType: !456, size: 16, offset: 160)
!456 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !447, file: !448, line: 35, baseType: !456, size: 16, offset: 176)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !447, file: !448, line: 36, baseType: !459, size: 128, offset: 192)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !460, line: 55, baseType: !461)
!460 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "b9a7199822bce372686baacd32a9f4f3")
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !460, line: 51, size: 128, elements: !462)
!462 = !{!463, !465}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !461, file: !460, line: 53, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !461, file: !460, line: 54, baseType: !464, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !444, file: !443, line: 70, baseType: !467, size: 320)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 320, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 40)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !444, file: !443, line: 71, baseType: !132, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !438, file: !439, line: 13, baseType: !126, size: 8, offset: 320)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "be", scope: !433, file: !44, line: 63, baseType: !473, size: 64, offset: 704)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !433, file: !44, line: 64, baseType: !123, size: 64, offset: 768)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !433, file: !44, line: 65, baseType: !123, size: 64, offset: 832)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "logfd", scope: !433, file: !44, line: 66, baseType: !138, size: 32, offset: 896)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "be_open", scope: !433, file: !44, line: 67, baseType: !138, size: 32, offset: 928)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "handover_yank_instance", scope: !433, file: !44, line: 69, baseType: !126, size: 8, offset: 960)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "gsource", scope: !433, file: !44, line: 70, baseType: !480, size: 64, offset: 1024)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !482, line: 86, baseType: !483)
!482 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "", checksumkind: CSK_MD5, checksum: "ad7e9a6795d752bf397c813cc98310f6")
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !482, line: 261, size: 768, elements: !484)
!484 = !{!485, !486, !508, !537, !539, !543, !544, !545, !546, !547, !548, !549, !550}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !483, file: !482, line: 264, baseType: !89, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !483, file: !482, line: 265, baseType: !487, size: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !482, line: 99, baseType: !489)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !482, line: 286, size: 192, elements: !490)
!490 = !{!491, !495, !496}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !489, file: !482, line: 288, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{null, !89}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !489, file: !482, line: 289, baseType: !492, size: 64, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !489, file: !482, line: 290, baseType: !497, size: 64, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{null, !89, !480, !500, !507}
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !482, line: 195, baseType: !502)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{!505, !89}
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !90, line: 56, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !90, line: 55, baseType: !138)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !483, file: !482, line: 267, baseType: !509, size: 64, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !511)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !482, line: 155, baseType: !512)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !482, line: 304, size: 384, elements: !513)
!513 = !{!514, !519, !523, !527, !531, !532}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !512, file: !482, line: 306, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{!505, !480, !518}
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !512, file: !482, line: 308, baseType: !520, size: 64, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!505, !480}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !512, file: !482, line: 309, baseType: !524, size: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!505, !480, !501, !89}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !512, file: !482, line: 312, baseType: !528, size: 64, offset: 192)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{null, !480}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !512, file: !482, line: 316, baseType: !501, size: 64, offset: 256)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !512, file: !482, line: 317, baseType: !533, size: 64, offset: 320)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !482, line: 302, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{null}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !483, file: !482, line: 268, baseType: !538, size: 32, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !90, line: 61, baseType: !26)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !483, file: !482, line: 270, baseType: !540, size: 64, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !482, line: 70, baseType: !542)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !482, line: 70, flags: DIFlagFwdDecl)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !483, file: !482, line: 272, baseType: !506, size: 32, offset: 320)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !483, file: !482, line: 273, baseType: !538, size: 32, offset: 352)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !483, file: !482, line: 274, baseType: !538, size: 32, offset: 384)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !483, file: !482, line: 276, baseType: !83, size: 64, offset: 448)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !483, file: !482, line: 278, baseType: !480, size: 64, offset: 512)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !483, file: !482, line: 279, baseType: !480, size: 64, offset: 576)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !483, file: !482, line: 281, baseType: !123, size: 64, offset: 640)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !483, file: !482, line: 283, baseType: !551, size: 64, offset: 704)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !482, line: 87, baseType: !553)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !482, line: 87, flags: DIFlagFwdDecl)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "gcontext", scope: !433, file: !44, line: 71, baseType: !540, size: 64, offset: 1088)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !433, file: !44, line: 72, baseType: !556, size: 64, offset: 1152)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 64, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 1)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "chr_event", scope: !427, file: !428, line: 18, baseType: !560, size: 64, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "IOEventHandler", file: !428, line: 7, baseType: !562)
!562 = !DISubroutineType(types: !563)
!563 = !{null, !91, !564}
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "QEMUChrEvent", file: !44, line: 35, baseType: !43)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "chr_can_read", scope: !427, file: !428, line: 19, baseType: !566, size: 64, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "IOCanReadHandler", file: !568, line: 197, baseType: !569)
!568 = !DIFile(filename: "include/qemu/main-loop.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "6bb0fb053e7fae5cab70e61b72f7650e")
!569 = !DISubroutineType(types: !570)
!570 = !{!138, !91}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "chr_read", scope: !427, file: !428, line: 20, baseType: !572, size: 64, offset: 192)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "IOReadHandler", file: !568, line: 182, baseType: !574)
!574 = !DISubroutineType(types: !575)
!575 = !{null, !91, !576, !138}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !303)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "chr_be_change", scope: !427, file: !428, line: 21, baseType: !579, size: 64, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "BackendChangeHandler", file: !428, line: 8, baseType: !569)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !427, file: !428, line: 22, baseType: !91, size: 64, offset: 320)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !427, file: !428, line: 23, baseType: !26, size: 32, offset: 384)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "fe_is_open", scope: !427, file: !428, line: 24, baseType: !126, size: 8, offset: 416)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !55, file: !54, line: 71, baseType: !126, size: 8, offset: 9152)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !55, file: !54, line: 73, baseType: !303, size: 8, offset: 9160)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "data_valid", scope: !55, file: !54, line: 74, baseType: !126, size: 8, offset: 9168)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "char_mask", scope: !55, file: !54, line: 75, baseType: !303, size: 8, offset: 9176)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "csra", scope: !55, file: !54, line: 77, baseType: !303, size: 8, offset: 9184)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "csrb", scope: !55, file: !54, line: 78, baseType: !303, size: 8, offset: 9192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "csrc", scope: !55, file: !54, line: 79, baseType: !303, size: 8, offset: 9200)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "brrh", scope: !55, file: !54, line: 81, baseType: !303, size: 8, offset: 9208)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "brrl", scope: !55, file: !54, line: 82, baseType: !303, size: 8, offset: 9216)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "rxc_irq", scope: !55, file: !54, line: 85, baseType: !219, size: 64, offset: 9280)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "txc_irq", scope: !55, file: !54, line: 87, baseType: !219, size: 64, offset: 9344)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "dre_irq", scope: !55, file: !54, line: 89, baseType: !219, size: 64, offset: 9408)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !90, line: 52, baseType: !5)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "DeviceClass", file: !64, line: 77, baseType: !601)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DeviceClass", file: !64, line: 114, size: 1472, elements: !602)
!602 = !{!603, !604, !605, !606, !607, !712, !713, !714, !719, !724, !726, !731, !736}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "parent_class", scope: !601, file: !64, line: 116, baseType: !75, size: 768)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "categories", scope: !601, file: !64, line: 123, baseType: !556, size: 64, offset: 768)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "fw_name", scope: !601, file: !64, line: 127, baseType: !95, size: 64, offset: 832)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !601, file: !64, line: 131, baseType: !95, size: 64, offset: 896)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "props_", scope: !601, file: !64, line: 139, baseType: !608, size: 64, offset: 960)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !610)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "Property", file: !69, line: 88, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Property", file: !612, line: 15, size: 704, elements: !613)
!612 = !DIFile(filename: "include/hw/qdev-properties.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "10ae8de04a0435513a66a554d29e54ac")
!613 = !{!614, !615, !698, !700, !701, !702, !703, !708, !709, !710, !711}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !611, file: !612, line: 16, baseType: !95, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !611, file: !612, line: 17, baseType: !616, size: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !618)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyInfo", file: !69, line: 89, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyInfo", file: !612, line: 32, size: 640, elements: !620)
!620 = !{!621, !622, !623, !639, !640, !647, !691, !695, !696, !697}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !619, file: !612, line: 33, baseType: !95, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !619, file: !612, line: 34, baseType: !95, size: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "enum_table", scope: !619, file: !612, line: 35, baseType: !624, size: 64, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !626)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "QEnumLookup", file: !627, line: 23, baseType: !628)
!627 = !DIFile(filename: "include/qapi/util.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "75e869cdc12f3071edfdd31fe0065a9e")
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QEnumLookup", file: !627, line: 19, size: 192, elements: !629)
!629 = !{!630, !633, !637}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !628, file: !627, line: 20, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "special_features", scope: !628, file: !627, line: 21, baseType: !634, size: 64, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !635)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !305)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !628, file: !627, line: 22, baseType: !638, size: 32, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "realized_set_allowed", scope: !619, file: !612, line: 36, baseType: !126, size: 8, offset: 192)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !619, file: !612, line: 37, baseType: !641, size: 64, offset: 256)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!138, !104, !644, !123, !645}
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !646, line: 46, baseType: !286)
!646 = !DIFile(filename: "linuxbrew/.linuxbrew/Cellar/llvm@16/16.0.6_1/lib/clang/16/include/stddef.h", directory: "/home", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!647 = !DIDerivedType(tag: DW_TAG_member, name: "set_default_value", scope: !619, file: !612, line: 38, baseType: !648, size: 64, offset: 320)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{null, !651, !608}
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectProperty", file: !71, line: 30, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectProperty", file: !71, line: 88, size: 640, elements: !654)
!654 = !{!655, !656, !657, !658, !670, !671, !676, !681, !686, !687}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !653, file: !71, line: 90, baseType: !123, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !653, file: !71, line: 91, baseType: !123, size: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !653, file: !71, line: 92, baseType: !123, size: 64, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !653, file: !71, line: 93, baseType: !659, size: 64, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectPropertyAccessor", file: !71, line: 42, baseType: !661)
!661 = !DISubroutineType(types: !662)
!662 = !{null, !104, !663, !95, !91, !666}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "Visitor", file: !69, line: 118, baseType: !665)
!665 = !DICompositeType(tag: DW_TAG_structure_type, name: "Visitor", file: !69, line: 118, flags: DIFlagFwdDecl)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "Error", file: !69, line: 50, baseType: !669)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", file: !69, line: 50, flags: DIFlagFwdDecl)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !653, file: !71, line: 94, baseType: !659, size: 64, offset: 256)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "resolve", scope: !653, file: !71, line: 95, baseType: !672, size: 64, offset: 320)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectPropertyResolve", file: !71, line: 63, baseType: !674)
!674 = !DISubroutineType(types: !675)
!675 = !{!104, !104, !91, !95}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !653, file: !71, line: 96, baseType: !677, size: 64, offset: 384)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectPropertyRelease", file: !71, line: 75, baseType: !679)
!679 = !DISubroutineType(types: !680)
!680 = !{null, !104, !95, !91}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !653, file: !71, line: 97, baseType: !682, size: 64, offset: 448)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectPropertyInit", file: !71, line: 86, baseType: !684)
!684 = !DISubroutineType(types: !685)
!685 = !{null, !104, !651}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !653, file: !71, line: 98, baseType: !91, size: 64, offset: 512)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "defval", scope: !653, file: !71, line: 99, baseType: !688, size: 64, offset: 576)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "QObject", file: !69, line: 106, baseType: !690)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "QObject", file: !69, line: 106, flags: DIFlagFwdDecl)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !619, file: !612, line: 39, baseType: !692, size: 64, offset: 384)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!651, !74, !95, !608}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !619, file: !612, line: 41, baseType: !659, size: 64, offset: 448)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !619, file: !612, line: 42, baseType: !659, size: 64, offset: 512)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !619, file: !612, line: 43, baseType: !677, size: 64, offset: 576)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !611, file: !612, line: 18, baseType: !699, size: 64, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !646, line: 35, baseType: !132)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "bitnr", scope: !611, file: !612, line: 19, baseType: !303, size: 8, offset: 192)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "bitmask", scope: !611, file: !612, line: 20, baseType: !284, size: 64, offset: 256)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "set_default", scope: !611, file: !612, line: 21, baseType: !126, size: 8, offset: 320)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "defval", scope: !611, file: !612, line: 25, baseType: !704, size: 64, offset: 384)
!704 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !611, file: !612, line: 22, size: 64, elements: !705)
!705 = !{!706, !707}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !704, file: !612, line: 23, baseType: !129, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !704, file: !612, line: 24, baseType: !284, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "arrayoffset", scope: !611, file: !612, line: 26, baseType: !138, size: 32, offset: 448)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "arrayinfo", scope: !611, file: !612, line: 27, baseType: !616, size: 64, offset: 512)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "arrayfieldsize", scope: !611, file: !612, line: 28, baseType: !138, size: 32, offset: 576)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "link_type", scope: !611, file: !612, line: 29, baseType: !95, size: 64, offset: 640)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "user_creatable", scope: !601, file: !64, line: 154, baseType: !126, size: 8, offset: 1024)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "hotpluggable", scope: !601, file: !64, line: 155, baseType: !126, size: 8, offset: 1032)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "legacy_reset", scope: !601, file: !64, line: 166, baseType: !715, size: 64, offset: 1088)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "DeviceReset", file: !64, line: 95, baseType: !716)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{null, !147}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "realize", scope: !601, file: !64, line: 167, baseType: !720, size: 64, offset: 1152)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "DeviceRealize", file: !64, line: 93, baseType: !721)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{null, !147, !666}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "unrealize", scope: !601, file: !64, line: 168, baseType: !725, size: 64, offset: 1216)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "DeviceUnrealize", file: !64, line: 94, baseType: !716)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "sync_config", scope: !601, file: !64, line: 169, baseType: !727, size: 64, offset: 1280)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "DeviceSyncConfig", file: !64, line: 98, baseType: !728)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!138, !147, !666}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "vmsd", scope: !601, file: !64, line: 175, baseType: !732, size: 64, offset: 1344)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !734)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "VMStateDescription", file: !69, line: 120, baseType: !735)
!735 = !DICompositeType(tag: DW_TAG_structure_type, name: "VMStateDescription", file: !69, line: 120, flags: DIFlagFwdDecl)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "bus_type", scope: !601, file: !64, line: 181, baseType: !95, size: 64, offset: 1408)
!737 = !{!0, !8, !13, !18, !738, !743, !20, !748, !753, !755, !760, !762, !764, !766, !771, !773, !778, !783, !788, !793, !798, !803, !808, !810, !815, !820, !825, !830, !832, !837, !842, !847, !852, !857, !862}
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(scope: null, file: !2, line: 309, type: !740, isLocal: true, isDefinition: true)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !741)
!741 = !{!742}
!742 = !DISubrange(count: 10)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(scope: null, file: !2, line: 310, type: !745, isLocal: true, isDefinition: true)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !746)
!746 = !{!747}
!747 = !DISubrange(count: 15)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(scope: null, file: !54, line: 60, type: !750, isLocal: true, isDefinition: true)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !751)
!751 = !{!752}
!752 = !DISubrange(count: 46)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(scope: null, file: !54, line: 60, type: !740, isLocal: true, isDefinition: true)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(scope: null, file: !59, line: 19, type: !757, isLocal: true, isDefinition: true)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !758)
!758 = !{!759}
!759 = !DISubrange(count: 38)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(scope: null, file: !59, line: 19, type: !745, isLocal: true, isDefinition: true)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(name: "avr_usart_ops", scope: !22, file: !2, line: 255, type: !315, isLocal: true, isDefinition: true)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(scope: null, file: !64, line: 77, type: !10, isLocal: true, isDefinition: true)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(scope: null, file: !64, line: 77, type: !768, isLocal: true, isDefinition: true)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !769)
!769 = !{!770}
!770 = !DISubrange(count: 41)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(scope: null, file: !64, line: 77, type: !10, isLocal: true, isDefinition: true)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(scope: null, file: !2, line: 75, type: !775, isLocal: true, isDefinition: true)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !776)
!776 = !{!777}
!777 = !DISubrange(count: 34)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(scope: null, file: !2, line: 75, type: !780, isLocal: true, isDefinition: true)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !781)
!781 = !{!782}
!782 = !DISubrange(count: 17)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(scope: null, file: !2, line: 82, type: !785, isLocal: true, isDefinition: true)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 472, elements: !786)
!786 = !{!787}
!787 = !DISubrange(count: 59)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(scope: null, file: !2, line: 89, type: !790, isLocal: true, isDefinition: true)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !791)
!791 = !{!792}
!792 = !DISubrange(count: 23)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(scope: null, file: !64, line: 77, type: !795, isLocal: true, isDefinition: true)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !796)
!796 = !{!797}
!797 = !DISubrange(count: 13)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(scope: null, file: !2, line: 263, type: !800, isLocal: true, isDefinition: true)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !801)
!801 = !{!802}
!802 = !DISubrange(count: 8)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(name: "avr_usart_properties", scope: !22, file: !2, line: 262, type: !805, isLocal: true, isDefinition: true)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !610, size: 1408, elements: !806)
!806 = !{!807}
!807 = !DISubrange(count: 2)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(scope: null, file: !2, line: 42, type: !740, isLocal: true, isDefinition: true)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(scope: null, file: !2, line: 42, type: !812, isLocal: true, isDefinition: true)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 424, elements: !813)
!813 = !{!814}
!814 = !DISubrange(count: 53)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(scope: null, file: !2, line: 43, type: !817, isLocal: true, isDefinition: true)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !818)
!818 = !{!819}
!819 = !DISubrange(count: 19)
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(scope: null, file: !2, line: 112, type: !822, isLocal: true, isDefinition: true)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 432, elements: !823)
!823 = !{!824}
!824 = !DISubrange(count: 54)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(scope: null, file: !2, line: 145, type: !827, isLocal: true, isDefinition: true)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !828)
!828 = !{!829}
!829 = !DISubrange(count: 22)
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(scope: null, file: !2, line: 145, type: !745, isLocal: true, isDefinition: true)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(scope: null, file: !2, line: 160, type: !834, isLocal: true, isDefinition: true)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !835)
!835 = !{!836}
!836 = !DISubrange(count: 24)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(scope: null, file: !2, line: 160, type: !839, isLocal: true, isDefinition: true)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !840)
!840 = !{!841}
!841 = !DISubrange(count: 61)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(scope: null, file: !2, line: 195, type: !844, isLocal: true, isDefinition: true)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !845)
!845 = !{!846}
!846 = !DISubrange(count: 33)
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(scope: null, file: !2, line: 195, type: !849, isLocal: true, isDefinition: true)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !850)
!850 = !{!851}
!851 = !DISubrange(count: 16)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(scope: null, file: !2, line: 224, type: !854, isLocal: true, isDefinition: true)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !855)
!855 = !{!856}
!856 = !DISubrange(count: 37)
!857 = !DIGlobalVariableExpression(var: !858, expr: !DIExpression())
!858 = distinct !DIGlobalVariable(scope: null, file: !2, line: 230, type: !859, isLocal: true, isDefinition: true)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !860)
!860 = !{!861}
!861 = !DISubrange(count: 20)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(scope: null, file: !2, line: 233, type: !864, isLocal: true, isDefinition: true)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !865)
!865 = !{!866}
!866 = !DISubrange(count: 27)
!867 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !868)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "TypeInfo", file: !71, line: 23, baseType: !869)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TypeInfo", file: !71, line: 474, size: 832, elements: !870)
!870 = !{!871, !872, !873, !874, !875, !877, !878, !879, !880, !881, !885, !886, !887}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !869, file: !71, line: 476, baseType: !95, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !869, file: !71, line: 477, baseType: !95, size: 64, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "instance_size", scope: !869, file: !71, line: 479, baseType: !645, size: 64, offset: 128)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "instance_align", scope: !869, file: !71, line: 480, baseType: !645, size: 64, offset: 192)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "instance_init", scope: !869, file: !71, line: 481, baseType: !876, size: 64, offset: 256)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "instance_post_init", scope: !869, file: !71, line: 482, baseType: !876, size: 64, offset: 320)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "instance_finalize", scope: !869, file: !71, line: 483, baseType: !876, size: 64, offset: 384)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "abstract", scope: !869, file: !71, line: 485, baseType: !126, size: 8, offset: 448)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "class_size", scope: !869, file: !71, line: 486, baseType: !645, size: 64, offset: 512)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "class_init", scope: !869, file: !71, line: 488, baseType: !882, size: 64, offset: 576)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DISubroutineType(types: !884)
!884 = !{null, !74, !91}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "class_base_init", scope: !869, file: !71, line: 489, baseType: !882, size: 64, offset: 640)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "class_data", scope: !869, file: !71, line: 490, baseType: !91, size: 64, offset: 704)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "interfaces", scope: !869, file: !71, line: 492, baseType: !888, size: 64, offset: 768)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterfaceInfo", file: !71, line: 26, baseType: !890)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "InterfaceInfo", file: !71, line: 565, size: 64, elements: !891)
!891 = !{!892}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !890, file: !71, line: 566, baseType: !95, size: 64)
!893 = !{i32 7, !"Dwarf Version", i32 5}
!894 = !{i32 2, !"Debug Info Version", i32 3}
!895 = !{i32 1, !"wchar_size", i32 4}
!896 = !{i32 8, !"PIC Level", i32 2}
!897 = !{i32 7, !"PIE Level", i32 2}
!898 = !{i32 7, !"uwtable", i32 2}
!899 = !{!"Homebrew clang version 16.0.6"}
!900 = distinct !DISubprogram(name: "do_qemu_init_avr_usart_register_types", scope: !2, file: !2, line: 321, type: !535, scopeLine: 321, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !22, retainedNodes: !901)
!901 = !{}
!902 = !DILocation(line: 321, column: 1, scope: !900)
!903 = distinct !DISubprogram(name: "avr_usart_register_types", scope: !2, file: !2, line: 316, type: !535, scopeLine: 317, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !22, retainedNodes: !901)
!904 = !DILocation(line: 318, column: 5, scope: !903)
!905 = !DILocation(line: 319, column: 1, scope: !903)
!906 = distinct !DISubprogram(name: "main_avr_usart_read", scope: !2, file: !2, line: 327, type: !907, scopeLine: 328, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !22, retainedNodes: !909)
!907 = !DISubroutineType(types: !908)
!908 = !{!138}
!909 = !{!910, !911, !912}
!910 = !DILocalVariable(name: "state", scope: !906, file: !2, line: 329, type: !55)
!911 = !DILocalVariable(name: "offset", scope: !906, file: !2, line: 330, type: !282)
!912 = !DILocalVariable(name: "size", scope: !906, file: !2, line: 331, type: !26)
!913 = !DILocation(line: 329, column: 23, scope: !906)
!914 = !DILocation(line: 0, scope: !906)
!915 = !DILocation(line: 330, column: 9, scope: !906)
!916 = !{!"auto-init"}
!917 = !DILocation(line: 331, column: 11, scope: !906)
!918 = !DILocation(line: 332, column: 2, scope: !906)
!919 = !DILocation(line: 333, column: 2, scope: !906)
!920 = !DILocation(line: 334, column: 2, scope: !906)
!921 = !DILocation(line: 335, column: 14, scope: !906)
!922 = !DILocation(line: 335, column: 19, scope: !906)
!923 = !DILocation(line: 335, column: 2, scope: !906)
!924 = !DILocation(line: 337, column: 25, scope: !906)
!925 = !DILocation(line: 337, column: 33, scope: !906)
!926 = !DILocation(line: 337, column: 2, scope: !906)
!927 = !DILocation(line: 338, column: 2, scope: !906)
!928 = !DISubprogram(name: "klee_make_symbolic", scope: !2, file: !2, line: 323, type: !929, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !901)
!929 = !DISubroutineType(types: !930)
!930 = !{null, !91, !645, !95}
!931 = !DISubprogram(name: "klee_assume", scope: !2, file: !2, line: 324, type: !932, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !901)
!932 = !DISubroutineType(types: !933)
!933 = !{null, !934}
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !935, line: 79, baseType: !286)
!935 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "bfb03fa9c46a839e35c32b929fbdbb8e")
!936 = distinct !DISubprogram(name: "avr_usart_read", scope: !2, file: !2, line: 108, type: !321, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !22, retainedNodes: !937)
!937 = !{!938, !939, !940, !941, !942}
