; ModuleID = '/home/snoora/qemu/build/libcommon.a.p/hw_char_pl011.c.o'
source_filename = "../hw/char/pl011.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.TypeInfo = type { ptr, ptr, i64, i64, ptr, ptr, ptr, i8, i64, ptr, ptr, ptr, ptr }
%struct.MemoryRegionOps = type { ptr, ptr, ptr, ptr, i32, %struct.anon.4, %struct.anon.5 }
%struct.anon.4 = type { i32, i32, i8, ptr }
%struct.anon.5 = type { i32, i32, i8 }
%struct.VMStateDescription = type { ptr, i8, i8, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.Property = type { ptr, ptr, i64, i8, i64, i8, %union.anon.9, i32, ptr, i32, ptr }
%union.anon.9 = type { i64 }
%struct.VMStateField = type { ptr, ptr, i64, i64, i64, i32, i64, i64, ptr, i32, ptr, i32, i32, ptr }
%struct.VMStateInfo = type { ptr, ptr, ptr }
%struct.PropertyInfo = type { ptr, ptr, ptr, i8, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.PL011State = type { %struct.SysBusDevice, %struct.MemoryRegion, i32, i32, i32, i32, i32, i32, i32, [16 x i32], i32, i32, i32, i32, i32, i32, i32, %struct.CharBackend, [6 x ptr], ptr, i8, ptr, [8 x i8] }
%struct.SysBusDevice = type { %struct.DeviceState, i32, [32 x %struct.anon.3], i32, [32 x i32] }

!34 = !DIEnumerator(name: "ClockPreUpdate", value: 2)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 20, baseType: !31, size: 32, elements: !37)
!36 = !DIFile(filename: "include/chardev/char.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "511c7fe47d4c53f1b2261c424644c265")
!37 = !{!38, !39, !40, !41, !42}
!38 = !DIEnumerator(name: "CHR_EVENT_BREAK", value: 0)
!39 = !DIEnumerator(name: "CHR_EVENT_OPENED", value: 1)
!40 = !DIEnumerator(name: "CHR_EVENT_MUX_IN", value: 2)
!41 = !DIEnumerator(name: "CHR_EVENT_MUX_OUT", value: 3)
!42 = !DIEnumerator(name: "CHR_EVENT_CLOSED", value: 4)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "device_endian", file: !44, line: 45, baseType: !31, size: 32, elements: !45)
!44 = !DIFile(filename: "include/exec/cpu-common.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "dd363f974d6967ea1215596bce64439b")
!45 = !{!46, !47, !48}
!46 = !DIEnumerator(name: "DEVICE_NATIVE_ENDIAN", value: 0)
!47 = !DIEnumerator(name: "DEVICE_BIG_ENDIAN", value: 1)
!48 = !DIEnumerator(name: "DEVICE_LITTLE_ENDIAN", value: 2)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !50, line: 42, baseType: !31, size: 32, elements: !51)
!50 = !DIFile(filename: "include/qemu/module.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "6305787c50fb72a9b185dddd38011933")
!51 = !{!52, !53, !54, !55, !56, !57, !58, !59, !60}
!52 = !DIEnumerator(name: "MODULE_INIT_MIGRATION", value: 0)
!53 = !DIEnumerator(name: "MODULE_INIT_BLOCK", value: 1)
!54 = !DIEnumerator(name: "MODULE_INIT_OPTS", value: 2)
!55 = !DIEnumerator(name: "MODULE_INIT_QOM", value: 3)
!56 = !DIEnumerator(name: "MODULE_INIT_TRACE", value: 4)
!57 = !DIEnumerator(name: "MODULE_INIT_XEN_BACKEND", value: 5)
!58 = !DIEnumerator(name: "MODULE_INIT_LIBQOS", value: 6)
!59 = !DIEnumerator(name: "MODULE_INIT_FUZZ_TARGET", value: 7)
!60 = !DIEnumerator(name: "MODULE_INIT_MAX", value: 8)
!61 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !62, line: 157, baseType: !31, size: 32, elements: !63)
!62 = !DIFile(filename: "include/migration/vmstate.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "65df9f6deb4ce9138d58627c1ae02bd0")
!63 = !{!64, !65, !66, !67, !68, !69, !70}
!64 = !DIEnumerator(name: "MIG_PRI_DEFAULT", value: 0)
!65 = !DIEnumerator(name: "MIG_PRI_IOMMU", value: 1)
!66 = !DIEnumerator(name: "MIG_PRI_PCI_BUS", value: 2)
!67 = !DIEnumerator(name: "MIG_PRI_VIRTIO_MEM", value: 3)
!68 = !DIEnumerator(name: "MIG_PRI_GICV3_ITS", value: 4)
!69 = !DIEnumerator(name: "MIG_PRI_GICV3", value: 5)
!70 = !DIEnumerator(name: "MIG_PRI_MAX", value: 6)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "VMStateFlags", file: !62, line: 51, baseType: !31, size: 32, elements: !72)
!72 = !{!73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89}
!73 = !DIEnumerator(name: "VMS_SINGLE", value: 1)
!74 = !DIEnumerator(name: "VMS_POINTER", value: 2)
!75 = !DIEnumerator(name: "VMS_ARRAY", value: 4)
!76 = !DIEnumerator(name: "VMS_STRUCT", value: 8)
!77 = !DIEnumerator(name: "VMS_VARRAY_INT32", value: 16)
!78 = !DIEnumerator(name: "VMS_BUFFER", value: 32)
!79 = !DIEnumerator(name: "VMS_ARRAY_OF_POINTER", value: 64)
!80 = !DIEnumerator(name: "VMS_VARRAY_UINT16", value: 128)
!81 = !DIEnumerator(name: "VMS_VBUFFER", value: 256)
!82 = !DIEnumerator(name: "VMS_MULTIPLY", value: 512)
!83 = !DIEnumerator(name: "VMS_VARRAY_UINT8", value: 1024)
!84 = !DIEnumerator(name: "VMS_VARRAY_UINT32", value: 2048)
!85 = !DIEnumerator(name: "VMS_MUST_EXIST", value: 4096)
!86 = !DIEnumerator(name: "VMS_ALLOC", value: 8192)
!87 = !DIEnumerator(name: "VMS_MULTIPLY_ELEMENTS", value: 16384)
!88 = !DIEnumerator(name: "VMS_VSTRUCT", value: 32768)
!89 = !DIEnumerator(name: "VMS_END", value: 65536)
!90 = !{!91, !335, !133, !486, !120, !677, !679, !103, !167}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "DeviceState", file: !93, line: 77, baseType: !94)
!93 = !DIFile(filename: "include/hw/qdev-core.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "67264af7ed760669a154394b865d52dd")
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DeviceState", file: !93, line: 220, size: 1280, elements: !95)
!95 = !{!96, !151, !153, !154, !156, !157, !162, !166, !168, !169, !236, !268, !320, !325, !326, !327, !328, !329, !330}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "parent_obj", scope: !94, file: !93, line: 222, baseType: !97, size: 320)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !98, line: 77, baseType: !99)
!98 = !DIFile(filename: "include/qemu/typedefs.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "7d670dc4483fed36c57e997370d4c9a1")
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !100, line: 153, size: 320, elements: !101)
!100 = !DIFile(filename: "include/qom/object.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "9e6a829e5f72c582a3bea10c17cbf078")
!101 = !{!102, !139, !144, !145, !150}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !99, file: !100, line: 156, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectClass", file: !98, line: 78, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectClass", file: !100, line: 127, size: 768, elements: !106)
!106 = !{!107, !111, !122, !127, !128, !134}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !105, file: !100, line: 130, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", file: !100, line: 21, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "TypeImpl", file: !100, line: 20, flags: DIFlagFwdDecl)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "interfaces", scope: !105, file: !100, line: 131, baseType: !112, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !114, line: 39, baseType: !115)
!114 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "", checksumkind: CSK_MD5, checksum: "c2b16cbedbdd77e3f819637c21501624")
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !114, line: 41, size: 128, elements: !116)
!116 = !{!117, !121}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !115, file: !114, line: 43, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !119, line: 109, baseType: !120)
!119 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "bb471ab4f4c8d1bff5846ccdfd1b3ac4")
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !115, file: !114, line: 44, baseType: !112, size: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "object_cast_cache", scope: !105, file: !100, line: 133, baseType: !123, size: 256, offset: 128)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 256, elements: !125)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!125 = !{!126}
!126 = !DISubrange(count: 4)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "class_cast_cache", scope: !105, file: !100, line: 134, baseType: !123, size: 256, offset: 384)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "unparent", scope: !105, file: !100, line: 136, baseType: !129, size: 64, offset: 640)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectUnparent", file: !100, line: 109, baseType: !131)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !133}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !105, file: !100, line: 138, baseType: !135, size: 64, offset: 704)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !137, line: 40, baseType: !138)
!137 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "", checksumkind: CSK_MD5, checksum: "ff178276f16d53966cd41952349b047f")
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !137, line: 40, flags: DIFlagFwdDecl)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !99, file: !100, line: 157, baseType: !140, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectFree", file: !100, line: 117, baseType: !142)
!142 = !DISubroutineType(types: !143)
!143 = !{null, !120}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !99, file: !100, line: 158, baseType: !135, size: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !99, file: !100, line: 159, baseType: !146, size: 32, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !147, line: 26, baseType: !148)
!147 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "256fcabbefa27ca8cf5e6d37525e6e16")
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !149, line: 42, baseType: !31)
!149 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e1865d9fe29fe1b5ced550b7ba458f9e")
!150 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !99, file: !100, line: 160, baseType: !133, size: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !94, file: !93, line: 228, baseType: !152, size: 64, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "canonical_path", scope: !94, file: !93, line: 232, baseType: !152, size: 64, offset: 384)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "realized", scope: !94, file: !93, line: 236, baseType: !155, size: 8, offset: 448)
!155 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "pending_deleted_event", scope: !94, file: !93, line: 240, baseType: !155, size: 8, offset: 456)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "pending_deleted_expires_ms", scope: !94, file: !93, line: 244, baseType: !158, size: 64, offset: 512)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !159, line: 27, baseType: !160)
!159 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "649b383a60bfa3eb90e85840b2b0be20")
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !149, line: 44, baseType: !161)
!161 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !94, file: !93, line: 248, baseType: !163, size: 64, offset: 576)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "QDict", file: !98, line: 91, baseType: !165)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "QDict", file: !98, line: 91, flags: DIFlagFwdDecl)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "hotplugged", scope: !94, file: !93, line: 252, baseType: !167, size: 32, offset: 640)
!167 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "allow_unplug_during_migration", scope: !94, file: !93, line: 256, baseType: !155, size: 8, offset: 672)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "parent_bus", scope: !94, file: !93, line: 260, baseType: !170, size: 64, offset: 704)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "BusState", file: !98, line: 36, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BusState", file: !93, line: 378, size: 960, elements: !173)
!173 = !{!174, !175, !176, !177, !182, !183, !184, !185, !186, !220, !228}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !172, file: !93, line: 380, baseType: !97, size: 320)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !172, file: !93, line: 382, baseType: !91, size: 64, offset: 320)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !172, file: !93, line: 383, baseType: !152, size: 64, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "hotplug_handler", scope: !172, file: !93, line: 384, baseType: !178, size: 64, offset: 448)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "HotplugHandler", file: !180, line: 25, baseType: !181)
!180 = !DIFile(filename: "include/hw/hotplug.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "15267d9ba97c18564fc7d41a146ac8e8")
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "HotplugHandler", file: !180, line: 25, flags: DIFlagFwdDecl)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "max_index", scope: !172, file: !93, line: 385, baseType: !167, size: 32, offset: 512)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "realized", scope: !172, file: !93, line: 386, baseType: !155, size: 8, offset: 544)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !172, file: !93, line: 387, baseType: !155, size: 8, offset: 552)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "num_children", scope: !172, file: !93, line: 388, baseType: !167, size: 32, offset: 576)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !172, file: !93, line: 394, baseType: !187, size: 128, offset: 640)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "BusChildHead", file: !93, line: 364, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !93, line: 364, size: 128, elements: !189)
!189 = !{!190, !219}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !188, file: !93, line: 364, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BusChild", file: !93, line: 355, size: 384, elements: !193)
!193 = !{!194, !205, !206, !207}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !192, file: !93, line: 356, baseType: !195, size: 128)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcu_head", file: !196, line: 138, size: 128, elements: !197)
!196 = !DIFile(filename: "include/qemu/rcu.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "1fa5966fe8848bb59b99486d796e94fb")
!197 = !{!198, !200}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !195, file: !196, line: 139, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !195, file: !196, line: 140, baseType: !201, size: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCUCBFunc", file: !196, line: 136, baseType: !203)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !199}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !192, file: !93, line: 357, baseType: !91, size: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !192, file: !93, line: 358, baseType: !167, size: 32, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !192, file: !93, line: 359, baseType: !208, size: 128, offset: 256)
!208 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !192, file: !93, line: 359, size: 128, elements: !209)
!209 = !{!210, !211}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !208, file: !93, line: 359, baseType: !191, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_circ", scope: !208, file: !93, line: 359, baseType: !212, size: 128)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "QTailQLink", file: !213, line: 388, baseType: !214)
!213 = !DIFile(filename: "include/qemu/queue.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "037402447fe7017dc8313a983f6fbe7b")
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QTailQLink", file: !213, line: 385, size: 128, elements: !215)
!215 = !{!216, !217}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "tql_next", scope: !214, file: !213, line: 386, baseType: !120, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "tql_prev", scope: !214, file: !213, line: 387, baseType: !218, size: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_circ", scope: !188, file: !93, line: 364, baseType: !212, size: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !172, file: !93, line: 398, baseType: !221, size: 128, offset: 768)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "BusStateEntry", file: !93, line: 365, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !93, line: 365, size: 128, elements: !223)
!223 = !{!224, !226}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !222, file: !93, line: 365, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !222, file: !93, line: 365, baseType: !227, size: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !172, file: !93, line: 402, baseType: !229, size: 64, offset: 896)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResettableState", file: !230, line: 25, baseType: !231)
!230 = !DIFile(filename: "include/hw/resettable.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "f1271920a2d7d7b6d7542c3e61d6e416")
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ResettableState", file: !230, line: 141, size: 64, elements: !232)
!232 = !{!233, !234, !235}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !231, file: !230, line: 142, baseType: !31, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "hold_phase_pending", scope: !231, file: !230, line: 143, baseType: !155, size: 8, offset: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "exit_phase_in_progress", scope: !231, file: !230, line: 144, baseType: !155, size: 8, offset: 40)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "gpios", scope: !94, file: !93, line: 264, baseType: !237, size: 64, offset: 768)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "NamedGPIOListHead", file: !93, line: 210, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !93, line: 210, size: 64, elements: !239)
!239 = !{!240}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "lh_first", scope: !238, file: !93, line: 210, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NamedGPIOList", file: !93, line: 186, size: 320, elements: !243)
!243 = !{!244, !245, !260, !261, !262}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !242, file: !93, line: 187, baseType: !152, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !242, file: !93, line: 188, baseType: !246, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "qemu_irq", file: !98, line: 128, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IRQState", file: !250, line: 11, size: 512, elements: !251)
!250 = !DIFile(filename: "include/hw/irq.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "c3d3cf679636ee2dd93a459edfc5173a")
!251 = !{!252, !253, !258, !259}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "parent_obj", scope: !249, file: !250, line: 12, baseType: !97, size: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !249, file: !250, line: 14, baseType: !254, size: 64, offset: 320)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "qemu_irq_handler", file: !98, line: 133, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !120, !167, !167}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !249, file: !250, line: 15, baseType: !120, size: 64, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !249, file: !250, line: 16, baseType: !167, size: 32, offset: 448)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "num_in", scope: !242, file: !93, line: 189, baseType: !167, size: 32, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "num_out", scope: !242, file: !93, line: 190, baseType: !167, size: 32, offset: 160)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !242, file: !93, line: 191, baseType: !263, size: 128, offset: 192)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !242, file: !93, line: 191, size: 128, elements: !264)
!264 = !{!265, !266}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !263, file: !93, line: 191, baseType: !241, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !263, file: !93, line: 191, baseType: !267, size: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "clocks", scope: !94, file: !93, line: 268, baseType: !269, size: 64, offset: 832)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "NamedClockListHead", file: !93, line: 211, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !93, line: 211, size: 64, elements: !271)
!271 = !{!272}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "lh_first", scope: !270, file: !93, line: 211, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NamedClockList", file: !93, line: 197, size: 320, elements: !275)
!275 = !{!276, !277, !312, !313, !314}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !274, file: !93, line: 198, baseType: !152, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "clock", scope: !274, file: !93, line: 199, baseType: !278, size: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "Clock", file: !93, line: 194, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Clock", file: !30, line: 71, size: 960, elements: !281)
!281 = !{!282, !283, !287, !288, !294, !295, !296, !297, !298, !301, !306}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "parent_obj", scope: !280, file: !30, line: 73, baseType: !97, size: 320)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !280, file: !30, line: 78, baseType: !284, size: 64, offset: 320)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !147, line: 27, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !149, line: 45, baseType: !286)
!286 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "canonical_path", scope: !280, file: !30, line: 79, baseType: !152, size: 64, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !280, file: !30, line: 80, baseType: !289, size: 64, offset: 448)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClockCallback", file: !30, line: 36, baseType: !291)
!291 = !DISubroutineType(types: !292)
!292 = !{null, !120, !293}
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClockEvent", file: !30, line: 34, baseType: !29)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "callback_opaque", scope: !280, file: !30, line: 81, baseType: !120, size: 64, offset: 512)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "callback_events", scope: !280, file: !30, line: 82, baseType: !31, size: 32, offset: 576)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "multiplier", scope: !280, file: !30, line: 85, baseType: !146, size: 32, offset: 608)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "divider", scope: !280, file: !30, line: 86, baseType: !146, size: 32, offset: 640)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !280, file: !30, line: 89, baseType: !299, size: 64, offset: 704)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "Clock", file: !30, line: 23, baseType: !280)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !280, file: !30, line: 90, baseType: !302, size: 64, offset: 768)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !280, file: !30, line: 90, size: 64, elements: !303)
!303 = !{!304}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "lh_first", scope: !302, file: !30, line: 90, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !280, file: !30, line: 91, baseType: !307, size: 128, offset: 832)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !280, file: !30, line: 91, size: 128, elements: !308)
!308 = !{!309, !310}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !307, file: !30, line: 91, baseType: !305, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !307, file: !30, line: 91, baseType: !311, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !274, file: !93, line: 200, baseType: !155, size: 8, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !274, file: !93, line: 201, baseType: !155, size: 8, offset: 136)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !274, file: !93, line: 202, baseType: !315, size: 128, offset: 192)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !274, file: !93, line: 202, size: 128, elements: !316)
!316 = !{!317, !318}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !315, file: !93, line: 202, baseType: !273, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !315, file: !93, line: 202, baseType: !319, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "child_bus", scope: !94, file: !93, line: 272, baseType: !321, size: 64, offset: 896)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "BusStateHead", file: !93, line: 212, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !93, line: 212, size: 64, elements: !323)
!323 = !{!324}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "lh_first", scope: !322, file: !93, line: 212, baseType: !225, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "num_child_bus", scope: !94, file: !93, line: 276, baseType: !167, size: 32, offset: 960)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "instance_id_alias", scope: !94, file: !93, line: 280, baseType: !167, size: 32, offset: 992)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "alias_required_for_version", scope: !94, file: !93, line: 285, baseType: !167, size: 32, offset: 1024)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !94, file: !93, line: 289, baseType: !229, size: 64, offset: 1056)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "unplug_blockers", scope: !94, file: !93, line: 293, baseType: !112, size: 64, offset: 1152)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "mem_reentrancy_guard", scope: !94, file: !93, line: 299, baseType: !331, size: 8, offset: 1216)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemReentrancyGuard", file: !93, line: 207, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !93, line: 205, size: 8, elements: !333)
!333 = !{!334}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "engaged_in_io", scope: !332, file: !93, line: 206, baseType: !155, size: 8)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysBusDevice", file: !337, line: 19, baseType: !338)
!337 = !DIFile(filename: "include/hw/sysbus.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "67bb6e09f1ded079f625f3cd0bffdc2a")
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SysBusDevice", file: !337, line: 54, size: 6528, elements: !339)
!339 = !{!340, !341, !342, !483, !484}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "parent_obj", scope: !338, file: !337, line: 56, baseType: !92, size: 1280)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "num_mmio", scope: !338, file: !337, line: 59, baseType: !167, size: 32, offset: 1280)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "mmio", scope: !338, file: !337, line: 63, baseType: !343, size: 4096, offset: 1344)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 4096, elements: !481)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !338, file: !337, line: 60, size: 128, elements: !345)
!345 = !{!346, !349}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !344, file: !337, line: 61, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwaddr", file: !348, line: 11, baseType: !284)
!348 = !DIFile(filename: "include/exec/hwaddr.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "fa6f76ef63acb9da0cc99a3662166d11")
!349 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !344, file: !337, line: 62, baseType: !350, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemoryRegion", file: !98, line: 67, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MemoryRegion", file: !353, line: 755, size: 2176, elements: !354)
!353 = !DIFile(filename: "include/exec/memory.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "ac0603821d1f9b60fe091bb4fb80e29d")
!354 = !{!355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !368, !369, !373, !374, !375, !427, !428, !429, !430, !436, !437, !441, !442, !443, !444, !445, !446, !447, !448, !449, !452, !458, !463, !470, !471, !472, !476, !480}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "parent_obj", scope: !352, file: !353, line: 756, baseType: !97, size: 320)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "romd_mode", scope: !352, file: !353, line: 761, baseType: !155, size: 8, offset: 320)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ram", scope: !352, file: !353, line: 762, baseType: !155, size: 8, offset: 328)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "subpage", scope: !352, file: !353, line: 763, baseType: !155, size: 8, offset: 336)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !352, file: !353, line: 764, baseType: !155, size: 8, offset: 344)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "nonvolatile", scope: !352, file: !353, line: 765, baseType: !155, size: 8, offset: 352)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "rom_device", scope: !352, file: !353, line: 766, baseType: !155, size: 8, offset: 360)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "flush_coalesced_mmio", scope: !352, file: !353, line: 767, baseType: !155, size: 8, offset: 368)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "unmergeable", scope: !352, file: !353, line: 768, baseType: !155, size: 8, offset: 376)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_log_mask", scope: !352, file: !353, line: 769, baseType: !365, size: 8, offset: 384)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !147, line: 24, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !149, line: 38, baseType: !367)
!367 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "is_iommu", scope: !352, file: !353, line: 770, baseType: !155, size: 8, offset: 392)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ram_block", scope: !352, file: !353, line: 771, baseType: !370, size: 64, offset: 448)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAMBlock", file: !98, line: 108, baseType: !372)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "RAMBlock", file: !98, line: 108, flags: DIFlagFwdDecl)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !352, file: !353, line: 772, baseType: !133, size: 64, offset: 512)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !352, file: !353, line: 774, baseType: !91, size: 64, offset: 576)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !352, file: !353, line: 776, baseType: !376, size: 64, offset: 640)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemoryRegionOps", file: !353, line: 80, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MemoryRegionOps", file: !353, line: 264, size: 640, elements: !380)
!380 = !{!381, !385, !389, !406, !410, !411, !421}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !379, file: !353, line: 267, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!284, !120, !347, !31}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !379, file: !353, line: 272, baseType: !386, size: 64, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{null, !120, !347, !284, !31}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "read_with_attrs", scope: !379, file: !353, line: 277, baseType: !390, size: 64, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!393, !120, !347, !395, !31, !396}
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemTxResult", file: !394, line: 78, baseType: !146)
!394 = !DIFile(filename: "include/exec/memattrs.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "9b6ae885d22d69d08ca00517d6823a7a")
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemTxAttrs", file: !394, line: 60, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MemTxAttrs", file: !394, line: 25, size: 32, elements: !398)
!398 = !{!399, !400, !401, !402, !403, !404, !405}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "unspecified", scope: !397, file: !394, line: 31, baseType: !31, size: 1, flags: DIFlagBitField, extraData: i64 0)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "secure", scope: !397, file: !394, line: 36, baseType: !31, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !397, file: !394, line: 42, baseType: !31, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !397, file: !394, line: 44, baseType: !31, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !397, file: !394, line: 52, baseType: !31, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "requester_id", scope: !397, file: !394, line: 54, baseType: !31, size: 16, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !397, file: !394, line: 59, baseType: !31, size: 8, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "write_with_attrs", scope: !379, file: !353, line: 282, baseType: !407, size: 64, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!393, !120, !347, !284, !31, !396}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "endianness", scope: !379, file: !353, line: 288, baseType: !43, size: 32, offset: 256)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !379, file: !353, line: 308, baseType: !412, size: 192, offset: 320)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !379, file: !353, line: 290, size: 192, elements: !413)
!413 = !{!414, !415, !416, !417}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "min_access_size", scope: !412, file: !353, line: 294, baseType: !31, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "max_access_size", scope: !412, file: !353, line: 295, baseType: !31, size: 32, offset: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "unaligned", scope: !412, file: !353, line: 299, baseType: !155, size: 8, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "accepts", scope: !412, file: !353, line: 305, baseType: !418, size: 64, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!155, !120, !347, !31, !155, !396}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !379, file: !353, line: 323, baseType: !422, size: 96, offset: 512)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !379, file: !353, line: 310, size: 96, elements: !423)
!423 = !{!424, !425, !426}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "min_access_size", scope: !422, file: !353, line: 314, baseType: !31, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "max_access_size", scope: !422, file: !353, line: 318, baseType: !31, size: 32, offset: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "unaligned", scope: !422, file: !353, line: 322, baseType: !155, size: 8, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !352, file: !353, line: 777, baseType: !120, size: 64, offset: 704)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "container", scope: !352, file: !353, line: 778, baseType: !350, size: 64, offset: 768)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "mapped_via_alias", scope: !352, file: !353, line: 779, baseType: !167, size: 32, offset: 832)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !352, file: !353, line: 780, baseType: !431, size: 128, offset: 896)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "Int128", file: !432, line: 12, baseType: !433)
!432 = !DIFile(filename: "include/qemu/int128.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "5836b066b8c746f64a01476985ac72dd")
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int128_t", file: !434, baseType: !435)
!434 = !DIFile(filename: "../hw/char/pl011.c", directory: "/home/snoora/qemu/build")
!435 = !DIBasicType(name: "__int128", size: 128, encoding: DW_ATE_signed)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !352, file: !353, line: 781, baseType: !347, size: 64, offset: 1024)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !352, file: !353, line: 782, baseType: !438, size: 64, offset: 1088)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{null, !350}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !352, file: !353, line: 783, baseType: !284, size: 64, offset: 1152)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "terminates", scope: !352, file: !353, line: 784, baseType: !155, size: 8, offset: 1216)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ram_device", scope: !352, file: !353, line: 785, baseType: !155, size: 8, offset: 1224)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !352, file: !353, line: 786, baseType: !155, size: 8, offset: 1232)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "warning_printed", scope: !352, file: !353, line: 787, baseType: !155, size: 8, offset: 1240)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "vga_logging_count", scope: !352, file: !353, line: 788, baseType: !365, size: 8, offset: 1248)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !352, file: !353, line: 789, baseType: !350, size: 64, offset: 1280)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "alias_offset", scope: !352, file: !353, line: 790, baseType: !347, size: 64, offset: 1344)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !352, file: !353, line: 791, baseType: !450, size: 32, offset: 1408)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !159, line: 26, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !149, line: 41, baseType: !167)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "subregions", scope: !352, file: !353, line: 792, baseType: !453, size: 128, offset: 1472)
!453 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !352, file: !353, line: 792, size: 128, elements: !454)
!454 = !{!455, !457}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !453, file: !353, line: 792, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_circ", scope: !453, file: !353, line: 792, baseType: !212, size: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "subregions_link", scope: !352, file: !353, line: 793, baseType: !459, size: 128, offset: 1600)
!459 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !352, file: !353, line: 793, size: 128, elements: !460)
!460 = !{!461, !462}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !459, file: !353, line: 793, baseType: !456, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_circ", scope: !459, file: !353, line: 793, baseType: !212, size: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "coalesced", scope: !352, file: !353, line: 794, baseType: !464, size: 128, offset: 1728)
!464 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !352, file: !353, line: 794, size: 128, elements: !465)
!465 = !{!466, !469}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !464, file: !353, line: 794, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "CoalescedMemoryRange", file: !353, line: 748, flags: DIFlagFwdDecl)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_circ", scope: !464, file: !353, line: 794, baseType: !212, size: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !352, file: !353, line: 795, baseType: !124, size: 64, offset: 1856)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ioeventfd_nb", scope: !352, file: !353, line: 796, baseType: !31, size: 32, offset: 1920)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ioeventfds", scope: !352, file: !353, line: 797, baseType: !473, size: 64, offset: 1984)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemoryRegionIoeventfd", file: !353, line: 749, baseType: !475)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemoryRegionIoeventfd", file: !353, line: 749, flags: DIFlagFwdDecl)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "rdm", scope: !352, file: !353, line: 798, baseType: !477, size: 64, offset: 2048)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "RamDiscardManager", file: !353, line: 48, baseType: !479)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "RamDiscardManager", file: !353, line: 48, flags: DIFlagFwdDecl)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "disable_reentrancy_guard", scope: !352, file: !353, line: 801, baseType: !155, size: 8, offset: 2112)
!481 = !{!482}
!482 = !DISubrange(count: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "num_pio", scope: !338, file: !337, line: 64, baseType: !167, size: 32, offset: 5440)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "pio", scope: !338, file: !337, line: 65, baseType: !485, size: 1024, offset: 5472)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 1024, elements: !481)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "PL011State", file: !488, line: 23, baseType: !489)
!488 = !DIFile(filename: "include/hw/char/pl011.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "767b16b0ab40234df158d265ad90194a")
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PL011State", file: !488, line: 31, size: 10752, elements: !490)
!490 = !{!491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !504, !505, !506, !507, !508, !509, !510, !511, !670, !672, !673, !674}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "parent_obj", scope: !489, file: !488, line: 32, baseType: !336, size: 6528)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "iomem", scope: !489, file: !488, line: 34, baseType: !351, size: 2176, offset: 6528)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !489, file: !488, line: 35, baseType: !146, size: 32, offset: 8704)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "lcr", scope: !489, file: !488, line: 36, baseType: !146, size: 32, offset: 8736)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "rsr", scope: !489, file: !488, line: 37, baseType: !146, size: 32, offset: 8768)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "cr", scope: !489, file: !488, line: 38, baseType: !146, size: 32, offset: 8800)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "dmacr", scope: !489, file: !488, line: 39, baseType: !146, size: 32, offset: 8832)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "int_enabled", scope: !489, file: !488, line: 40, baseType: !146, size: 32, offset: 8864)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "int_level", scope: !489, file: !488, line: 41, baseType: !146, size: 32, offset: 8896)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "read_fifo", scope: !489, file: !488, line: 42, baseType: !501, size: 512, offset: 8928)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 512, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 16)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ilpr", scope: !489, file: !488, line: 43, baseType: !146, size: 32, offset: 9440)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ibrd", scope: !489, file: !488, line: 44, baseType: !146, size: 32, offset: 9472)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "fbrd", scope: !489, file: !488, line: 45, baseType: !146, size: 32, offset: 9504)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ifl", scope: !489, file: !488, line: 46, baseType: !146, size: 32, offset: 9536)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !489, file: !488, line: 47, baseType: !167, size: 32, offset: 9568)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "read_count", scope: !489, file: !488, line: 48, baseType: !167, size: 32, offset: 9600)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "read_trigger", scope: !489, file: !488, line: 49, baseType: !167, size: 32, offset: 9632)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "chr", scope: !489, file: !488, line: 50, baseType: !512, size: 448, offset: 9664)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "CharBackend", file: !36, line: 18, baseType: !513)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CharBackend", file: !514, line: 16, size: 448, elements: !515)
!514 = !DIFile(filename: "include/chardev/char-fe.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "9dddb80b5b168fe6ec2b8d247376d6d6")
!515 = !{!516, !645, !651, !657, !664, !667, !668, !669}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "chr", scope: !513, file: !514, line: 17, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "Chardev", file: !36, line: 231, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Chardev", file: !36, line: 59, size: 1216, elements: !520)
!520 = !{!521, !522, !558, !560, !561, !562, !563, !564, !565, !640, !641}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "parent_obj", scope: !519, file: !36, line: 60, baseType: !97, size: 320)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "chr_write_lock", scope: !519, file: !36, line: 62, baseType: !523, size: 384, offset: 320)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "QemuMutex", file: !98, line: 96, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QemuMutex", file: !525, line: 7, size: 384, elements: !526)
!525 = !DIFile(filename: "include/qemu/thread-posix.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "eb5e3430f50059c014e844d2f733c882")
!526 = !{!527, !557}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !524, file: !525, line: 8, baseType: !528, size: 320)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !529, line: 72, baseType: !530)
!529 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "8a5acdbeec491eca11cf81cb1ef77ea7")
!530 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 67, size: 320, elements: !531)
!531 = !{!532, !552, !556}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !530, file: !529, line: 69, baseType: !533, size: 320)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !534, line: 22, size: 320, elements: !535)
!534 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "6b075eca9ab0e2d761b2afc4ecfab776")
!535 = !{!536, !537, !538, !539, !540, !541, !543, !544}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !533, file: !534, line: 24, baseType: !167, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !533, file: !534, line: 25, baseType: !31, size: 32, offset: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !533, file: !534, line: 26, baseType: !167, size: 32, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !533, file: !534, line: 28, baseType: !31, size: 32, offset: 96)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !533, file: !534, line: 32, baseType: !167, size: 32, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !533, file: !534, line: 34, baseType: !542, size: 16, offset: 160)
!542 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !533, file: !534, line: 35, baseType: !542, size: 16, offset: 176)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !533, file: !534, line: 36, baseType: !545, size: 128, offset: 192)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !546, line: 55, baseType: !547)
!546 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "b9a7199822bce372686baacd32a9f4f3")
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !546, line: 51, size: 128, elements: !548)
!548 = !{!549, !551}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !547, file: !546, line: 53, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !547, file: !546, line: 54, baseType: !550, size: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !530, file: !529, line: 70, baseType: !553, size: 320)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 320, elements: !554)
!554 = !{!555}
!555 = !DISubrange(count: 40)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !530, file: !529, line: 71, baseType: !161, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !524, file: !525, line: 13, baseType: !155, size: 8, offset: 320)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "be", scope: !519, file: !36, line: 63, baseType: !559, size: 64, offset: 704)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !519, file: !36, line: 64, baseType: !152, size: 64, offset: 768)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !519, file: !36, line: 65, baseType: !152, size: 64, offset: 832)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "logfd", scope: !519, file: !36, line: 66, baseType: !167, size: 32, offset: 896)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "be_open", scope: !519, file: !36, line: 67, baseType: !167, size: 32, offset: 928)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "handover_yank_instance", scope: !519, file: !36, line: 69, baseType: !155, size: 8, offset: 960)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "gsource", scope: !519, file: !36, line: 70, baseType: !566, size: 64, offset: 1024)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !568, line: 86, baseType: !569)
!568 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "", checksumkind: CSK_MD5, checksum: "ad7e9a6795d752bf397c813cc98310f6")
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !568, line: 261, size: 768, elements: !570)
!570 = !{!571, !572, !594, !623, !625, !629, !630, !631, !632, !633, !634, !635, !636}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !569, file: !568, line: 264, baseType: !118, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !569, file: !568, line: 265, baseType: !573, size: 64, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !568, line: 99, baseType: !575)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !568, line: 286, size: 192, elements: !576)
!576 = !{!577, !581, !582}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !575, file: !568, line: 288, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{null, !118}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !575, file: !568, line: 289, baseType: !578, size: 64, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !575, file: !568, line: 290, baseType: !583, size: 64, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{null, !118, !566, !586, !593}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !568, line: 195, baseType: !588)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!591, !118}
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !119, line: 56, baseType: !592)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !119, line: 55, baseType: !167)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !569, file: !568, line: 267, baseType: !595, size: 64, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !597)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !568, line: 155, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !568, line: 304, size: 384, elements: !599)
!599 = !{!600, !605, !609, !613, !617, !618}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !598, file: !568, line: 306, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!591, !566, !604}
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !598, file: !568, line: 308, baseType: !606, size: 64, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{!591, !566}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !598, file: !568, line: 309, baseType: !610, size: 64, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!591, !566, !587, !118}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !598, file: !568, line: 312, baseType: !614, size: 64, offset: 192)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{null, !566}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !598, file: !568, line: 316, baseType: !587, size: 64, offset: 256)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !598, file: !568, line: 317, baseType: !619, size: 64, offset: 320)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !568, line: 302, baseType: !620)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{null}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !569, file: !568, line: 268, baseType: !624, size: 32, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !119, line: 61, baseType: !31)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !569, file: !568, line: 270, baseType: !626, size: 64, offset: 256)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !568, line: 70, baseType: !628)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !568, line: 70, flags: DIFlagFwdDecl)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !569, file: !568, line: 272, baseType: !592, size: 32, offset: 320)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !569, file: !568, line: 273, baseType: !624, size: 32, offset: 352)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !569, file: !568, line: 274, baseType: !624, size: 32, offset: 384)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !569, file: !568, line: 276, baseType: !112, size: 64, offset: 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !569, file: !568, line: 278, baseType: !566, size: 64, offset: 512)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !569, file: !568, line: 279, baseType: !566, size: 64, offset: 576)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !569, file: !568, line: 281, baseType: !152, size: 64, offset: 640)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !569, file: !568, line: 283, baseType: !637, size: 64, offset: 704)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !568, line: 87, baseType: !639)
!639 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !568, line: 87, flags: DIFlagFwdDecl)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "gcontext", scope: !519, file: !36, line: 71, baseType: !626, size: 64, offset: 1088)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !519, file: !36, line: 72, baseType: !642, size: 64, offset: 1152)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 64, elements: !643)
!643 = !{!644}
!644 = !DISubrange(count: 1)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "chr_event", scope: !513, file: !514, line: 18, baseType: !646, size: 64, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "IOEventHandler", file: !514, line: 7, baseType: !648)
!648 = !DISubroutineType(types: !649)
!649 = !{null, !120, !650}
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "QEMUChrEvent", file: !36, line: 35, baseType: !35)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "chr_can_read", scope: !513, file: !514, line: 19, baseType: !652, size: 64, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "IOCanReadHandler", file: !654, line: 197, baseType: !655)
!654 = !DIFile(filename: "include/qemu/main-loop.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "6bb0fb053e7fae5cab70e61b72f7650e")
!655 = !DISubroutineType(types: !656)
!656 = !{!167, !120}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "chr_read", scope: !513, file: !514, line: 20, baseType: !658, size: 64, offset: 192)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "IOReadHandler", file: !654, line: 182, baseType: !660)
!660 = !DISubroutineType(types: !661)
!661 = !{null, !120, !662, !167}
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !365)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "chr_be_change", scope: !513, file: !514, line: 21, baseType: !665, size: 64, offset: 256)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "BackendChangeHandler", file: !514, line: 8, baseType: !655)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !513, file: !514, line: 22, baseType: !120, size: 64, offset: 320)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !513, file: !514, line: 23, baseType: !31, size: 32, offset: 384)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "fe_is_open", scope: !513, file: !514, line: 24, baseType: !155, size: 8, offset: 416)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !489, file: !488, line: 51, baseType: !671, size: 384, offset: 10112)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 384, elements: !6)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "clk", scope: !489, file: !488, line: 52, baseType: !278, size: 64, offset: 10496)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "migrate_clk", scope: !489, file: !488, line: 53, baseType: !155, size: 8, offset: 10560)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !489, file: !488, line: 54, baseType: !675, size: 64, offset: 10624)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !367)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !678, line: 46, baseType: !286)
!678 = !DIFile(filename: "linuxbrew/.linuxbrew/Cellar/llvm@16/16.0.6_1/lib/clang/16/include/stddef.h", directory: "/home", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "DeviceClass", file: !93, line: 77, baseType: !681)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DeviceClass", file: !93, line: 114, size: 1472, elements: !682)
!682 = !{!683, !684, !685, !686, !687, !788, !789, !790, !795, !800, !802, !807, !879}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "parent_class", scope: !681, file: !93, line: 116, baseType: !104, size: 768)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "categories", scope: !681, file: !93, line: 123, baseType: !642, size: 64, offset: 768)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "fw_name", scope: !681, file: !93, line: 127, baseType: !124, size: 64, offset: 832)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !681, file: !93, line: 131, baseType: !124, size: 64, offset: 896)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "props_", scope: !681, file: !93, line: 139, baseType: !688, size: 64, offset: 960)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !690)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "Property", file: !98, line: 88, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Property", file: !692, line: 15, size: 704, elements: !693)
!692 = !DIFile(filename: "include/hw/qdev-properties.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "10ae8de04a0435513a66a554d29e54ac")
!693 = !{!694, !695, !774, !776, !777, !778, !779, !784, !785, !786, !787}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !691, file: !692, line: 16, baseType: !124, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !691, file: !692, line: 17, baseType: !696, size: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !698)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyInfo", file: !98, line: 89, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyInfo", file: !692, line: 32, size: 640, elements: !700)
!700 = !{!701, !702, !703, !717, !718, !723, !767, !771, !772, !773}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !699, file: !692, line: 33, baseType: !124, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !699, file: !692, line: 34, baseType: !124, size: 64, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "enum_table", scope: !699, file: !692, line: 35, baseType: !704, size: 64, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !706)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "QEnumLookup", file: !707, line: 23, baseType: !708)
!707 = !DIFile(filename: "include/qapi/util.h", directory: "/home/snoora/qemu", checksumkind: CSK_MD5, checksum: "75e869cdc12f3071edfdd31fe0065a9e")
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QEnumLookup", file: !707, line: 19, size: 192, elements: !709)
!709 = !{!710, !713, !715}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !708, file: !707, line: 20, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !124)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "special_features", scope: !708, file: !707, line: 21, baseType: !714, size: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !675)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !708, file: !707, line: 22, baseType: !716, size: 32, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "realized_set_allowed", scope: !699, file: !692, line: 36, baseType: !155, size: 8, offset: 192)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !699, file: !692, line: 37, baseType: !719, size: 64, offset: 256)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!167, !133, !722, !152, !677}
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "set_default_value", scope: !699, file: !692, line: 38, baseType: !724, size: 64, offset: 320)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{null, !727, !688}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectProperty", file: !100, line: 30, baseType: !729)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectProperty", file: !100, line: 88, size: 640, elements: !730)
!730 = !{!731, !732, !733, !734, !746, !747, !752, !757, !762, !763}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !729, file: !100, line: 90, baseType: !152, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !729, file: !100, line: 91, baseType: !152, size: 64, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !729, file: !100, line: 92, baseType: !152, size: 64, offset: 128)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !729, file: !100, line: 93, baseType: !735, size: 64, offset: 192)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectPropertyAccessor", file: !100, line: 42, baseType: !737)
!737 = !DISubroutineType(types: !738)
!738 = !{null, !133, !739, !124, !120, !742}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "Visitor", file: !98, line: 118, baseType: !741)
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "Visitor", file: !98, line: 118, flags: DIFlagFwdDecl)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "Error", file: !98, line: 50, baseType: !745)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", file: !98, line: 50, flags: DIFlagFwdDecl)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !729, file: !100, line: 94, baseType: !735, size: 64, offset: 256)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "resolve", scope: !729, file: !100, line: 95, baseType: !748, size: 64, offset: 320)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectPropertyResolve", file: !100, line: 63, baseType: !750)
!750 = !DISubroutineType(types: !751)
!751 = !{!133, !133, !120, !124}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !729, file: !100, line: 96, baseType: !753, size: 64, offset: 384)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectPropertyRelease", file: !100, line: 75, baseType: !755)
!755 = !DISubroutineType(types: !756)
!756 = !{null, !133, !124, !120}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !729, file: !100, line: 97, baseType: !758, size: 64, offset: 448)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectPropertyInit", file: !100, line: 86, baseType: !760)
!760 = !DISubroutineType(types: !761)
!761 = !{null, !133, !727}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !729, file: !100, line: 98, baseType: !120, size: 64, offset: 512)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "defval", scope: !729, file: !100, line: 99, baseType: !764, size: 64, offset: 576)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "QObject", file: !98, line: 106, baseType: !766)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "QObject", file: !98, line: 106, flags: DIFlagFwdDecl)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !699, file: !692, line: 39, baseType: !768, size: 64, offset: 384)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!727, !103, !124, !688}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !699, file: !692, line: 41, baseType: !735, size: 64, offset: 448)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !699, file: !692, line: 42, baseType: !735, size: 64, offset: 512)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !699, file: !692, line: 43, baseType: !753, size: 64, offset: 576)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !691, file: !692, line: 18, baseType: !775, size: 64, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !678, line: 35, baseType: !161)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "bitnr", scope: !691, file: !692, line: 19, baseType: !365, size: 8, offset: 192)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "bitmask", scope: !691, file: !692, line: 20, baseType: !284, size: 64, offset: 256)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "set_default", scope: !691, file: !692, line: 21, baseType: !155, size: 8, offset: 320)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "defval", scope: !691, file: !692, line: 25, baseType: !780, size: 64, offset: 384)
!780 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !691, file: !692, line: 22, size: 64, elements: !781)
!781 = !{!782, !783}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !780, file: !692, line: 23, baseType: !158, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !780, file: !692, line: 24, baseType: !284, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "arrayoffset", scope: !691, file: !692, line: 26, baseType: !167, size: 32, offset: 448)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "arrayinfo", scope: !691, file: !692, line: 27, baseType: !696, size: 64, offset: 512)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "arrayfieldsize", scope: !691, file: !692, line: 28, baseType: !167, size: 32, offset: 576)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "link_type", scope: !691, file: !692, line: 29, baseType: !124, size: 64, offset: 640)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "user_creatable", scope: !681, file: !93, line: 154, baseType: !155, size: 8, offset: 1024)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "hotpluggable", scope: !681, file: !93, line: 155, baseType: !155, size: 8, offset: 1032)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "legacy_reset", scope: !681, file: !93, line: 166, baseType: !791, size: 64, offset: 1088)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "DeviceReset", file: !93, line: 95, baseType: !792)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{null, !91}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "realize", scope: !681, file: !93, line: 167, baseType: !796, size: 64, offset: 1152)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "DeviceRealize", file: !93, line: 93, baseType: !797)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{null, !91, !742}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "unrealize", scope: !681, file: !93, line: 168, baseType: !801, size: 64, offset: 1216)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "DeviceUnrealize", file: !93, line: 94, baseType: !792)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "sync_config", scope: !681, file: !93, line: 169, baseType: !803, size: 64, offset: 1280)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "DeviceSyncConfig", file: !93, line: 98, baseType: !804)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!167, !91, !742}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "vmsd", scope: !681, file: !93, line: 175, baseType: !808, size: 64, offset: 1344)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !810)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "VMStateDescription", file: !98, line: 120, baseType: !811)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VMStateDescription", file: !62, line: 184, size: 704, elements: !812)
!812 = !{!813, !814, !815, !816, !817, !818, !820, !822, !826, !827, !828, !832, !833, !876}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !811, file: !62, line: 185, baseType: !124, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "unmigratable", scope: !811, file: !62, line: 186, baseType: !155, size: 8, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "early_setup", scope: !811, file: !62, line: 200, baseType: !155, size: 8, offset: 72)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "version_id", scope: !811, file: !62, line: 201, baseType: !167, size: 32, offset: 96)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_version_id", scope: !811, file: !62, line: 202, baseType: !167, size: 32, offset: 128)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !811, file: !62, line: 203, baseType: !819, size: 32, offset: 160)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "MigrationPriority", file: !62, line: 165, baseType: !61)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "pre_load", scope: !811, file: !62, line: 204, baseType: !821, size: 64, offset: 192)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "post_load", scope: !811, file: !62, line: 205, baseType: !823, size: 64, offset: 256)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{!167, !120, !167}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "pre_save", scope: !811, file: !62, line: 206, baseType: !821, size: 64, offset: 320)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "post_save", scope: !811, file: !62, line: 207, baseType: !821, size: 64, offset: 384)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "needed", scope: !811, file: !62, line: 208, baseType: !829, size: 64, offset: 448)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{!155, !120}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "dev_unplug_pending", scope: !811, file: !62, line: 209, baseType: !829, size: 64, offset: 512)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !811, file: !62, line: 211, baseType: !834, size: 64, offset: 576)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !836)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "VMStateField", file: !62, line: 33, baseType: !837)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VMStateField", file: !62, line: 167, size: 832, elements: !838)
!838 = !{!839, !840, !841, !842, !843, !844, !845, !846, !847, !868, !869, !870, !871, !872}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !837, file: !62, line: 168, baseType: !124, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "err_hint", scope: !837, file: !62, line: 169, baseType: !124, size: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !837, file: !62, line: 170, baseType: !677, size: 64, offset: 128)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !837, file: !62, line: 171, baseType: !677, size: 64, offset: 192)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !837, file: !62, line: 172, baseType: !677, size: 64, offset: 256)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !837, file: !62, line: 173, baseType: !167, size: 32, offset: 320)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "num_offset", scope: !837, file: !62, line: 174, baseType: !677, size: 64, offset: 384)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "size_offset", scope: !837, file: !62, line: 175, baseType: !677, size: 64, offset: 448)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !837, file: !62, line: 176, baseType: !848, size: 64, offset: 512)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !850)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "VMStateInfo", file: !62, line: 32, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VMStateInfo", file: !62, line: 42, size: 192, elements: !852)
!852 = !{!853, !854, !861}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !851, file: !62, line: 43, baseType: !124, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !851, file: !62, line: 44, baseType: !855, size: 64, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!167, !858, !120, !677, !834}
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "QEMUFile", file: !98, line: 95, baseType: !860)
!860 = !DICompositeType(tag: DW_TAG_structure_type, name: "QEMUFile", file: !98, line: 95, flags: DIFlagFwdDecl)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "put", scope: !851, file: !62, line: 46, baseType: !862, size: 64, offset: 128)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DISubroutineType(types: !864)
!864 = !{!167, !858, !120, !677, !834, !865}
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSONWriter", file: !98, line: 61, baseType: !867)
!867 = !DICompositeType(tag: DW_TAG_structure_type, name: "JSONWriter", file: !98, line: 61, flags: DIFlagFwdDecl)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !837, file: !62, line: 177, baseType: !71, size: 32, offset: 576)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "vmsd", scope: !837, file: !62, line: 178, baseType: !808, size: 64, offset: 640)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "version_id", scope: !837, file: !62, line: 179, baseType: !167, size: 32, offset: 704)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "struct_version_id", scope: !837, file: !62, line: 180, baseType: !167, size: 32, offset: 736)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "field_exists", scope: !837, file: !62, line: 181, baseType: !873, size: 64, offset: 768)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{!155, !120, !167}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "subsections", scope: !811, file: !62, line: 212, baseType: !877, size: 64, offset: 640)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !808)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "bus_type", scope: !681, file: !93, line: 181, baseType: !124, size: 64, offset: 1408)
!880 = !{!0, !8, !13, !15, !20, !881, !883, !888, !893, !895, !923, !926, !931, !933, !935, !937, !942, !944, !950, !955, !960, !965, !970, !975, !980, !985, !990, !994, !996, !998, !1000, !1002, !1007, !1009, !1014, !1019, !1021, !1023, !1025, !1027, !1029, !1034, !1039, !1041, !1043, !1045, !1047, !1049, !1052, !1054, !1056, !25, !1059, !1064, !1069, !1074, !1079, !1084, !1086, !1088, !1090, !1092, !1094, !1096, !1098, !1100, !1102, !1104, !1106, !1108, !1110, !1112, !1123, !1125, !1127, !1132, !1134, !1139, !1144, !1149, !1152, !1157}
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(scope: null, file: !2, line: 732, type: !3, isLocal: true, isDefinition: true)
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(scope: null, file: !337, line: 19, type: !885, isLocal: true, isDefinition: true)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !886)
!886 = !{!887}
!887 = !DISubrange(count: 15)
!888 = !DIGlobalVariableExpression(var: !889, expr: !DIExpression())
!889 = distinct !DIGlobalVariable(scope: null, file: !337, line: 19, type: !890, isLocal: true, isDefinition: true)
!890 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !891)
!891 = !{!892}
!892 = !DISubrange(count: 38)
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(scope: null, file: !337, line: 19, type: !885, isLocal: true, isDefinition: true)
!895 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression())
!896 = distinct !DIGlobalVariable(name: "pl011_arm_info", scope: !27, file: !2, line: 671, type: !897, isLocal: true, isDefinition: true)
!897 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !898)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "TypeInfo", file: !100, line: 23, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TypeInfo", file: !100, line: 474, size: 832, elements: !900)
!900 = !{!901, !902, !903, !904, !905, !907, !908, !909, !910, !911, !915, !916, !917}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !899, file: !100, line: 476, baseType: !124, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !899, file: !100, line: 477, baseType: !124, size: 64, offset: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "instance_size", scope: !899, file: !100, line: 479, baseType: !677, size: 64, offset: 128)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "instance_align", scope: !899, file: !100, line: 480, baseType: !677, size: 64, offset: 192)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "instance_init", scope: !899, file: !100, line: 481, baseType: !906, size: 64, offset: 256)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "instance_post_init", scope: !899, file: !100, line: 482, baseType: !906, size: 64, offset: 320)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "instance_finalize", scope: !899, file: !100, line: 483, baseType: !906, size: 64, offset: 384)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "abstract", scope: !899, file: !100, line: 485, baseType: !155, size: 8, offset: 448)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "class_size", scope: !899, file: !100, line: 486, baseType: !677, size: 64, offset: 512)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "class_init", scope: !899, file: !100, line: 488, baseType: !912, size: 64, offset: 576)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{null, !103, !120}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "class_base_init", scope: !899, file: !100, line: 489, baseType: !912, size: 64, offset: 640)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "class_data", scope: !899, file: !100, line: 490, baseType: !120, size: 64, offset: 704)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "interfaces", scope: !899, file: !100, line: 492, baseType: !918, size: 64, offset: 768)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterfaceInfo", file: !100, line: 26, baseType: !920)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "InterfaceInfo", file: !100, line: 565, size: 64, elements: !921)
!921 = !{!922}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !920, file: !100, line: 566, baseType: !124, size: 64)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(scope: null, file: !2, line: 627, type: !925, isLocal: true, isDefinition: true)
!925 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !125)
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(scope: null, file: !488, line: 23, type: !928, isLocal: true, isDefinition: true)
!928 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !929)
!929 = !{!930}
!930 = !DISubrange(count: 42)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(scope: null, file: !488, line: 23, type: !3, isLocal: true, isDefinition: true)
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(name: "pl011_ops", scope: !27, file: !2, line: 526, type: !377, isLocal: true, isDefinition: true)
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(scope: null, file: !93, line: 77, type: !17, isLocal: true, isDefinition: true)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(scope: null, file: !93, line: 77, type: !939, isLocal: true, isDefinition: true)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !940)
!940 = !{!941}
!941 = !DISubrange(count: 41)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(scope: null, file: !93, line: 77, type: !17, isLocal: true, isDefinition: true)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(scope: null, file: !946, line: 63, type: !947, isLocal: true, isDefinition: true)
!946 = !DIFile(filename: "../hw/char/trace-events", directory: "/home/snoora/qemu/build")
!947 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 680, elements: !948)
!948 = !{!949}
!949 = !DISubrange(count: 85)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(scope: null, file: !946, line: 63, type: !952, isLocal: true, isDefinition: true)
!952 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 576, elements: !953)
!953 = !{!954}
!954 = !DISubrange(count: 72)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(scope: null, file: !93, line: 77, type: !957, isLocal: true, isDefinition: true)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !958)
!958 = !{!959}
!959 = !DISubrange(count: 13)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(scope: null, file: !946, line: 61, type: !962, isLocal: true, isDefinition: true)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 528, elements: !963)
!963 = !{!964}
!964 = !DISubrange(count: 66)
!965 = !DIGlobalVariableExpression(var: !966, expr: !DIExpression())
!966 = distinct !DIGlobalVariable(scope: null, file: !946, line: 61, type: !967, isLocal: true, isDefinition: true)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 424, elements: !968)
!968 = !{!969}
!969 = !DISubrange(count: 53)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(scope: null, file: !946, line: 62, type: !972, isLocal: true, isDefinition: true)
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !973)
!973 = !{!974}
!974 = !DISubrange(count: 60)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(scope: null, file: !946, line: 62, type: !977, isLocal: true, isDefinition: true)
!977 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !978)
!978 = !{!979}
!979 = !DISubrange(count: 47)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(scope: null, file: !946, line: 56, type: !982, isLocal: true, isDefinition: true)
!982 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !983)
!983 = !{!984}
!984 = !DISubrange(count: 43)
!985 = !DIGlobalVariableExpression(var: !986, expr: !DIExpression())
!986 = distinct !DIGlobalVariable(scope: null, file: !946, line: 56, type: !987, isLocal: true, isDefinition: true)
!987 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !988)
!988 = !{!989}
!989 = !DISubrange(count: 30)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(name: "irqmask", scope: !27, file: !2, line: 122, type: !992, isLocal: true, isDefinition: true)
!992 = !DICompositeType(tag: DW_TAG_array_type, baseType: !993, size: 192, elements: !6)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(scope: null, file: !2, line: 585, type: !17, isLocal: true, isDefinition: true)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(scope: null, file: !2, line: 586, type: !3, isLocal: true, isDefinition: true)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(scope: null, file: !2, line: 587, type: !925, isLocal: true, isDefinition: true)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(scope: null, file: !2, line: 588, type: !925, isLocal: true, isDefinition: true)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(scope: null, file: !2, line: 589, type: !1004, isLocal: true, isDefinition: true)
!1004 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !1005)
!1005 = !{!1006}
!1006 = !DISubrange(count: 3)
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(scope: null, file: !2, line: 590, type: !3, isLocal: true, isDefinition: true)
!1009 = !DIGlobalVariableExpression(var: !1010, expr: !DIExpression())
!1010 = distinct !DIGlobalVariable(scope: null, file: !2, line: 591, type: !1011, isLocal: true, isDefinition: true)
!1011 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !1012)
!1012 = !{!1013}
!1013 = !DISubrange(count: 12)
!1014 = !DIGlobalVariableExpression(var: !1015, expr: !DIExpression())
!1015 = distinct !DIGlobalVariable(scope: null, file: !2, line: 592, type: !1016, isLocal: true, isDefinition: true)
!1016 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !1017)
!1017 = !{!1018}
!1018 = !DISubrange(count: 10)
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(scope: null, file: !2, line: 593, type: !1016, isLocal: true, isDefinition: true)
!1021 = !DIGlobalVariableExpression(var: !1022, expr: !DIExpression())
!1022 = distinct !DIGlobalVariable(scope: null, file: !2, line: 594, type: !22, isLocal: true, isDefinition: true)
!1023 = !DIGlobalVariableExpression(var: !1024, expr: !DIExpression())
!1024 = distinct !DIGlobalVariable(scope: null, file: !2, line: 595, type: !22, isLocal: true, isDefinition: true)
!1025 = !DIGlobalVariableExpression(var: !1026, expr: !DIExpression())
!1026 = distinct !DIGlobalVariable(scope: null, file: !2, line: 596, type: !22, isLocal: true, isDefinition: true)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(scope: null, file: !2, line: 597, type: !925, isLocal: true, isDefinition: true)
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
!1030 = distinct !DIGlobalVariable(scope: null, file: !2, line: 598, type: !1031, isLocal: true, isDefinition: true)
!1031 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !1032)
!1032 = !{!1033}
!1033 = !DISubrange(count: 9)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(scope: null, file: !2, line: 599, type: !1036, isLocal: true, isDefinition: true)
!1036 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !1037)
!1037 = !{!1038}
!1038 = !DISubrange(count: 11)
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(scope: null, file: !2, line: 600, type: !957, isLocal: true, isDefinition: true)
!1041 = !DIGlobalVariableExpression(var: !1042, expr: !DIExpression())
!1042 = distinct !DIGlobalVariable(name: "vmstate_pl011", scope: !27, file: !2, line: 579, type: !809, isLocal: true, isDefinition: true)
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(scope: null, file: !2, line: 542, type: !1011, isLocal: true, isDefinition: true)
!1045 = !DIGlobalVariableExpression(var: !1046, expr: !DIExpression())
!1046 = distinct !DIGlobalVariable(name: "vmstate_pl011_clock", scope: !27, file: !2, line: 541, type: !809, isLocal: true, isDefinition: true)
!1047 = !DIGlobalVariableExpression(var: !1048, expr: !DIExpression())
